[
  {
    "topic": "agriculture",
    "title": "Agricultural product quality schemes: REPORT on the proposal for a regulation of the European Parliament and of the Council on agricultural product quality schemes",
    "background": "The European Commission proposed a regulation (COM(2010)0733) to reform EU agricultural product quality schemes, including protected designations of origin and geographical indications, aiming to simplify procedures and enhance market competitiveness. The Parliament will discuss measures to streamline quality certification systems and introduce new quality terms for agricultural products.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.8185185185185185,
        "choice": 8,
        "stance": "EPP strongly upholds the introduction of the \"mountain product\" designation, aligning with their commitment to rewarding quality-driven agriculture and recognizing the unique challenges faced by producers in high-altitude regions.  \nEPP applauds the streamlined certification processes and mandatory EU logo use for geographical indications, which enhance consumer trust and market visibility while reducing bureaucratic burdens for small-scale producers.  \nEPP welcomes strengthened protections for EU quality schemes in international trade agreements, underscoring their priority to defend European agricultural excellence against global imitation.  \nEPP proposes revisiting supply management mechanisms for producer consortias during CAP reform discussions to ensure fair market equilibrium, framing this as an enhancement opportunity rather than opposition to the current issue.  \nEPP endorses the integration of traditional specialty guarantees and local sales labels, viewing these as critical tools for preserving culinary heritage and empowering regional economies."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.0,
        "choice": 0,
        "stance": "GREEN_EFA rejects the diluted enforcement mechanisms in Article 12, absolutely opposeing with their demand for strict penalties against counterfeit agricultural products.  \nGREEN_EFA opposes the exclusion of Amendment 103 on geographical indications, which fails to protect small-scale producers as outlined in their rural development agenda.  \nGREEN_EFA condemns the Council’s disregard for colegislator parity, creating market distortions inconsistent with their fair competition principles.  \nGREEN_EFA highlights the issue’s failure to mandate CAP funding allocations for certification systems, undermining sustainability commitments.  \nGREEN_EFA asserts the compromise text abandons original transparency goals, particularly in labeling standards critical to consumer trust."
      },
      {
        "party_name": "SD",
        "score": 0.8586387434554974,
        "choice": 8,
        "stance": "SD strongly approves the enhanced geographical indication protections in Articles 4-6, particularly the ex officio enforcement against product imitation, aligning with S&D's commitment to fair producer compensation.  \nSD applauds the inclusion of \"mountain farming\" quality terms as a critical step toward recognizing regional production diversity, while proposing extending equivalent recognition to island agricultural products through amended Annex II specifications.  \nSD endorses the simplified PDO/PGI authorization procedures as effectively advancing small-scale producers' market access, a longstanding S&D rural development priority.  \nSD emphasizes the need to address unresolved production planning mechanisms for protected designations during upcoming CAP reforms, ensuring alignment with supply management tools in the milk sector.  \nSD approves the mandatory sustainability criteria in Article 12 as foundational to reconciling quality schemes with environmental priorities, urging accelerated implementation timelines."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.058823529411764705,
        "choice": 0,
        "stance": "GUE_NGL rejects the issue as it absolutely rejects with their opposition to market liberalization policies that perpetuate rural instability and undermine quality scheme effectiveness.  \nGUE_NGL opposes the proposal for neglecting systemic income inequality and purchasing power erosion, which are core barriers to equitable agricultural development.  \nGUE_NGL criticizes the issue’s failure to challenge deregulated global trade frameworks that weaken geographical indications and expose small producers to unfair competition.  \nGUE_NGL highlights the proposal’s omission of structural reforms to counter neoliberal policies crushing rural economies, rendering sustainability goals unattainable.  \nGUE_NGL asserts that without reversing agricultural deregulation, consumer protections and traditional product guarantees remain hollow, opposing its adoption."
      }
    ],
    "resolution": "The European Parliament raised its position on the Commission’s 2010 proposal (COM(2010)0733) concerning agricultural product quality schemes, adopting amendments to enhance transparency, consumer protection, and fair competition for farmers and producers. It emphasized the need for clear labeling standards, geographical indications, and traditional specialty guarantees to safeguard product authenticity and prevent market distortions. The resolution stressed aligning quality schemes with sustainability goals, promoting environmentally friendly practices, and ensuring small-scale producers’ access to certification systems. It called for robust enforcement mechanisms, including stricter penalties for non-compliance, and urged the Commission to allocate sufficient funding, particularly under the Common Agricultural Policy, to support implementation. Parliament also demanded regular monitoring and reporting on the scheme’s impact, with a focus on market performance, consumer trust, and rural development outcomes, while underscoring the importance of international cooperation to protect EU products in global trade agreements.",
    "total_score": 0.7002652519893899,
    "total_choice": 7,
    "party_num": 4,
    "id": 0,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.3,
      0.1,
      0.1,
      0.5
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "agriculture",
    "title": "Animal health: REPORT on the proposal for a regulation of the European Parliament and of the Council on Animal Health",
    "background": "Heightened cross-border trade complexities, fragmented EU animal health legislation, and incidents like the 2013 horsemeat scandal underscored gaps in food chain oversight. The Parliament will discuss updating EU animal health regulations to harmonize disease prevention measures and strengthen food safety controls across member states.",
    "stances": [
      {
        "party_name": "EFD",
        "score": 0.2903225806451613,
        "choice": 2,
        "stance": "EFD rejects the prohibition on live decoy birds for hunting, arguing they enable disease monitoring in wild birds, directly contradicting the issue's emphasis on standardized preventive measures.  \nEFD absolutely doubts centralized antimicrobial regulations, advocating instead for hunter-led wildlife surveillance systems inconsistent with the issue's harmonization goals.  \nThe proposal overlooks critical aspects of local ecological knowledge promoted by EFD, prioritizing bureaucratic pharmacovigilance over grassroots hunter networks.  \nEFD's insistence on cost-free wildlife monitoring through hunters conflicts with the issue's structured cross-border cooperation frameworks and budgeted health protections.  \nThe issue's 20% antimicrobial reduction target is incompatible with EFD's defense of unrestricted veterinary practices in wildlife management contexts."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.9310344827586207,
        "choice": 9,
        "stance": "GREEN_EFA entirely agrees the issue’s insistence on independent governmental controls for veterinary medicinal products, perfectly aligning with their commitment to preventing corporate interference in public health oversight.  \nGREEN_EFA perfectly aligns with the harmonization of pharmacovigilance systems and cross-border cooperation, recognizing these as vital to combating antimicrobial resistance across the EU.  \nGREEN_EFA highlights the necessity of retaining stringent accountability measures, such as explicitly naming violators in national reports, to ensure transparency and deter non-compliance.  \nGREEN_EFA applauds the binding 20% antimicrobial reduction target by 2030, reflecting their unwavering prioritization of One Health principles and sustainable farming practices.  \nGREEN_EFA supports proportionate implementation measures, such as flexible electronic tagging derogations for sheep, provided they uphold traceability goals and reduce burdens on farmers without compromising animal health standards."
      },
      {
        "party_name": "ECR",
        "score": 0.43859649122807015,
        "choice": 4,
        "stance": "ECR slightly advocates harmonization goals but requests amending Article 12 to replace \"shall levy fees\" with \"may levy fees\" to preserve member state fiscal autonomy  \nECR objects to including cloning and animal transport duration limits in the regulation, citing irrelevance to core animal health objectives in Section 5(b)  \nECR requests revisions ensuring flexible cross-border animal movement protocols between Northern Ireland and Ireland under Chapter 9 to protect existing trade frameworks  \nECR supports mandatory dog registration amendments but urges separate diplomatic pressure to counter politically motivated trade barriers like Russia's pork embargo  \nECR rejects plant health provisions in Title III as disproportionate, advocating risk-based phytosanitary controls instead of blanket import restrictions"
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.8857142857142857,
        "choice": 8,
        "stance": "GUE_NGL strongly approves the harmonization of EU animal movement rules, aligning with their commitment to recognizing Ireland as a single epidemiological unit to eliminate trade barriers and anticompetitive practices.  \nGUE_NGL proposes amending Article 4 to explicitly reference all-Ireland animal health strategies, ensuring partition does not obstruct cross-border trade or veterinary cooperation.  \nGUE_NGL applauds the issue’s emphasis on robust official controls, which advances their priority of preventing food safety crises like the horsemeat scandal through stringent oversight.  \nGUE_NGL endorses the issue’s cross-border pharmacovigilance measures, urging their extension to Ireland to unify disease management and uphold public health safeguards.  \nGUE_NGL recommends enhancing transparency in meat trade audits to align with the issue’s anti-fraud goals and deter market exploitation."
      }
    ],
    "resolution": "The European Parliament raised concerns regarding the Commission’s 2013 proposal (COM(2013)0260) on veterinary medicinal products, emphasizing the need to address antimicrobial resistance, harmonize EU market rules, and ensure public and animal health protections. The resolution supported stricter regulations on antimicrobial use, including banning prophylactic and metaphylactic non-therapeutic applications, promoting responsible use to reduce antimicrobial resistance risks, and enhancing transparency in veterinary drug distribution. It stressed harmonizing authorization procedures for veterinary medicines across member states, improving pharmacovigilance systems, and ensuring cross-border cooperation. The Parliament also advocated for measures to reduce veterinary antimicrobial use by 20% by 2030, stricter oversight of antimicrobial sales, and incentives for developing novel antimicrobials. It called on the Commission to resubmit the proposal if substantially amended and directed its position to be forwarded to the Council, Commission, and national parliaments to align legislative efforts.",
    "total_score": 0.7441253263707572,
    "total_choice": 7,
    "party_num": 4,
    "id": 1,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.4,
      0.3,
      0.1,
      0.2
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "agriculture",
    "title": "Adjustment rate to direct payments provided for in Regulation (EC) No 73/2009 in respect of calendar year 2013: REPORT on the proposal for a regulation of the European Parliament and of the Council on fixing an adjustment rate to direct payments provided for in Regulation (EC) No 73/2009 in respect of calendar year 2013",
    "background": "The European Commission proposed adjusting 2013 direct payment rates under Regulation (EC) No 73/2009 to align with 2014 budget constraints amid ongoing negotiations for the 2014-2020 Multiannual Financial Framework. The Parliament will discuss the proposed adjustment mechanism for agricultural subsidies to maintain expenditure within agreed financial ceilings.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.7843866171003717,
        "choice": 7,
        "stance": "EPP strongly accepts maintaining exemptions for small agricultural holdings under €5,000 to protect vulnerable farmers, aligning with social cohesion priorities.  \nEPP approves the issue’s budgetary discipline mechanism while proposing enhanced fairness through linear adjustments across member states to prevent disproportionate national burdens.  \nEPP emphasizes alignment with Article 349 TFEU by advocating explicit exemptions for ultra-peripheral regions’ direct payments to address structural disadvantages.  \nEPP endorses threshold-based reductions as a progressive measure but urges clearer harmonization of exemption criteria to prevent fragmentation.  \nEPP highlights the necessity of synchronizing this adjustment with ongoing CAP reform trilogues to ensure policy coherence across funding periods."
      },
      {
        "party_name": "ALDE",
        "score": 0.6987951807228916,
        "choice": 6,
        "stance": "ALDE supports the adjustment rate proposal but advises maintaining equal treatment through linear cuts across all member states to uphold financial discipline and fairness, as emphasized in the issue’s focus on policy coherence.  \nALDE suggests limiting direct payment reductions to the Commission’s initial 0.7% threshold for farmers above €5,000, opposing the higher 5% cut to prevent disproportionate budgetary impacts on agricultural stakeholders.  \nALDE recommends funding the market crisis reserve through alternative budget lines rather than excessive CAP reductions, ensuring alignment with the issue’s goal of balanced fiscal responsibility.  \nALDE advises against exempting small farms from cuts, stressing the need for gradual adaptation across all farm sizes to avoid distorting long-term agricultural sustainability.  \nALDE underscores the importance of interinstitutional dialogue to harmonize austerity measures with equitable burden-sharing, reflecting the issue’s emphasis on procedural integrity."
      },
      {
        "party_name": "ECR",
        "score": 0.08928571428571429,
        "choice": 0,
        "stance": "ECR rejects the proposed EUR 5 000 threshold as firmly opposeing with their principle of equal burden-sharing across all agricultural producers.  \nECR opposes selective financial discipline measures that disproportionately penalize medium and large farms, creating Orwellian \"more equal\" treatment tiers.  \nThe issue overlooks critical aspects of budgetary fairness by exempting 80% of beneficiaries while concentrating austerity on 20% of farmers.  \nECR condemns the adjustment rate mechanism as incompatible with creating a unified agricultural market, directly contradicting their advocacy for pan-European parity.  \nThis proposal's structural bias against Member States with consolidated farm structures violates ECR's core commitment to non-discriminatory policy frameworks."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.7058823529411765,
        "choice": 7,
        "stance": "GUE_NGL strongly advocates the issue's budgetary discipline objectives while proposing to enhance regional equity through Amendment 12 exclusion clauses.  \nGUE_NGL applauds the focus on legislative coherence but urges amending Article 2 to exempt ultra-peripheral regions and Aegean islands from crisis reserve contributions.  \nThis aligns perfectly with GUE_NGL's commitment to protecting vulnerable territories' special status under POSEI frameworks.  \nGUE_NGL emphasizes that maintaining 2013 funding levels for outermost regions would strengthen rather than contradict the issue's agricultural solidarity goals.  \nThe proposal effectively advances budgetary responsibility if modified to honor prior commitments about these regions' distinct needs."
      }
    ],
    "resolution": "The European Parliament raised its position on the Commission’s 2013 proposal (COM(2013)0159) concerning agricultural policy, adopting a first-reading stance to advance legislative procedures under Article 43(2) of the Treaty on the Functioning of the European Union. It emphasized the need for the Commission to re-engage Parliament if proposing substantial amendments or alternative texts to ensure alignment with legislative intent. The resolution drew on the Committee on Agriculture and Rural Development’s report (A7-0186/2013) and incorporated the Committee on Budgets’ opinion, reflecting a focus on policy coherence and budgetary implications. By finalizing its position, Parliament aimed to shape the legislative outcome while safeguarding procedural integrity and interinstitutional collaboration.",
    "total_score": 0.6710875331564987,
    "total_choice": 6,
    "party_num": 4,
    "id": 2,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.1,
      0.1,
      0.3,
      0.5
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "agriculture",
    "title": "Contractual relations in the milk and milk products sector: REPORT on the proposal for a regulation of the European Parliament and of the Council amending Council Regulation (EC) No 1234/2007 as regards contractual relations in the milk and milk products sector",
    "background": "Following the 2009 EU milk market crisis and 2008 decision to abolish milk quotas by 2015, structural challenges included supply chain imbalances, price volatility, and weakened producer bargaining power. The Parliament will discuss regulatory amendments to address contractual relations between farmers and processors, enhance producer organizations, and improve sector transparency.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.937037037037037,
        "choice": 9,
        "stance": "EPP completely sanctions the issue's provisions enabling milk producers to organize into stronger units through competition law derogations, perfectly aligning with EPP's commitment to empowering agricultural competitiveness.  \nEPP perfectly aligns with the geographic protection mechanisms for vulnerable regions, urging future Commission proposals to operationalize grass-based production sustainability as a natural extension of this framework.  \nEPP completely sanctions contractual standardization between farmers and processors while proposing enhanced supply chain transparency measures between retailers and dairies as a logical next policy phase.  \nEPP perfectly supports the issue's compliance with Articles 42/43 TFEU, emphasizing its congruence with EPP's agricultural policy coherence objectives across single market rules.  \nEPP completely sanctions the trialogue compromise on interprofessional organizations, viewing it as foundational for post-2015 quota reforms requiring subsequent market stabilization instruments."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.05263157894736842,
        "choice": 0,
        "stance": "GREEN_EFA opposes fundamentally the allowance of dairy collectives up to 3.5% market share, which entrenches dominance of existing large dairies controlling over 6% of production, contradicting fair market access principles.  \nGREEN_EFA rejects voluntary contractual frameworks as ineffective, citing the issue’s failure to mandate price transparency or binding agreements, leaving producers vulnerable to exploitative industry practices.  \nGREEN_EFA condemns the omission of production monitoring mechanisms post-milk quotas, warning this omission replicates pre-crisis conditions and prioritizes industrial interests over smallholder sustainability.  \nGREEN_EFA disputes the issue’s alignment with Article 42 TFEU, arguing it neglects mandatory interprofessional associations to balance stakeholder power, as exemplified by regional collapses in Galicia and Denmark.  \nGREEN_EFA highlights the proposal’s inconsistency with environmental and social equity goals, noting concentrated industrial farms exacerbate ecological damage without crisis-proofing via public oversight."
      },
      {
        "party_name": "ECR",
        "score": 0.8363636363636363,
        "choice": 8,
        "stance": "ECR strongly endorses the proposal’s emphasis on regulating contractual relations to strengthen dairy farmers’ bargaining power, aligning with their commitment to equitable agricultural markets and crisis resilience.  \nECR approves the flexibility granted to Member States in tailoring contract regulations, proposing that such autonomy be paired with EU-level safeguards to prevent market distortions while addressing regional disparities.  \nECR endorses the abolition of milk quotas as a progressive shift toward market-driven competitiveness, reflecting their principles of reducing bureaucratic overreach and fostering economic efficiency.  \nECR highlights the necessity of bolstering farmer cooperatives and associations, urging explicit integration of cooperative support mechanisms in the regulation’s implementation to protect small-scale producers.  \nECR commends the issue’s adherence to Articles 42 and 43 TFEU, reinforcing their advocacy for harmonizing EU agricultural coherence with respect for national subsidiarity."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.0,
        "choice": 0,
        "stance": "GUE_NGL totally doubts the issue's alignment with milk quota abolition, which perpetuates market deregulation favoring corporate interests over small producers' survival.  \nGUE_NGL rejects the proposal's failure to mandate price controls, directly conflicting with their demand for cost-based producer compensation and equitable value distribution.  \nThe issue's promotion of export-driven intensification contradicts GUE_NGL's environmental priorities and food sovereignty principles, enabling ecologically harmful production models.  \nGUE_NGL condemns the issue's reliance on voluntary contracts as structurally biased toward processors and retailers, ignoring power imbalances critical to their advocacy for binding safeguards.  \nBy accelerating dairy sector concentration in wealthier Member States, the issue undermines GUE_NGL's anti-dumping stance and defense of regional agricultural diversity."
      }
    ],
    "resolution": "The European Parliament raised its position on a legislative proposal concerning agricultural and rural development (COM(2010)0728), adopting its first-reading stance as outlined in the Committee on Agriculture and Rural Development’s report (A7-0262/2011). It emphasized compliance with EU principles, particularly addressing concerns from the Polish Diet regarding subsidiarity, which argued the proposal overstepped national competencies. The resolution urged the Commission to resubmit the matter to Parliament if proposing substantial amendments or alternative texts, ensuring legislative oversight. It also instructed the Parliament’s President to transmit its position to the Council, Commission, and national parliaments, reflecting procedural adherence while integrating feedback from the European Economic and Social Committee’s 2011 opinion. The resolution focused on aligning the proposal with Treaty objectives under Articles 42 and 43(2) TFEU, balancing EU-wide agricultural policy coherence with respect for member state autonomy.",
    "total_score": 0.7622841965471447,
    "total_choice": 7,
    "party_num": 4,
    "id": 3,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.1,
      0.1,
      0.2,
      0.6
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "agriculture",
    "title": "Financing of the common agricultural policy: REPORT on the proposal for a regulation of the European Parliament and of the Council amending Council Regulation (EC) No 1290/2005 on the financing of the common agricultural policy and repealing Council Regulation (EC) No 165/94 and Council Regulation (EC) No 78/2008",
    "background": "The Treaty of Lisbon’s entry into force introduced revised EU legislative procedures, replacing comitology with delegated and implementing acts. This necessitated alignment of existing CAP financing regulations under Articles 290 and 291 TFEU, amid national parliamentary scrutiny on subsidiarity. The Parliament will discuss updating CAP financial mechanisms to comply with post-Lisbon institutional frameworks.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9111111111111111,
        "choice": 9,
        "stance": "EPP entirely sanctions the issue’s alignment with Lisbon Treaty codecision powers, perfectly reflecting their commitment to legislative clarity and delegated act flexibility in CAP governance.  \nEPP perfectly aligns with the issue’s rejection of Council inflexibility on implementing acts, emphasizing Parliament’s role as colegislator to ensure democratic agricultural policymaking.  \nEPP fully supports integrating critical CAP provisions into basic acts, advancing their priority of direct parliamentary oversight over technical and financial implementation details.  \nEPP endorses the issue’s urgency in concluding Treaty alignment before CAP reform negotiations, viewing this as essential to uphold institutional parity with the Council.  \nEPP perfectly aligns with maintaining crisis reserve mechanisms and modulated payments, reinforcing their manifesto focus on market stability and equitable competition across Member States."
      },
      {
        "party_name": "EFD",
        "score": 0.5483870967741935,
        "choice": 5,
        "stance": "EFD supports the simplification measures in rural development programs, particularly the reduction of administrative reporting requirements, aligning with efforts to reduce bureaucratic burdens.  \nEFD advises maintaining support for producer associations in the fruit and vegetable sector, as highlighted in the issue, to strengthen collective bargaining power.  \nEFD proposes amending provisions on Commission implementing acts to ensure parliamentary oversight, addressing concerns over democratic accountability raised during debate.  \nEFD suggests reviewing subsidy allocations for organic farming to prioritize cost-efficiency and equitable access across agricultural sectors.  \nEFD supports allowing regional program flexibility in financial decommitment calculations, as this respects Member States' operational autonomy."
      },
      {
        "party_name": "ALDE",
        "score": 0.927710843373494,
        "choice": 9,
        "stance": "ALDE fully accepts the issue's insistence on upholding colegislative powers under the Lisbon Treaty, perfectly aligning with their commitment to institutional parity in EU decision-making.  \nALDE perfectly aligns with the issue's emphasis on transmitting positions to all EU institutions, reinforcing their longstanding priority of inter-institutional accountability.  \nALDE fully accepts the incorporation of national parliaments' subsidiarity concerns, recognizing this as vital to maintaining balanced EU legislative frameworks.  \nALDE strongly promotes the issue's demand for Commission re-engagement on amendments, seeing this as essential for preserving parliamentary oversight rights.  \nALDE perfectly aligns with the issue's legal rigor in citing TFEU Articles 42 and 43(2), reflecting their constitutionalist approach to agricultural policy governance."
      },
      {
        "party_name": "SD",
        "score": 0.9214659685863874,
        "choice": 9,
        "stance": "SD absolutely endorses the issue's strict adherence to Treaty of Lisbon provisions, perfectly aligning with SD's commitment to reinforcing parliamentary sovereignty in CAP governance.  \nSD perfectly aligns with the insistence on maintaining delegated acts as originally proposed by the Commission, ensuring legal certainty and uninterrupted farmer support through Treaty-compliant mechanisms.  \nSD absolutely endorses Parliament's institutional role in CAP implementation decisions, effectively advancing SD's priority of democratic accountability in EU agricultural spending.  \nSD perfectly supports rejecting Council attempts to dilute parliamentary oversight through implementing acts, upholding Lisbon Treaty principles of institutional balance.  \nSD absolutely endorses transmitting the issue to national parliaments, strengthening subsidiarity dialogues while preserving unified CAP management under TFEU frameworks."
      }
    ],
    "resolution": "The European Parliament raised its position on a legislative proposal (COM(2010)0745) concerning agricultural policy under Articles 42 and 43(2) of the Treaty on the Functioning of the European Union (TFEU), adopting its first-reading stance while addressing concerns over subsidiarity. It noted the Polish Senate’s reasoned objection under Protocol No 2, which argued the proposal violated subsidiarity principles, alongside contributions from the Italian, Portuguese, and Romanian parliaments. The resolution incorporated the European Economic and Social Committee’s opinion of 4 May 2011 and urged the Commission to re-engage Parliament if proposing substantial amendments. It directed its President to transmit the adopted position to the Council, Commission, and national parliaments, emphasizing adherence to TFEU legal frameworks and procedural accountability.",
    "total_score": 0.8620689655172413,
    "total_choice": 8,
    "party_num": 4,
    "id": 4,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.4,
      0.3,
      0.2,
      0.1
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "agriculture",
    "title": "Common organisation of agricultural markets and specific provisions for certain agricultural products: REPORT on the proposal for a regulation of the European Parliament and of the Council establishing a common organisation of agricultural markets and on specific provisions for certain agricultural products (Single CMO Regulation)",
    "background": "The Treaty of Lisbon’s entry into force required updating EU agricultural legislation to align with revised institutional procedures, particularly replacing comitology with delegated and implementing acts. The Parliament will discuss adjustments to the Single Common Market Organisation Regulation under the Treaty’s legal framework for agricultural policy implementation.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9037037037037037,
        "choice": 9,
        "stance": "EPP totally agrees the issue's insistence on Treaty-compliant delegation of agricultural policy authority, perfectly aligning with their commitment to parliamentary sovereignty in CAP legislation.  \nEPP perfectly aligns with the prioritization of subsidiarity principles in CAP reforms, endorsing the integration of national parliamentary objections to preserve Member State policymaking autonomy.  \nEPP unreservedly supports maintaining crisis reserve funding levels and modulation mechanisms as critical tools for stabilizing EU agricultural markets, reflecting their manifesto pledge for food security.  \nEPP strongly advocates for transparent trialogue processes with expanded committee access, reinforcing the issue's demand for democratic accountability in technical agricultural negotiations.  \nEPP completely agrees with anchoring substance lists in regulatory annexes to prevent discretionary Council overreach, upholding Parliament's colegislative rights under TFEU Article 290."
      },
      {
        "party_name": "EFD",
        "score": 0.5483870967741935,
        "choice": 5,
        "stance": "EFD supports the simplification measures in rural development, particularly the reduction of administrative burdens through streamlined reporting requirements.  \nEFD advises reviewing the allocation of subsidies for organic farming to ensure cost-effectiveness and equitable access across agricultural sectors.  \nEFD expresses concern over perceived Commission overreach in implementing acts, urging stricter adherence to subsidiarity principles.  \nEFD endorses maintaining support for producer associations in the fruit and vegetable sector as vital for market stability.  \nEFD suggests prioritizing policy adjustments that address immediate market pressures on conventional farmers, such as grain price volatility.  "
      },
      {
        "party_name": "ALDE",
        "score": 0.927710843373494,
        "choice": 9,
        "stance": "ALDE firmly sanctions the issue’s insistence on strict adherence to subsidiarity and proportionality, perfectly aligning with the party’s foundational principle of safeguarding national policymaking autonomy while ensuring EU competence remains narrowly tailored.  \nALDE perfectly aligns with the issue’s demand for robust interinstitutional dialogue, reflecting the party’s unwavering commitment to defending Parliament’s colegislative authority under the Lisbon Treaty against Council overreach on implementing acts.  \nALDE fully supports the prioritization of Treaty compliance under TFEU Articles 42 and 43(2), viewing this as critical to advancing agricultural reforms that respect shared decision-making and prevent unilateral Council dominance.  \nALDE strongly endorses the issue’s integration of national parliaments’ subsidiarity objections, recognizing this as a necessary procedural safeguard to uphold the EU’s constitutional balance in agricultural market governance.  \nALDE applauds the issue’s call for Commission accountability, which directly advances the party’s mandate to ensure Parliament’s equal role in shaping agricultural secondary legislation post-Lisbon, as emphasized in the debate’s critique of institutional power imbalances."
      },
      {
        "party_name": "SD",
        "score": 0.9267015706806283,
        "choice": 9,
        "stance": "SD completely supports the issue’s strict adherence to Treaty of Lisbon protocols, perfectly aligning with S&D’s commitment to reinforcing Parliament’s legislative authority in agricultural policymaking.  \nSD perfectly aligns with the insistence on delegated acts as essential tools to safeguard democratic accountability, countering the Council’s attempts to dilute parliamentary oversight through implementing acts.  \nSD completely supports the prioritization of subsidiarity compliance, ensuring agricultural market measures remain legally sound and insulated from judicial challenges that could destabilize farmer support systems.  \nSD applauds the issue’s defense of interinstitutional balance, effectively advancing S&D’s mandate to protect integrated EU policies from fragmented national interventions.  \nSD emphasizes the critical linkage between Treaty fidelity and policy continuity, ensuring CAP reforms remain focused on substantive farmer protections rather than procedural disputes."
      }
    ],
    "resolution": "The European Parliament raised concerns regarding the Commission’s legislative proposal on agricultural policy reform (COM(2010)0799), emphasizing compliance with the principles of subsidiarity and proportionality. It noted reasoned objections from the national parliaments of Luxembourg, Poland, and Sweden, which argued the proposal overstepped EU competence into national policymaking. Parliament adopted its first-reading position, outlined in the Committee on Agriculture and Rural Development’s report (A7-0322/2011), and urged the Commission to re-engage Parliament if substantial amendments or alternative texts were proposed. It further instructed its President to transmit its position to the Council, Commission, and national parliaments, reflecting its commitment to interinstitutional dialogue and adherence to procedural safeguards under the Treaty on the Functioning of the European Union (Articles 42, 43(2), and 294). The resolution integrated the European Economic and Social Committee’s March 2011 opinion but prioritized addressing subsidiarity concerns while advancing agricultural policy objectives.",
    "total_score": 0.8607427055702918,
    "total_choice": 8,
    "party_num": 4,
    "id": 5,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.1,
      0.3,
      0.5,
      0.1
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "agriculture",
    "title": "Common rules for direct support schemes for farmers: REPORT on the proposal for a regulation of the European Parliament and of the Council amending Council Regulation (EC) No 73/2009 establishing common rules for direct support schemes for farmers under the common agricultural policy and establishing certain support schemes for farmers",
    "background": "The Treaty of Lisbon (2009) introduced new legislative procedures requiring alignment of existing EU regulations with delegated and implementing acts. The European Commission proposed amendments to Common Agricultural Policy rules on direct farmer support to comply with updated comitology frameworks. The Parliament will discuss regulatory adjustments to align agricultural policy with post-Lisbon Treaty governance structures.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9074074074074074,
        "choice": 9,
        "stance": "EPP fully supports the issue’s alignment with Parliament’s codecision authority under the Lisbon Treaty, ensuring agricultural legislation prioritizes democratic oversight and legal clarity for farmers.  \nEPP perfectly aligns with the necessity of embedding core agricultural policies within primary legislation to uphold parliamentary authority over CAP reforms, as emphasized in Articles 42 and 43(2) TFEU.  \nEPP fully supports advancing plenary votes to assert Parliament’s role as co-legislator, reinforcing the commitment to transparent and decisive policymaking when consensus with the Council proves unattainable.  \nEPP perfectly aligns with the issue’s emphasis on maintaining a firm negotiating mandate to ensure balanced inter-institutional dialogue, reflecting Parliament’s demonstrated compromise readiness contrasted with Council inflexibility.  \nEPP fully supports the strategic allocation of direct payments to stabilize food markets and safeguard agricultural competitiveness, consistent with the issue’s focus on proportionate subsidiarity adherence."
      },
      {
        "party_name": "EFD",
        "score": 0.5483870967741935,
        "choice": 5,
        "stance": "EFD supports the issue’s procedural accountability measures but advises reassessing disproportionate support for organic farming schemes to prioritize cost-effective relief for all farmers amid rising input costs.  \nEFD highlights concerns over bureaucratic overreach in Commission implementing acts, urging stricter adherence to subsidiarity to prevent democratic deficits under Lisbon Treaty frameworks.  \nEFD endorses simplifying rural development reporting requirements and maintaining producer association support in the fruit and vegetable sector as steps toward reducing administrative burdens.  \nEFD suggests amending regional financial decommitment rules to allow Member State-level calculations, ensuring flexibility for diverse agricultural systems.  \nEFD advises reallocating resources from niche environmental schemes to address urgent market pressures, such as grain price volatility, while retaining core rural development objectives."
      },
      {
        "party_name": "ALDE",
        "score": 0.927710843373494,
        "choice": 9,
        "stance": "ALDE firmly endorses the issue’s insistence on strict subsidiarity compliance, perfectly aligning with their foundational principle of balanced EU governance that respects national competencies.  \nALDE recognizes the issue as a robust defense of Parliament’s colegislative rights under the Lisbon Treaty, directly countering the Council’s attempts to marginalize parliamentary oversight in agricultural policy.  \nThe issue’s demand for Commission accountability in reassessing proposal scope resonates perfectly with ALDE’s advocacy for institutional parity and Treaty fidelity.  \nALDE applauds the issue’s procedural reinforcement of inter-institutional dialogue, advancing their long-standing priority of transparent, collaborative EU decision-making.  \nThis position exemplifies ALDE’s unwavering commitment to ensuring Lisbon-era power-sharing prevails over outdated Council-centric approaches in CAP governance."
      },
      {
        "party_name": "SD",
        "score": 0.9162303664921466,
        "choice": 9,
        "stance": "SD completely advocates the strict adherence to delegated acts under the Lisbon Treaty, perfectly aligning with Parliament’s enhanced role in safeguarding democratic agricultural policy processes.  \nSD perfectly aligns with the issue’s insistence on legal compliance to prevent CAP suspension, ensuring uninterrupted support for farmers through Treaty-conforming mechanisms.  \nSD fully supports the Commission’s original proposal as legally robust, emphasizing its necessity to avoid Court of Justice challenges that would destabilize CAP implementation.  \nSD strongly advocates for inter-institutional balance, endorsing the issue’s reinforcement of Parliament’s authority against Council attempts to dilute delegated act provisions.  \nSD emphasizes unwavering alignment with Lisbon Treaty principles, ensuring substantive policy debates over technicalities to advance farmers’ interests through CAP reforms."
      }
    ],
    "resolution": "The European Parliament raised concerns regarding the compliance of the Commission’s 2010 legislative proposal (COM(2010)0539) with the principle of subsidiarity, following reasoned objections from the Lithuanian, Luxembourg, and Polish parliaments. The resolution, grounded in Treaty on the Functioning of the European Union Articles 42 and 43(2) on agriculture, emphasized the need to align the proposal with EU competences while acknowledging the European Economic and Social Committee’s 2011 opinion. It adopted Parliament’s first-reading position, urging the Commission to reassess the proposal’s scope to ensure adherence to subsidiarity and proportionality. The resolution further called on the Commission to re-engage Parliament if substantial amendments or alternative texts were proposed and directed the Parliament’s President to transmit its position to the Council, Commission, and national parliaments, reinforcing procedural accountability and inter-institutional dialogue.",
    "total_score": 0.8594164456233422,
    "total_choice": 8,
    "party_num": 4,
    "id": 6,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.6,
      0.2,
      0.1,
      0.1
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "agriculture",
    "title": "Decision on the opening of, and mandate for, interinstitutional negotiations on common organisation of the markets in agricultural products (Single CMO Regulation): PROPOSAL FOR A DECISION ON THE OPENING OF, AND MANDATE FOR, INTERINSTITUTIONAL NEGOTIATIONS  on the proposal for a regulation of the European Parliament and of the Council establishing a common organisation of the markets in agricultural products (Single CMO Regulation)",
    "background": "The European Commission proposed reforms to the Common Agricultural Policy (CAP) as part of the 2014-2020 Multiannual Financial Framework negotiations, aiming to modernize EU agricultural market regulations. The Parliament will discuss initiating interinstitutional negotiations on establishing a common organization of agricultural markets under the Single CMO Regulation.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.8148148148148148,
        "choice": 8,
        "stance": "EPP strongly agrees the integration of greening measures into direct payments as a transformative step towards sustainable agriculture, aligning with EPP's commitment to environmental stewardship while maintaining farm competitiveness.  \nEPP approves the phased elimination of historical payment systems but proposes enhanced equivalence mechanisms to recognize advanced agri-environment programs, preventing double-counting while rewarding existing sustainability efforts.  \nEPP endorses the issue's budgetary linkage to MFF while suggesting accelerated convergence timelines for newer member states to address regional disparities in direct payments.  \nEPP fully backs the amendment ensuring Baltic states receive at least 55% of EU average payments by 2014, viewing this as critical for achieving fair competition within single market principles.  \nEPP strongly agrees maintaining vineyard planting rights until 2018 and milk quotas until 2020, effectively advancing market stability for Mediterranean and small-scale producers."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.0,
        "choice": 0,
        "stance": "GREEN_EFA rejects the issue's failure to mandate binding ecological farming practices, fully disapproveing with their demand for 7% chemical-free ecological focus areas and crop rotation requirements.  \nGREEN_EFA opposes the allowance of export subsidies in the proposal, which directly contradicts their principle of ending trade-distorting practices harming developing nations.  \nGREEN_EFA condemns the absence of meaningful subsidy redistribution, highlighting that the 300,000€ payment cap proposal ignores their call for a 100,000€ limit to prioritize small-scale farmers.  \nGREEN_EFA fully disapproves with the issue's omission of a protein strategy to reduce unsustainable soy imports, a critical gap in addressing industrial livestock overproduction.  \nGREEN_EFA rejects the procedural undermining of ambitious greening amendments, particularly the failure to prioritize crop rotation votes over weaker diversification measures as required by parliamentary rules."
      },
      {
        "party_name": "ECR",
        "score": 0.10909090909090909,
        "choice": 1,
        "stance": "ECR completely disapproves the reintroduction of market intervention mechanisms as outlined in the Single CMO Regulation, which they condemn as a regressive return to production quotas and price guarantees inconsistent with competitive agriculture.  \nECR rejects the proposed greening requirements as bureaucratic overreach that imposes unworkable land management constraints while failing to deliver meaningful environmental benefits.  \nThe issue’s failure to fully eliminate payment disparities between old and new Member States directly contradicts ECR’s demand for immediate budgetary equality across all EU farmers.  \nECR condemns the sugar regime extension as market-distorting protectionism that advantages beet producers over cane refiners, undermining fair competition.  \nThe proposal’s tolerance for coupled payments and risk management subsidies in Pillar Two is denounced as financially irresponsible, rewarding inefficiency contrary to ECR’s free-market principles."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.11764705882352941,
        "choice": 1,
        "stance": "GUE_NGL rejects the negotiation mandate as absolutely doubting with their demand for equitable agricultural subsidies, citing the issue's failure to cap payments below €100 000 and redistribute funds to small-scale sustainable farming.  \nGUE_NGL opposes the proposal's market-driven framework for overlooking critical aspects like price regulation mechanisms and binding quotas to stabilize dairy and sugar production, which they deem essential to counter corporate agribusiness dominance.  \nGUE_NGL condemns the issue’s silence on environmental safeguards, particularly its allowance of weakened greening requirements that perpetuate industrialized farming’s pollution of EU water systems.  \nGUE_NGL highlights the proposal’s inconsistency with food sovereignty principles by permitting free-trade policies that undermine local production and fail to establish social/environmental border tariffs.  \nGUE_NGL demands rejection of the mandate until it incorporates mandatory support for public agricultural insurance and strict definitions of \"active farmers\" to exclude absentee landowners and speculative entities."
      }
    ],
    "resolution": "The European Parliament raised the need to address the financial framework for agricultural and rural development policies, emphasizing that the proposed financial envelope for these initiatives remains indicative and contingent upon the final agreement on the multiannual financial framework (MFF) regulation for 2014-2020. It highlighted the interdependence between the legislative proposal’s budgetary allocation and the broader MFF negotiations, stressing that definitive funding levels cannot be established until the overarching financial framework is adopted. To advance this process, the Parliament decided to initiate interinstitutional negotiations based on the mandate that the financial provisions must align with the eventual MFF agreement, ensuring coherence and feasibility in funding agricultural and rural development programs during the specified seven-year period.",
    "total_score": 0.49867021276595747,
    "total_choice": 4,
    "party_num": 4,
    "id": 7,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.1,
      0.1,
      0.4,
      0.4
    ],
    "veto_party_name": "GUE_NGL"
  },
  {
    "topic": "agriculture",
    "title": "Decision on the opening of, and mandate for, interinstitutional negotiations on direct payments to farmers under support schemes within the framework of the CAP: PROPOSAL FOR A DECISION ON THE OPENING OF, AND MANDATE FOR, INTERINSTITUTIONAL NEGOTIATIONS on the proposal for a regulation of the European Parliament and of the Council establishing rules for direct payments to farmers under support schemes within the framework of the common agricultural policy",
    "background": "The European Parliament's co-legislative role under the Lisbon Treaty required engagement in reforming Common Agricultural Policy (CAP) direct payments for 2014-2020, aligning with EU budgetary frameworks and addressing agricultural sustainability, market stability, and equitable fund distribution. The Parliament will discuss initiating interinstitutional negotiations on CAP support schemes' financial rules and implementation mechanisms.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.7777777777777778,
        "choice": 7,
        "stance": "EPP strongly approves the integration of greening requirements into direct payments, ensuring environmental accountability while maintaining agricultural productivity. This aligns perfectly with EPP's longstanding commitment to sustainable farming practices.  \nEPP endorses the issue's emphasis on budgetary coherence with the multiannual financial framework, ensuring CAP reforms maintain strategic priorities for rural development. The issue effectively advances EPP's priority of linking agricultural support to long-term EU objectives.  \nEPP advocates for accelerated payment convergence mechanisms to address historical disparities, particularly supporting Amendment 139 to ensure Baltic states reach at least 75% of the EU average payment by 2019 as a fairness imperative.  \nEPP approves the recognition of equivalent environmental benefits between agri-environment programs and greening measures, proposing simplified administrative procedures to avoid double compliance burdens on farmers.  \nEPP proposes enhanced Council transparency in sharing biophysical criteria simulations for disadvantaged area classifications during negotiations to ensure evidence-based territorial adjustments."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.05172413793103448,
        "choice": 0,
        "stance": "GREEN_EFA rejects the issue's approach to direct payments as fundamentally incompatible with ecological transition principles.  \nGREEN_EFA opposes the failure to mandate 7% chemical-free ecological focus areas, contradicting their soil protection agenda.  \nGREEN_EFA condemns allowing 300k€ payment ceilings instead of their demanded 100k€ cap, perpetuating industrial farm subsidies.  \nGREEN_EFA denounces the absence of binding crop rotation rules, enabling destructive monocultures opposed in all party amendments.  \nGREEN_EFA declares the issue illegitimate for ignoring 3.5 million lost EU farms - a crisis requiring radical redistribution unaddressed in MFF alignment debates."
      },
      {
        "party_name": "ALDE",
        "score": 0.6626506024096386,
        "choice": 6,
        "stance": "ALDE supports the issue’s alignment with MFF budgetary coherence while proposing amendments to reintroduce key cross-compliance standards (SMRs/GAECs) with exemptions for carbon-rich soil management and electronic identification systems.  \nALDE advises maintaining Member State flexibility in greening implementation through Commission-monitored equivalence mechanisms to prevent environmental dilution of sustainability goals.  \nALDE cautions against expanding market intervention tools that risk distorting agricultural competitiveness, stressing the need to prioritize market-oriented approaches over surplus-dependent systems.  \nALDE strongly endorses transparency measures requiring full public disclosure of subsidy recipients to align CAP expenditures with democratic accountability principles.  \nALDE recommends conditioning Pillar 1 to Pillar 2 budget transfers on national co-financing commitments to ensure rural development programs remain adequately resourced."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.14705882352941177,
        "choice": 1,
        "stance": "GUE_NGL rejects the proposal as fundamentally incompatible with their demand for price guarantees and market regulation to combat agricultural speculation  \nGUE_NGL opposes the inadequate payment caps that perpetuate unequal distribution favoring agribusiness over family farms  \nGUE_NGL condemns the failure to implement mandatory smallholder protections and environmental visa systems at EU borders  \nGUE_NGL highlights the proposal's contradiction with food sovereignty principles through its maintenance of destructive free-trade frameworks  \nGUE_NGL demands binding quotas for sustainable production rather than market-driven reforms exacerbating rural inequality"
      }
    ],
    "resolution": "The European Parliament raised concerns regarding the provisional nature of the financial envelope outlined in the legislative proposal, emphasizing that it serves only as an indicative figure pending the finalization of the multiannual financial framework (MFF) regulation for 2014-2020. The resolution highlighted that the proposed budget cannot be definitively established until an agreement is reached on the MFF, which determines the EU’s long-term spending priorities and resource allocation. By stressing the interdependence between the legislative proposal and the broader financial framework, the Parliament underscored the need for coherence in budgetary planning to ensure alignment with strategic objectives for agriculture and rural development during the specified seven-year period.",
    "total_score": 0.5678191489361702,
    "total_choice": 5,
    "party_num": 4,
    "id": 8,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.4,
      0.1,
      0.2,
      0.3
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "agriculture",
    "title": "Decision on the opening of, and mandate for, interinstitutional negotiations on financing, management and monitoring of the CAP: PROPOSAL FOR A DECISION ON THE OPENING OF, AND MANDATE FOR, INTERINSTITUTIONAL NEGOTIATIONS on the proposal for a regulation of the European Parliament and of the Council on the financing, management and monitoring of the CAP",
    "background": "The European Union's Common Agricultural Policy undergoes periodic reforms to align with evolving agricultural, economic, and environmental priorities. Proposed regulatory updates addressing budget allocation, subsidy distribution, and compliance mechanisms under the 2014-2020 financial framework prompted legislative review. The Parliament will discuss interinstitutional negotiations on CAP financing, management structures, and monitoring systems.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.8555555555555555,
        "choice": 8,
        "stance": "EPP strongly promotes the integration of greening requirements into Pillar 1 direct payments, aligning with their commitment to environmental sustainability while maintaining agricultural competitiveness through phased ecological focus area implementation.  \nEPP endorses the gradual transition from historical payment models to regionalized systems, emphasizing the need for measured convergence to ensure fairness across member states and prevent distortions in land markets.  \nEPP approves enhanced flexibility between CAP pillars, enabling member states to tailor rural development programs to local needs while maintaining strong environmental safeguards for biodiversity and climate-smart practices.  \nEPP advocates maintaining strategic production capacities through coupled support measures, particularly for olive oil and wine sectors, ensuring Europe’s agricultural diversity and quality standards are preserved.  \nEPP proposes accelerating payment convergence timelines for newer member states to achieve 75% of EU average by 2024 rather than 2029, addressing regional disparities while preserving budget stability."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.0,
        "choice": 0,
        "stance": "GREEN_EFA rejects the issue's diluted environmental commitments as entirely conflicting with their demand for binding crop rotation and 7% chemical-free ecological focus areas.  \nGREEN_EFA opposes the subsidy structure for perpetuating industrial agriculture, noting the issue's failure to cap payments at €100,000 per farm as explicitly demanded in debates.  \nGREEN_EFA condemns the omission of a protein strategy to reduce soy imports, which directly contradicts their emphasis on ending ecologically destructive feed dependencies.  \nGREEN_EFA opposes allowing continued exports of subsidized surpluses, a practice denounced as \"suicidal\" for farmers and developing nations in parliamentary interventions.  \nGREEN_EFA highlights the issue's failure to redirect 30% of CAP funds to meaningful eco-schemes, noting its voluntary measures violate their \"public money for public goods\" principle."
      },
      {
        "party_name": "ECR",
        "score": 0.8181818181818182,
        "choice": 8,
        "stance": "ECR strongly upholds the issue’s emphasis on fair income convergence and eliminating payment disparities for new member states, aligning with ECR’s commitment to treaty-based equality and solidarity.  \nECR approves the €50 billion allocation for climate-smart agriculture but proposes redirecting rigid environmental set-aside requirements to innovation-driven precision farming to enhance competitiveness.  \nECR endorses simplified administrative frameworks for small farmers, advocating automatic inclusion of those receiving under €2,000 in support to reduce bureaucratic overhead.  \nECR commends rural development funding for digitalization but urges greater flexibility in greening measures through targeted Pillar Two schemes tailored to local needs.  \nECR highlights the need to revise sugar market provisions to ensure equal access for cane refiners and beet processors, fostering competition while maintaining food security goals."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.14705882352941177,
        "choice": 1,
        "stance": "GUE/NGL rejects the proposed CAP financing framework for maintaining excessive payment caps that disproportionately benefit large agri-businesses, contradicting their demand for redistributive aid targeting small farms.  \nGUE/NGL opposes the issue's market-oriented approach as firmly doubting with their principles of food sovereignty, citing the absence of price guarantees and production quotas to stabilize farmer incomes.  \nGUE/NGL condemns the insufficient environmental safeguards, arguing that the 50% pesticide reduction target overlooks the need to dismantle industrialized farming models polluting EU water systems.  \nGUE/NGL rejects the failure to abolish sugar production quotas by 2015, a measure critical to reducing consumer prices and supporting Latvian agricultural competitiveness as raised by Alfreds Rubiks.  \nGUE/NGL opposes the issue's silence on public agricultural insurance and mandatory smallholder systems, which they deem essential to protect economically vulnerable farming households."
      }
    ],
    "resolution": "The European Parliament raised concerns regarding the challenges facing agricultural sectors and rural communities, emphasizing the need for sustainable practices, fair income for farmers, and enhanced biodiversity protection. It advocated for increased funding under the Common Agricultural Policy (CAP) to support small and medium-sized farms, with specific allocations of €50 billion over the next five years for climate-smart initiatives and €10 billion for rural development programs targeting digitalization and youth employment. The resolution called for stricter enforcement of environmental regulations, including reducing pesticide use by 50% by 2030 and allocating 30% of CAP funds to eco-schemes. It also urged member states to prioritize animal welfare standards and ensure transparent food supply chains to address market imbalances. Additionally, the Parliament stressed the importance of aligning agricultural policies with the European Green Deal and achieving carbon neutrality in the sector by 2040.",
    "total_score": 0.6303191489361702,
    "total_choice": 6,
    "party_num": 4,
    "id": 9,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.3,
      0.1,
      0.5,
      0.1
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "agriculture",
    "title": "Decision on the opening of, and mandate for, interinstitutional negotiations on support for rural development by the European Agricultural Fund for Rural Development (EAFRD): PROPOSAL FOR A DECISION ON THE OPENING OF, AND MANDATE FOR, INTERINSTITUTIONAL NEGOTIATIONS on the proposal for a regulation of the European Parliament and of the Council on support for rural development by the European Agricultural Fund for Rural Development (EAFRD)",
    "background": "The European Agricultural Fund for Rural Development (EAFRD) operates within the Common Agricultural Policy framework, with its financial allocation contingent on the 2014-2020 Multiannual Financial Framework negotiations. The Parliament will discuss initiating interinstitutional negotiations on the legislative proposal for EAFRD-supported rural development programs under the post-2013 CAP reforms.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.8888888888888888,
        "choice": 8,
        "stance": "EPP strongly accepts the integration of greening requirements into direct payments under Pillar One, ensuring environmental accountability while maintaining agricultural productivity. This aligns perfectly with EPP's longstanding commitment to harmonizing sustainability with competitive farming practices.  \nEPP approves the issue’s emphasis on administrative simplification by advocating equivalence between agri-environment programs and greening measures, thereby avoiding penalization of proactive farmers already exceeding baseline environmental standards.  \nEPP strongly endorses the gradual alignment of direct payments across member states, proposing an amendment to ensure Baltic states reach 75% of the EU average payment by 2019 as a targeted enhancement opportunity for equitable rural development.  \nEPP applauds the flexibility to transfer funds between Pillar One and Pillar Two, effectively advancing EPP’s priority of empowering regions to tailor rural development strategies to local agricultural needs.  \nEPP emphasizes the necessity of maintaining planting rights for vineyards and dairy quotas until market-stabilizing alternatives are operational, safeguarding specialized sectors critical to rural economies."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.3103448275862069,
        "choice": 3,
        "stance": "GREEN_EFA slightly agrees the financial framework alignment but demands binding greening measures, including mandatory crop rotation and 7% ecological focus areas without chemical use, as the issue's provisional envelope fails to enforce environmental safeguards.  \nGREEN_EFA requests revisions to cap direct payments at €100,000 per farm to ensure fair distribution, opposing the current proposal's €300,000 threshold that benefits large agribusinesses over small-scale farmers.  \nGREEN_EFA completely againsts with the issue's silence on eliminating export subsidies, which perpetuates market distortions harmful to developing countries' agricultural sectors.  \nGREEN_EFA rejects the inclusion of commodity speculation mechanisms like crop insurance in rural development funding, advocating instead for redirected resources to short supply chains and organic farming transitions.  \nGREEN_EFA highlights the proposal's failure to mandate impact assessments on global food systems, inconsistent with their principle of policy coherence for development."
      },
      {
        "party_name": "SD",
        "score": 0.8148148148148148,
        "choice": 8,
        "stance": "SD strongly sanctions the mandatory 30% allocation for greening measures in Pillar 1, aligning with SD's commitment to environmental sustainability in agricultural policy.  \nSD applauds the historic approval of payment capping at 300,000€ while proposing to strengthen redistributive effects through enhanced degressivity for holdings above 100,000€.  \nSD endorses the 25% rural development budget reservation for organic farming and agro-environmental measures, effectively advancing climate resilience priorities.  \nSD emphasizes the critical need for mandatory public transparency of CAP beneficiaries through annual disclosures, proposing an amendment to Article 12 on accountability mechanisms.  \nSD fully backs youth incentives and local supply chain support provisions as essential tools for generational renewal in rural areas, matching SD's 2024 Rural Revitalization Agenda."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.14705882352941177,
        "choice": 1,
        "stance": "GUE_NGL rejects the mandate for interinstitutional negotiations due to the proposal's failure to cap direct payments at a level ensuring equitable redistribution to small-scale and sustainable agricultural practices.  \nGUE_NGL opposes fundamentally the absence of binding mechanisms to prioritize public investment in agroecological transitions, contradicting their demand for environmental and social conditionality in funding allocation.  \nGUE_NGL highlights the issue’s inconsistency with food sovereignty principles, as it neglects mandatory price guarantees and production regulation to counter market speculation.  \nGUE_NGL condemns the financial framework’s perpetuation of aid concentration among large agribusinesses, which directly conflicts with their stance to limit payments to €100\\xa0000 and reallocate resources to vulnerable farmers.  \nGUE_NGL underscores the proposal’s disregard for quota systems and preferential national regimes, critical to protecting small producers from deregulated trade policies."
      }
    ],
    "resolution": "The European Parliament raised concerns regarding the provisional nature of the financial envelope outlined in the legislative proposal, emphasizing that its final amount cannot be definitively determined until an agreement is reached on the multiannual financial framework (MFF) regulation for the years 2014-2020. The resolution underscored that the proposed financial allocation serves merely as an indicative reference for the legislative authority and stressed the necessity of aligning it with the broader budgetary framework to ensure coherence and feasibility in funding agricultural and rural development policies during the specified period.",
    "total_score": 0.7393617021276596,
    "total_choice": 7,
    "party_num": 4,
    "id": 10,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.1,
      0.2,
      0.6,
      0.1
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "agriculture",
    "title": "Direct payments to farmers: REPORT on the proposal for a regulation of the European Parliament and of the Council amending Council Regulation (EC) No 73/2009 as regards the application of direct payments to farmers in respect of the year 2013",
    "background": "The 2013 transition between the 2007-2013 and 2014-2020 EU budget frameworks necessitated adjustments to direct payments under the Common Agricultural Policy, particularly for new Member States phasing into the system. The Parliament will discuss amending existing regulations to ensure continuity of farmer support during the policy reform interim period.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9074074074074074,
        "choice": 9,
        "stance": "EPP entirely endorses the issue's alignment with Treaty principles under Article 43(2) TFEU, perfectly reflecting its commitment to legally grounded agricultural policy frameworks.  \nEPP perfectly aligns with the call for maintaining uninterrupted direct payment structures in 2013, recognizing this as essential transitional stability for newer Member States like Bulgaria and Romania.  \nEPP proposes strengthening future CAP reforms to accelerate payment equalization, framing this as a natural extension of the issue's fairness principles rather than a modification.  \nEPP entirely endorses the institutional collaboration mechanism outlined, seeing this as vital for upholding the EU's decision-making integrity across agricultural and budgetary domains.  \nEPP perfectly supports the issue's rejection of net payment ceilings for newer Member States, viewing this as foundational to achieving competitive parity across all farming sectors."
      },
      {
        "party_name": "ALDE",
        "score": 0.9397590361445783,
        "choice": 9,
        "stance": "ALDE absolutely upholds the issue's retention of payment continuity mechanisms, perfectly aligning with their commitment to stable agricultural policy frameworks during transitional periods.  \nALDE applauds the inclusion of voluntary modulation flexibility, effectively advancing their priority of empowering national governments to address rural development funding gaps.  \nALDE perfectly aligns with the issue’s emphasis on inter-institutional collaboration, reflecting their longstanding advocacy for cooperative EU decision-making processes.  \nALDE absolutely upholds the procedural clarity in implementing 2013 direct payments, ensuring compliance with Treaty obligations while safeguarding farmer interests.  \nALDE commends the issue’s responsiveness to national parliamentary concerns, demonstrating alignment with their principle of subsidiarity in agricultural fund management."
      },
      {
        "party_name": "SD",
        "score": 0.9109947643979057,
        "choice": 9,
        "stance": "SD fully approves the transitional provisions enabling new Member States to maintain complementary national support in 2013, perfectly aligning with SD's commitment to equitable agricultural development across EU regions.  \nSD perfectly aligns with the rapporteur's compromise ensuring uninterrupted direct payment continuity through 2013, safeguarding farmer stability during CAP reform negotiations as mandated by SD priorities.  \nSD fully approves the harmonization of direct payment frameworks to prevent disadvantages for new Member States transitioning from SAPS to SPS systems, reflecting SD's core principle of fair treatment in agricultural policy.  \nSD perfectly supports the issue's foundational role in advancing single-market parity for farmers, aligning with SD's unyielding stance against unjustified payment disparities between Member States.  \nSD fully approves the accelerated legislative timeline for 2013 implementation, exemplifying SD's institutional collaboration priorities while maintaining agricultural subsidy predictability."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.5588235294117647,
        "choice": 5,
        "stance": "GUE_NGL supports the issue’s transitional approach to direct payments but proposes amending Article 3 to specify minimum payments at 80% of the EU average, addressing systemic inequities for Baltic farmers.  \nGUE_NGL advises replacing surface area-based aid calculations with labor-centric models in Annex II to prioritize small farms and ecological practices over industrial agriculture.  \nGUE_NGL highlights concerns about rural depopulation linked to current payment disparities, urging supplemental clauses to restrict speculative land acquisitions by non-resident entities.  \nGUE_NGL calls for integrating regional price-setting mechanisms into CAP reforms to stabilize agricultural incomes and reflect production cost variations across member states.  \nGUE_NGL stresses the need to expand CAP budget allocations for social justice, ensuring direct payments actively combat poverty migration from rural areas."
      }
    ],
    "resolution": "The European Parliament raised its position at first reading on the Commission’s 2011 proposal (COM(2011)0630) concerning agricultural and rural development policy, aligning with the Committee on Agriculture and Rural Development’s report and the Committee on Budgets’ opinion. It emphasized adherence to Treaty provisions (Article 43(2) TFEU) for shaping common agricultural policy measures and urged the Commission to resubmit the proposal if substantial amendments or replacements were planned. The resolution also directed the Parliament’s President to formally communicate its stance to the Council, Commission, and national parliaments, reflecting institutional collaboration while prioritizing legislative clarity and procedural accountability.",
    "total_score": 0.8620689655172413,
    "total_choice": 8,
    "party_num": 4,
    "id": 11,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.1,
      0.1,
      0.3,
      0.5
    ],
    "veto_party_name": "GUE_NGL"
  },
  {
    "topic": "agriculture",
    "title": "Motions for resolutions - Crisis in the dairy farming sector: JOINT MOTION FOR A RESOLUTION on the crisis in the dairy farming sector",
    "background": "A sharp decline in EU dairy prices, falling below production costs, and reduced global demand amid economic downturn strained farmer viability, compounded by increased international supply and domestic market imbalances. The Parliament will discuss measures to address the dairy sector crisis, focusing on market stabilization and sustainable sectoral support.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.7709923664122137,
        "choice": 7,
        "stance": "EPP strongly agrees the immediate creation of the €600 million EU Dairy Fund, aligning perfectly with their longstanding commitment to farm modernization and intergenerational renewal in rural communities.  \nEPP approves the issue's focus on price transparency mechanisms, particularly endorsing mandatory origin labeling and market abuse investigations to bridge the producer-consumer price gap.  \nEPP proposes enhancing butter fat utilization in industrial food processing as a targeted demand stimulus, building upon the issue's school milk program expansion.  \nEPP emphasizes maintaining production capacity through crisis-era intervention tools, strongly agreeing extended butter/SMP storage periods and export refund reactivation as market stabilizers.  \nEPP endorses early retirement schemes and youth farmer support through the Dairy Fund, recognizing these measures as vital for structural adaptation without opposing quota policy adjustments."
      },
      {
        "party_name": "EFD",
        "score": 0.2903225806451613,
        "choice": 2,
        "stance": "EFD rejects the issue's extension of butter and skimmed milk powder intervention periods as absolutely conflicting with EFD's opposition to structural market interventions that recreate pre-quota conditions.  \nEFD opposes the proposal's failure to address exploitative supermarket profit margins, which directly contradict free market fairness principles central to EFD's platform.  \nEFD condemns the issue's implicit support for super levy systems as punitive measures against efficient producers, inconsistent with claimed EU modernization goals.  \nEFD demands mandatory origin labeling requirements beyond current provisions, arguing the issue's traceability measures insufficiently meet consumer transparency demands.  \nEFD rejects the market stabilization framework for overlooking critical aspects like private cheese storage aid, which would better balance benefits across Member States."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.18181818181818182,
        "choice": 1,
        "stance": "GREEN_EFA rejects the issue's reliance on export refunds as fundamentally incompatible with their demand to cease policies that destabilize global agricultural markets.  \nGREEN_EFA opposes the failure to mandate immediate 5% milk quota reductions, a measure they deem critical to protect small producers from market oversaturation.  \nThe proposal fully rejects with GREEN_EFA's insistence on legally binding minimum prices to cover production costs, instead prioritizing industry-led price monitoring systems.  \nGREEN_EFA condemns the issue's silence on dismantling distribution oligopolies, a structural imbalance repeatedly denounced in parliamentary debates.  \nThe omission of mental health safeguards for farmers facing bankruptcy directly contradicts GREEN_EFA's emphasis on the human toll of the crisis."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.7058823529411765,
        "choice": 7,
        "stance": "GUE_NGL strongly agrees the issue's establishment of an EU Dairy Fund, aligning with their demand for extraordinary sectoral support to protect rural employment and small producers.  \nGUE_NGL applauds the call for price transparency investigations as critical to exposing market abuses that depress farmer incomes while consumer prices rise, directly addressing Kohlíček's cost-price disparity concerns.  \nGUE_NGL proposes amending Clause 4 to include binding minimum intra-EU milk purchase prices, enhancing Le Hyaric's structural solution while maintaining the issue's supply-demand balance goals.  \nGUE_NGL emphasizes the need to maintain milk quotas until 2015 as urged by Figueiredo, suggesting modifying deregulation timelines to prevent premature market destabilization.  \nThis aligns perfectly with GUE_NGL's commitment to combat agricultural liberalization, particularly through expanded export refunds and labeling rules that protect EU producers from third-country competition."
      }
    ],
    "resolution": "The European Parliament raised concerns over the severe crisis in the EU dairy market, where milk prices fell below 21 cents per liter, threatening farmers' viability as many sold below production costs, exacerbated by declining global demand and increased supply from third countries like New Zealand and the US. It criticized the Commission for inadequate crisis prediction and response, urging immediate stabilization measures, including an EU Dairy Fund of €600 million to support producers, cooperatives, farm modernization, and youth farmers, as previously requested in the 2009 budget. The resolution called for enhancing product value through high-quality dairy production, expanding initiatives like the school milk program to stimulate demand, balancing supply and demand via intervention mechanisms, and exploring early retirement schemes for farmers. It emphasized price transparency, noting consumer prices for milk and cheese rose 14% (2006-2009) while producer prices dropped 40% in some states, and demanded investigations into market abuses. Additional measures included extending butter and skimmed milk powder intervention periods until February 2010, increasing intervention prices, expanding cheese exports with refunds to third countries like the USA, and improving labeling to ensure dairy products are accurately identified. The Parliament also urged the Commission to maintain dairy sector funding post-export refund phase-out, introduce price monitoring systems, and deliver delayed reports on food price transparency and market abuses, while condemning the Council’s failure to act at its September 2009 meeting.",
    "total_score": 0.6277173913043478,
    "total_choice": 6,
    "party_num": 4,
    "id": 12,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.2,
      0.1,
      0.5,
      0.2
    ],
    "veto_party_name": "EFD"
  },
  {
    "topic": "agriculture",
    "title": "Motions for resolutions - FAO World Summit on Food Security - Eradicating hunger from the face of the earth: JOINT MOTION FOR A RESOLUTION on the FAO Summit and food security",
    "background": "Persistent global hunger exceeding one billion people, exacerbated by climate change impacts and food price volatility, prompted international responses including the 2009 FAO World Summit and G8 L'Aquila commitments on agricultural aid. The Parliament will discuss strategies to enhance global food security and eradicate hunger through agricultural development and international cooperation.",
    "stances": [
      {
        "party_name": "EFD",
        "score": 0.5483870967741935,
        "choice": 5,
        "stance": "EFD supports the issue’s emphasis on smallholder farmers and agroecological practices, aligning with their advocacy for localized agricultural solutions over export-driven models.  \nEFD advises amending Clause 6 to explicitly phase out biofuel subsidies linked to food price volatility, citing unresolved tensions between energy policies and hunger eradication.  \nEFD expresses concern over the omission of safeguards against third-country land acquisitions in vulnerable regions, urging binding provisions to prioritize local food sovereignty.  \nEFD endorses the call for CAP reforms to prioritize climate resilience but proposes stricter timelines for decoupling EU subsidies from overproduction that undermines global markets.  \nEFD highlights the need for accountability mechanisms in Paragraph 12, advocating for annual audits of aid effectiveness to address systemic failures in past declarations."
      },
      {
        "party_name": "ALDE",
        "score": 0.7142857142857143,
        "choice": 7,
        "stance": "ALDE strongly upholds the issue’s alignment of CAP reforms with global food security objectives, particularly its emphasis on climate-resilient agriculture and fair trade, reflecting ALDE’s prioritization of market-integrated sustainability.  \nALDE approves the urgent call for increased agricultural investment in developing nations, reinforcing Mr. Michel’s demand for transparent funding mechanisms to operationalize the FAO’s USD 44 billion annual target.  \nALDE endorses the issue’s focus on open markets and legal system stabilization, echoing Mr. Lyon’s argument that political and institutional frameworks are prerequisites for agricultural development.  \nALDE proposes enhancing the technology transfer provisions to explicitly include digital farming tools and precision agriculture, ensuring alignment with modern productivity-enhancing innovations.  \nALDE applauds the issue’s agroecological emphasis but urges adding metrics to track progress on reducing export dependency, addressing structural imbalances highlighted in FAO/OECD projections."
      },
      {
        "party_name": "SD",
        "score": 0.8279569892473119,
        "choice": 8,
        "stance": "SD strongly accepts the issue's alignment of CAP reforms with global food security goals, emphasizing urgent prioritization of smallholder support and climate resilience as central to SD's commitment to eradicating structural hunger.  \nSD strongly endorses increased agricultural investment and technology transfer, urging immediate EU action to redirect resources toward sustainable agroecology in line with SD's equity principles.  \nSD strongly approves the issue's focus on FAO/OECD market projections, advocating enhanced multilateral coordination to combat speculative practices and land-grabbing by agro-industrial corporations.  \nSD proposes explicitly integrating water management systems and protections against land tenure exploitation into the issue's agroecological frameworks to address critical structural vulnerabilities.  \nSD strongly commends the demand for rapid-response facility implementation, condemning G8 leadership gaps as barriers to achieving SD's humanitarian objectives through effective aid governance."
      },
      {
        "party_name": "ECR",
        "score": 0.6666666666666666,
        "choice": 6,
        "stance": "ECR supports the issue’s emphasis on sustainable agricultural development and CAP reforms to address global food security, aligning with their focus on structural solutions to hunger.  \nECR advises strengthening governance conditionality in agricultural aid, emphasizing political stability assessments for recipient countries to prevent misuse, as demonstrated by Zimbabwe’s collapse from breadbasket to food importer.  \nECR proposes amending the CAP post-reform provisions to include a defined safety net mechanism, protecting EU farmers from market volatility while maintaining contributions to global food accessibility.  \nECR highlights the need for explicit EU budget commitments to agricultural R&D, particularly in climate-resilient technologies, to meet productivity targets without transferring costs to consumers.  \nECR underscores the importance of linking technology transfer initiatives to governance accountability frameworks in vulnerable regions, ensuring alignment with the issue’s agroecological goals."
      }
    ],
    "resolution": "The European Parliament raised concerns over global food security and rising food prices, emphasizing the need for urgent action in developing countries and alignment of EU policies with sustainable agricultural development. It referenced previous resolutions on food price crises (2007, 2008) and African agricultural development (2007), supported the establishment of a rapid-response facility (COM(2008)0450) to address food emergencies, and endorsed the McGuinness report’s recommendations to align the Common Agricultural Policy (CAP) with global food security goals. The resolution highlighted FAO/OECD projections (2008-2017) warning of structural food market imbalances and stressed the IAASTD’s call for agroecological practices, smallholder support, and reduced reliance on export-driven models. It urged post-‘Health Check’ CAP reforms to prioritize food accessibility, climate resilience, and fair trade, while adhering to the Paris Declaration’s aid effectiveness principles. The Parliament also reaffirmed commitments from the 2009 World Summit on Food Security, advocating for increased investment in agriculture, technology transfer, and policies to mitigate speculation in food markets, particularly in vulnerable regions.",
    "total_score": 0.7350543478260869,
    "total_choice": 7,
    "party_num": 4,
    "id": 13,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.1,
      0.2,
      0.5,
      0.2
    ],
    "veto_party_name": "ALDE"
  },
  {
    "topic": "agriculture",
    "title": "Honeybee health and beekeeping: REPORT on honeybee health and the challenges of the beekeeping sector",
    "background": "Declining honeybee populations in the EU, attributed to pests, diseases, pesticide exposure, habitat loss, and climate pressures, threatened agricultural pollination and biodiversity. Existing EU policies addressed apiculture support, pesticide regulation, and biodiversity goals. The Parliament will discuss safeguarding honeybee health, sustainable beekeeping practices, and mitigating risks to ecosystems and food security.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.03636363636363636,
        "choice": 0,
        "stance": "GREEN_EFA rejects the issue's reliance on pharmaceutical industry solutions as fundamentally incompatible with their ecological transition principles, citing the report's encouragement of veterinary product innovation as perpetuating chemical dependency.  \nGREEN_EFA opposes the proposed pesticide risk assessment framework for failing to mandate an immediate EU-wide ban on neonicotinoids, contrary to their precautionary principle advocacy demonstrated in Amendment 327.  \nGREEN_EFA condemns the issue's inadequate critique of industrial monoculture farming, arguing that promoting \"bee-friendly habitats\" without binding crop rotation mandates (Article 14) ignores systemic agricultural reform needs.  \nGREEN_EFA highlights the issue's failure to prohibit genetically modified crops linked to pollinator decline, a direct contradiction to their 2023 policy manifesto demanding a full moratorium on GM cultivation.  \nGREEN_EFA fundamentally disputes the effectiveness of harmonized hive monitoring systems (Section 5.2) as a substitute for reducing pesticide loads in soils, which their research identifies as the primary driver of colony collapse."
      },
      {
        "party_name": "SD",
        "score": 0.8342245989304813,
        "choice": 8,
        "stance": "SD strongly endorses the issue’s emphasis on increased EU funding for bee health research, aligning perfectly with their commitment to biodiversity and sustainable agricultural innovation.  \nSD approves the strict pesticide regulations and precautionary ban on neonicotinoids, which advance their priority of eliminating chemical threats to pollinators and ecosystems.  \nSD endorses the financial aid and training programs for non-professional beekeepers, recognizing their critical role in maintaining 67% of EU hives and ensuring food security.  \nSD applauds the biodiversity measures promoting bee-friendly habitats and GMO restrictions, consistent with their advocacy for nature-based agricultural systems.  \nSD proposes expanding research mandates to require GMO manufacturers’ participation in bee health impact studies, strengthening the issue’s comprehensive approach to identifying colony collapse causes."
      },
      {
        "party_name": "ECR",
        "score": 0.8888888888888888,
        "choice": 8,
        "stance": "ECR strongly advocates the issue's focus on combating Varroa destructor through enhanced EU research funding, aligning with their commitment to practical agricultural solutions.  \nECR approves the call for stricter pesticide risk assessments and non-chemical pest management, emphasizing science-based policy to protect pollinators.  \nECR advocates maintaining CAP reforms to support non-professional beekeepers managing 67% of hives, a critical demographic for sector resilience.  \nECR proposes revising honey labeling requirements to avoid redundant warnings like pollen disclosure, urging legislators to streamline regulations without opposing transparency goals.  \nECR highlights the need to prioritize habitat conservation and GMO crop restrictions in biodiversity measures, reflecting their market-focused environmental stewardship."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.058823529411764705,
        "choice": 0,
        "stance": "GUE/NGL rejects the issue as insufficiently transformative, absolutely challengeing with their demand for systemic agricultural overhaul beyond pesticide restrictions.  \nGUE/NGL opposes the issue’s failure to mandate a full ban on neonicotinoids and genetically modified crops, which they deem inseparable from industrial farming’s ecological harm.  \nGUE/NGL criticizes the issue’s reliance on CAP reforms as inadequate, arguing it perpetuates intensive monoculture models instead of prioritizing agroecological transitions.  \nGUE/NGL condemns the issue’s tolerance of industry-influenced risk assessments, overlooking critical aspects like cumulative pesticide effects and corporate control of bee health research.  \nGUE/NGL disputes the issue’s narrow focus on hive registration, urging instead a ban on all agrochemicals linked to pollinator decline and binding targets for biodiversity restoration."
      }
    ],
    "resolution": "The European Parliament raised significant concerns about the decline in honeybee populations and its profound implications for agriculture, biodiversity, and food security, citing factors such as pests like *Varroa destructor* (responsible for ~10% of annual losses), pesticide exposure, habitat loss, climate change, and insufficient research into bee health. It urged increased EU funding for research under FP8 to address bee immunity, disease control (notably varroasis), sustainable agricultural practices, and non-chemical pest management, while emphasizing harmonized surveillance systems, standardized hive registration, and a pan-European \"reference hive\" network to monitor environmental impacts. The resolution called for stricter pesticide regulations, including risk assessments for chronic and sub-lethal toxicity, a precautionary ban on neonicotinoids pending safety proof, and adherence to Directive 2009/128/EC on sustainable pesticide use, mandating integrated pest management by 2014. It advocated for veterinary product reforms, including flexible authorization of bee-safe medicines, residue limits (e.g., a 10 ppb threshold for unauthorized substances), and incentives for pharmaceutical innovation. The Parliament stressed support for beekeepers via CAP reforms, financial aid, training, and insurance schemes, noting that 97% of EU beekeepers are non-professional yet manage 67% of hives. It highlighted the need for biodiversity conservation through \"bee-friendly\" habitats, restrictions on GMO crops and imports of live bees to prevent disease spread, and improved honey labeling (origin, quality parameters) to combat adulteration. The resolution also demanded stricter enforcement of EU standards for imported honey and apiculture products to ensure market fairness, alongside promoting EU honey consumption and PDO/PGI schemes to enhance sector viability.",
    "total_score": 0.7255434782608695,
    "total_choice": 7,
    "party_num": 4,
    "id": 14,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.5,
      0.3,
      0.1,
      0.1
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "agriculture",
    "title": "Motions for resolutions - Welfare of laying hens: JOINT MOTION FOR A RESOLUTION on the EU laying hens industry: the ban on the use of battery cages from 2012",
    "background": "In 1999, the EU adopted Directive 1999/74/EC banning battery cages for laying hens by 2012, allowing transitional adaptation. Market instability, rising feed costs, and uneven compliance progress among member states created sectoral challenges. The Parliament will discuss enforcing the directive’s implementation and addressing competitive impacts within the EU egg industry.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.5916030534351145,
        "choice": 5,
        "stance": "EPP supports the issue’s enforcement of the battery cage ban and strict market controls to protect compliant producers but advises allowing a transition period for farms actively modernizing their facilities by January 2012.  \nEPP advocates for enhanced EU funding and financial assistance programs to alleviate the economic burden on producers adapting to enriched cage systems, particularly in Member States facing severe economic crises.  \nEPP emphasizes the necessity of imposing equivalent animal welfare standards on imported eggs to prevent market distortion and protect European producers from unfair third-country competition.  \nEPP advises implementing clear labeling requirements for processed egg products to ensure transparency and consumer awareness, addressing potential loopholes in the current issue.  \nEPP supports consumer awareness campaigns to highlight the benefits of animal-friendly eggs but cautions against price hikes that could disproportionately affect lower-income households during the transition."
      },
      {
        "party_name": "EFD",
        "score": 0.5161290322580645,
        "choice": 5,
        "stance": "EFD supports market fairness principles but advises temporary conditional derogations for non-compliant producers to prevent supply chain collapse.  \nEFD endorses import restrictions but urges mandatory farm-level egg stamping systems to enable traceability of production methods.  \nEFD concurs with consumer awareness goals but highlights required EU funding for compliant states to audit third-country welfare standards.  \nEFD agrees with producer accountability measures but proposes redirecting regional development funds to upgrade cage systems rather than penalties.  \nEFD advises creating emergency logistics frameworks for surplus egg disposal to mitigate price shocks while maintaining welfare timelines.  "
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.7818181818181819,
        "choice": 7,
        "stance": "GREEN_EFA strongly endorses the issue’s uncompromising 2012 deadline enforcement, aligning perfectly with their decades-long advocacy for eliminating inhumane battery cage systems.  \nGREEN_EFA approves the strict market exclusion of non-compliant eggs as essential to protect ethical producers and uphold the EU’s global leadership in animal welfare standards.  \nGREEN_EFA demands immediate infringement proceedings against non-compliant Member States, proposing this as a critical amendment to Article 4 to ensure uniform application of EU law.  \nGREEN_EFA endorses the public listing of violators by December 2011, recognizing this transparency measure as vital for consumer trust and sector accountability.  \nGREEN_EFA highlights the necessity of expanding consumer awareness campaigns to mandate clear origin labeling for liquid egg ingredients in processed foods, closing regulatory loopholes."
      },
      {
        "party_name": "ALDE",
        "score": 0.7619047619047619,
        "choice": 7,
        "stance": "ALDE strongly upholds the issue’s insistence on strict enforcement of the battery cage ban, aligning perfectly with ALDE’s longstanding commitment to regulatory compliance and market fairness for producers who invested in enriched systems.  \nALDE approves the demand for a public list of non-compliant producers by December 2011, proposing that the Commission expedite preliminary naming by September 2011 to enhance market clarity and consumer trust.  \nALDE strongly upholds prohibiting non-compliant EU and third-country eggs from internal markets, effectively advancing ALDE’s priority of protecting ethical producers from unfair competition and price distortions.  \nALDE endorses enhanced Food and Veterinary Office inspections as critical to ensuring uniform application of EU animal welfare standards, rejecting fragmented implementation that undermines single market principles.  \nALDE advocates for immediate sanctions against non-compliant states to prevent economic disadvantages for compliant farmers, in line with the issue’s call for dissuasive measures to uphold a level playing field."
      }
    ],
    "resolution": "The European Parliament raised concerns over the impending 1 January 2012 ban on unenriched battery cages for laying hens under Directive 1999/74/EC, noting insufficient progress by many Member States and producers despite transition periods of 12 years for EU-15, eight years for EU-10, and five years for EU-2. It stressed that postponing the ban or allowing exemptions would undermine animal welfare, distort markets, and disadvantage compliant producers who invested in enriched cages or alternative systems. The resolution urged the Commission to clarify compliance statuses by March 2011, enforce strict monitoring, and prevent unfair competition by banning non-compliant EU and third-country eggs from internal markets. It highlighted risks of egg shortages, price hikes, and increased imports from countries with lower welfare standards, calling for consumer awareness campaigns, dissuasive sanctions for non-compliant producers, and enhanced Food and Veterinary Office inspections. The Parliament also demanded a public list by December 2011 of non-compliant producers, processors, and retailers, while rejecting trade measures that penalize compliant Member States.",
    "total_score": 0.623641304347826,
    "total_choice": 6,
    "party_num": 4,
    "id": 15,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.1,
      0.2,
      0.6,
      0.1
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "agriculture",
    "title": "Organic production and labelling of organic products: REPORT on the proposal for a regulation of the European Parliament and of the Council amending Council Regulation (EC) No 834/2007 on organic production and labelling of organic products",
    "background": "The Lisbon Treaty’s procedural reforms replacing comitology with delegated and implementing acts required alignment of existing EU legislation, including agricultural regulations. The European Commission proposed amendments to Council Regulation (EC) No 834/2007 to comply with post-Lisbon institutional frameworks. The Parliament will discuss institutional alignment of organic production and labelling rules under Treaty provisions.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9074074074074074,
        "choice": 9,
        "stance": "EPP entirely accepts the issue's codification of Parliament's colegislative authority under the Lisbon Treaty, perfectly aligning with its commitment to democratic agricultural policymaking.  \nEPP perfectly aligns with the prioritization of delegated acts for technical adjustments in organic regulations, ensuring legislative agility while maintaining parliamentary oversight as required by Article 290 TFEU.  \nEPP entirely accepts the rejection of Council inflexibility on substance authorization procedures, affirming Parliament's right to define critical implementation frameworks through basic acts.  \nEPP strongly upholds the issue's institutional transparency mechanisms, including mandatory communication to national parliaments, which advances accountability in CAP alignment processes.  \nEPP entirely accepts leveraging first-reading positions to reinforce Parliament's negotiating mandate, reflecting strategic adherence to codecision principles in upcoming CAP reforms."
      },
      {
        "party_name": "EFD",
        "score": 0.5161290322580645,
        "choice": 5,
        "stance": "EFD supports the simplification of reporting requirements in rural development programmes but advises further reducing administrative burdens through streamlined approval processes.  \nEFD expresses concern that increased Commission authority under implementing acts risks excessive centralization, contradicting subsidiarity principles.  \nEFD advises reallocating a portion of organic farming subsidies to support traditional farmers facing market pressures, as seen in current wheat price challenges.  \nEFD supports maintaining support for producer associations in the fruit and vegetable sector to ensure fair market access for smaller agricultural stakeholders.  \nEFD suggests reviewing the cost-effectiveness of organic production subsidies to prioritize consumer affordability alongside environmental goals.  "
      },
      {
        "party_name": "SD",
        "score": 0.9214659685863874,
        "choice": 9,
        "stance": "SD totally sanctions the issue's strict adherence to Treaty of Lisbon provisions, ensuring delegated acts maintain Parliament's legislative authority as a cornerstone of democratic agricultural policy.  \nSD perfectly aligns with the mandate requiring Commission re-engagement with Parliament on substantive amendments, preventing legal vulnerabilities while protecting organic farmers' access to CAP benefits.  \nSD strongly endorses the issue's rejection of Council attempts to dilute parliamentary oversight through implementing acts, viewing this as critical to upholding Lisbon Treaty reforms in agricultural governance.  \nSD applauds the institutional transparency measures requiring communication to national parliaments, which align perfectly with SD's commitment to multilevel democratic accountability in organic certification processes.  \nSD endorses the integration of Committee on Agriculture and EESC stakeholder inputs as essential for maintaining legally sound and socially responsive organic production standards across Member States."
      },
      {
        "party_name": "ECR",
        "score": 0.43636363636363634,
        "choice": 4,
        "stance": "ECR partially endorses the delegated acts framework but demands stricter parliamentary oversight mechanisms in Article 5 to address Commission-Parliament procedural gaps.  \nECR highlights the unresolved coordination with CAP reform timelines as inconsistent with their agricultural policy coherence priorities, urging amendment of Section 7(a).  \nECR requests revision of Annex II compliance procedures to include mandatory consultation windows, preventing regulatory haste while maintaining Lisbon Treaty alignment.  \nECR identifies insufficient democratic accountability in seed certification protocols (Resolution Clause 12), proposing farmer-representative review panels to limit bureaucratic discretion.  \nECR warns that current transparency safeguards fail to prevent administrative overreach in labeling enforcement, requiring binding impact assessments under Committee on Agriculture supervision."
      }
    ],
    "resolution": "The European Parliament raised its position on a legislative proposal concerning agriculture and rural development, adopting its first reading stance under Article 294(2) and Articles 42 and 43(2) of the Treaty on the Functioning of the European Union, which formed the legal basis for the Commission’s proposal (COM(2010)0759). The resolution emphasized the need for the Commission to re-engage Parliament if substantial amendments or alternative texts to the proposal are introduced, ensuring legislative transparency and procedural adherence. It further instructed the Parliament’s President to formally communicate its adopted position to the Council, the Commission, and national parliaments, reflecting institutional cooperation. The Committee on Agriculture and Rural Development’s report (A7-0215/2011) and the European Economic and Social Committee’s opinion of 4 May 2011 informed the decision, underscoring stakeholder input in shaping the legislative process.",
    "total_score": 0.8342175066312998,
    "total_choice": 8,
    "party_num": 4,
    "id": 16,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.1,
      0.4,
      0.4,
      0.1
    ],
    "veto_party_name": "EFD"
  },
  {
    "topic": "agriculture",
    "title": "Protection of animals during transport: REPORT on the protection of animals during transport",
    "background": "Following the 2011 Commission report on Regulation (EC) No 1/2005, which identified persistent animal welfare issues during transport despite improved vehicle standards, and considering EFSA scientific opinions and a public petition advocating reduced transport times, the Parliament will discuss enhancing compliance and updating EU animal transport welfare regulations.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.7851851851851852,
        "choice": 7,
        "stance": "EPP strongly accepts the eight-hour transport limit for slaughter-bound animals, aligning with EPP's longstanding commitment to science-based welfare standards while recognizing economic benefits of reduced CO2 emissions and local abattoir development.  \nEPP emphasizes enhanced enforcement harmonization through mandatory satellite tracking systems and EU-wide penalty frameworks to address compliance gaps identified in current Regulation (EC) No 1/2005 implementation.  \nEPP approves shifting focus to meat/carcass transportation over live animals, urging CAP support for regional slaughterhouse networks to reduce journey durations and preserve rural employment.  \nEPP proposes maintaining exemptions for ultra-peripheral regions under Article 13(1) to prevent disproportionate economic harm while requiring scientific validation of species-specific adaptations.  \nEPP endorses stricter vehicle condition protocols and driver certification requirements, particularly for poultry and equine transport, to operationalize EFSA’s latest welfare guidelines."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.8448275862068966,
        "choice": 8,
        "stance": "GREEN_EFA strongly agrees the issue’s emphasis on harmonized penalties and satellite monitoring systems, aligning perfectly with their longstanding commitment to rigorous enforcement of animal welfare standards during transport.  \n\nGREEN_EFA proposes amending the issue’s ambiguous phrasing on journey times to explicitly demand an 8-hour limit for slaughter-bound animals, replacing conditional language with a direct legislative mandate to the Commission.  \n\nGREEN_EFA applauds the focus on promoting local slaughterhouses as critical infrastructure, effectively advancing their priority of reducing transport distances and associated stress on livestock.  \n\nGREEN_EFA underscores the ethical imperative of the 8-hour limit, arguing that political resolve must supersede debates over scientific thresholds to decisively address preventable animal suffering.  \n\nGREEN_EFA highlights the unprecedented public mandate for transport reform, urging Parliament to honor 1.1 million citizen signatures by adopting a clear, enforceable 8-hour rule without dilution."
      },
      {
        "party_name": "ALDE",
        "score": 0.7590361445783133,
        "choice": 7,
        "stance": "ALDE strongly advocates the issue's emphasis on harmonized enforcement and satellite monitoring, aligning perfectly with their commitment to evidence-based EU policy frameworks.  \nALDE proposes modifying Article 14(5) to clarify exemptions for remote regions while maintaining scientific rigor in journey time assessments.  \nALDE endorses the call for species-specific rules informed by EFSA findings, particularly welcoming enhanced protections for poultry and horses as outlined in Section 9.  \nALDE urges strengthening cross-border inspection protocols through shared training programs for transport officials, enhancing current enforcement mechanisms.  \nALDE approves the economic shift toward regional meat processing but recommends parallel reforms to EU hygiene regulations to enable viable local slaughterhouse networks."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.35294117647058826,
        "choice": 3,
        "stance": "GUE_NGL slightly sanctions the issue's 8-hour transport limit but demands removal of exceptions for remote regions to prevent systemic abuse.  \nGUE_NGL requests revisions to mandate binding contracts with scientific welfare criteria (temperature, density, duration) as non-negotiable transport conditions.  \nThis absolutely challenges with GUE_NGL's stance against commodifying animals, as the issue permits prolonged suffering via species-specific \"needs\" loopholes.  \nThe proposal overlooks critical aspects like compulsory climate-control systems in vehicles, which Alfreds Rubiks deems essential for ethical transport.  \nGUE_NGL rejects the environmental calculus in Article 12 for prioritizing market competition over drastic transport reduction via localized slaughter infrastructure."
      }
    ],
    "resolution": "The European Parliament raised concerns over persistent animal welfare issues during transport despite Regulation (EC) No 1/2005, citing poor compliance and inconsistent enforcement across Member States. It urged the Commission to ensure uniform implementation, improve monitoring via satellite navigation systems with real-time data transmission, and harmonize penalties for violations. Highlighting data from 2005-2009, it noted significant increases in transported cattle (8%), pigs (70%), and sheep (3%), with 4% of consignments exceeding maximum journey times. The resolution called for limiting slaughter-bound animal transport to eight hours, with exceptions for remote regions and species-specific needs backed by scientific evidence, while emphasizing factors like vehicle conditions, space allowances, and handling. It criticized the Commission’s reliance on insufficient data and demanded updates to align rules with EFSA findings, particularly for poultry (the most transported category) and horses, advocating shorter journey limits for the latter. The Parliament stressed the environmental and economic benefits of transporting meat over live animals, urged support for local slaughterhouses, and requested a full evaluation of transport costs, including impacts on prices, competition, and carbon emissions. It also pushed for stricter controls on vehicle standards, driver training, and cross-border cooperation, alongside promoting regional livestock production to reduce transport distances and disease risks.",
    "total_score": 0.7360742705570292,
    "total_choice": 7,
    "party_num": 4,
    "id": 17,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.7,
      0.1,
      0.1,
      0.1
    ],
    "veto_party_name": "GUE_NGL"
  },
  {
    "topic": "agriculture",
    "title": "Protective measures against pests of plants: REPORT on the proposal for a regulation of the European Parliament and of the Council on protective measures against pests of plants",
    "background": "Increasing global trade and plant material imports led to rising pest incursions in the EU, causing agricultural and forestry damage. Existing phytosanitary rules under Council Directive 2000/29/EC were deemed insufficient to address evolving risks. The Parliament will discuss revising plant health regulations to strengthen preventive measures and pest control frameworks.",
    "stances": [
      {
        "party_name": "EFD",
        "score": 0.16129032258064516,
        "choice": 1,
        "stance": "EFD rejects the proposal’s EU-centric framework as a clear breach of subsidiarity, asserting pest management must remain under national competence.  \nEFD opposes blanket prohibitions on hunting practices like live decoys, which serve as vital tools for monitoring wildlife disease spread.  \nEFD highlights the issue’s failure to leverage cost-free surveillance networks, such as hunters’ field expertise in early pest detection.  \nEFD contends the regulation dismisses generational knowledge transfer, undermining proven local strategies for disease prevention.  \nEFD fully challenges with the proposal’s neglect of practical, nature-based monitoring systems that preempt large-scale outbreaks."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.0,
        "choice": 0,
        "stance": "GREEN_EFA rejects the issue's dilution of mandatory government oversight in pest control, firmly condemning with their principle that public health must supersede commercial interests.  \nGREEN_EFA opposes the failure to maintain robust traceability requirements for livestock, as exemplified by the unresolved ear-tagging issues harming animal welfare and farmer viability.  \nGREEN_EFA condemns the weakened enforcement mechanisms as dangerously inconsistent with their demand for independent veterinary authority over all agricultural inspections.  \nGREEN_EFA highlights the proposal's subsidiarity violation through its inadequate EU-level safety nets, directly contradicting their stance that cross-border biosecurity requires centralized rigor.  \nGREEN_EFA warns that reduced penalty provisions for violations betray core food safety priorities, mirroring past failures where lax controls enabled systemic fraud."
      },
      {
        "party_name": "SD",
        "score": 0.8,
        "choice": 8,
        "stance": "SD strongly upholds the regulation's reciprocal phytosanitary measures requiring third countries to conduct pre-export inspections, aligning perfectly with SD's commitment to fair agricultural trade and ecosystem protection.  \nSD endorses the focus on preventive agronomic practices over pesticide dependency, advancing SD's priority for sustainable farming systems as outlined in Articles 4–6.  \nSD applauds the antimicrobial resistance provisions in Annex III, recognizing their critical role in safeguarding interconnected plant-animal-human health networks.  \nSD highlights the need to enhance border surveillance protocols at high-risk zones like the Bulgarian-Turkish frontier through increased funding for rapid response teams.  \nSD proposes amending Article 12 to explicitly require third-country exporters to fund all phytosanitary controls, ensuring parity with EU producer obligations and reducing fiscal burdens on member states."
      },
      {
        "party_name": "ECR",
        "score": 0.8947368421052632,
        "choice": 8,
        "stance": "ECR strongly advocates maintaining Member State flexibility in phytosanitary fee structures, proposing amending Article 343 to replace \"shall levy\" with \"may levy\" to prevent micro-management of national enforcement capacities.  \nECR endorses risk-based plant health protocols that avoid trade-disruptive measures, aligning with their commitment to competitive agricultural markets and simplified EU legislation.  \nECR urges enhanced Commission action against politically motivated trade barriers like Russia's pork embargo, emphasizing strict adherence to science-based phytosanitary standards.  \nECR approves preserving existing cross-border animal movement frameworks between Northern Ireland and Ireland, crucial for uninterrupted agricultural trade under subsidiarity principles.  \nECR emphasizes excluding non-germane provisions like cloning regulations from plant health legislation to maintain focus on core pest control objectives."
      }
    ],
    "resolution": "The European Parliament raised concerns regarding a legislative proposal on agriculture and rural development (COM(2013)0267), adopting its first reading position and urging the Commission to re-engage Parliament if substantial amendments are proposed. It highlighted the Austrian Federal Council’s objection that the proposal violated subsidiarity principles, arguing EU-level action was unnecessary. The resolution integrated input from the Committee on Agriculture and Rural Development and the Committee on the Environment, Public Health and Food Safety, reflecting cross-sectoral priorities. It instructed the Parliament’s President to transmit the adopted position to the EU Council, Commission, and national parliaments, emphasizing procedural adherence and inter-institutional accountability.",
    "total_score": 0.6240208877284595,
    "total_choice": 6,
    "party_num": 4,
    "id": 18,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.2,
      0.5,
      0.1,
      0.2
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "agriculture",
    "title": "Strategy for the protection and welfare of animals: REPORT on the European Union Strategy for the Protection and Welfare of Animals 2012–2015",
    "background": "Prior EU animal welfare efforts included the 2006-2010 Action Plan, species-specific directives, and international conventions, with persistent challenges in harmonizing standards, ensuring compliance, and addressing trade impacts. The Parliament will discuss the 2012-2015 EU Strategy to strengthen legislative coherence, enforcement, and global alignment in animal protection policies.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.8407407407407408,
        "choice": 8,
        "stance": "EPP strongly promotes the issue's enforcement of Article 13 TFEU and slaughter regulations, perfectly aligning with their commitment to recognizing animals as sentient beings.  \nEPP applauds the proposed European Animal Welfare Framework Law as effectively advancing their manifesto goals for comprehensive protection of pets and stray animal management through sterilization programs.  \nEPP firmly sanctions trade reciprocity measures requiring imported products to meet EU standards, safeguarding both animal welfare and agricultural competitiveness.  \nEPP proposes expanding the strategy to include marine wildlife protections such as acoustic devices for Black Sea dolphins while enhancing live transport monitoring systems to ensure humane treatment.  \nEPP urges increased CAP funding allocations to support farmers in meeting welfare requirements, ensuring uniform implementation across all member states."
      },
      {
        "party_name": "ALDE",
        "score": 0.927710843373494,
        "choice": 9,
        "stance": "ALDE firmly upholds the issue’s emphasis on harmonized enforcement through strengthened Food and Veterinary Office resources, perfectly aligning with ALDE’s governance priorities for EU-wide regulatory coherence.  \nALDE perfectly aligns with the 8-hour live transport limit proposal, stressing that rigorous implementation mechanisms are indispensable to uphold Article 13 TFEU obligations across all Member States.  \nALDE fully supports the issue’s demand for trade policy integration of welfare standards, ensuring global competitors meet equivalent requirements to protect EU ethical and economic interests.  \nALDE completely endorses leveraging CAP funds to alleviate farmers’ welfare-related financial burdens, recognizing this as critical to achieving equitable agricultural modernization.  \nALDE fully agrees with prioritizing sterilization systems and identification protocols for stray animals, reflecting ALDE’s evidence-based approach to comprehensive welfare frameworks."
      },
      {
        "party_name": "SD",
        "score": 0.6596858638743456,
        "choice": 6,
        "stance": "SD supports the issue's emphasis on CAP funding for animal welfare improvements, advising enhanced allocation to DG Research for applied studies on modern husbandry technologies.  \nSD endorses strict penalties for transport violations but proposes transitional financial mechanisms for new Member States to address disparities in regulatory preparation timelines.  \nSD advocates extending the Framework Law's scope to include standardized veterinary care benchmarks, ensuring health protections align with consumer expectations.  \nSD advises mandating third-country import audits with proportional tariff adjustments to prevent market distortion while advancing global welfare standards.  \nSD highlights the need to pair slaughter method labeling with public awareness campaigns explaining welfare implications, reinforcing consumer policy integration."
      },
      {
        "party_name": "ECR",
        "score": 0.4909090909090909,
        "choice": 4,
        "stance": "ECR conditionally supports the funding mechanisms but demands revised CAP allocation formulas to prevent disproportionate burdens on small-scale farmers.  \nECR supports trade reciprocity requirements but insists on amending Section 5(b) to mandate real-time import certification audits rather than self-reporting.  \nECR endorses pet sterilization systems but requests exemption clauses for working animals in agricultural sectors under national jurisdiction.  \nECR objects to the universal 8-hour live transport limit, proposing geographic exceptions for Arctic regions with ferry-dependent communities.  \nECR requires deletion of centralized zoo accreditation protocols in Annex II, advocating instead for member state-led inspection regimes with minimum standards."
      }
    ],
    "resolution": "The European Parliament raised the need for a comprehensive EU Animal Welfare Strategy 2012–2015, emphasizing compliance with existing legislation, enhanced funding, and integration of animal welfare into trade, research, and consumer policies. It stressed the importance of Article 13 of the TFEU, which mandates animal welfare as a legal priority, and called for stricter enforcement of regulations on transport, slaughter, and zoo conditions, including an 8-hour limit for live animal transport and penalties for non-compliance. The resolution highlighted the economic burden on farmers due to uneven cost distribution in the food chain and urged financial support through CAP and rural development funds. It demanded trade reciprocity, requiring imported products to meet EU welfare standards, and consumer labeling for meat from non-stunned slaughter and farming methods. The Parliament advocated for a European Animal Welfare Framework Law to simplify legislation, cover all animals (including 100 million EU dogs and cats), and address stray animal management through sterilization and identification systems. It emphasized reducing antibiotic use in farming, banning cosmetics tested on animals by March 2013, and promoting non-animal research alternatives. Wild animal health risks, zoonotic disease prevention, and zoo welfare standards were prioritized, alongside calls for ratification of the European Convention for the Protection of Pet Animals. The resolution also urged harmonized inspections, penalties for violations, and consumer education to reflect welfare-related costs, while opposing trade agreements that undermine EU welfare standards.",
    "total_score": 0.7612732095490716,
    "total_choice": 7,
    "party_num": 4,
    "id": 19,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.4,
      0.4,
      0.1,
      0.1
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "agriculture",
    "title": "Support for rural development by the European Agricultural Fund for Rural Development: REPORT on the proposal for a regulation of the European Parliament and of the Council amending Council Regulation (EC) No 1698/2005 on support for rural development by the European Agricultural Fund for Rural Development (EAFRD)",
    "background": "The Treaty of Lisbon's 2009 implementation required EU legislation alignment with new delegated/implementing act procedures. The European Commission proposed amendments to Council Regulation (EC) No 1698/2005 on EAFRD rural development support to comply with Treaty provisions, prompting subsidiarity objections from multiple national parliaments. The Parliament will discuss regulatory adjustments to align EAFRD governance with post-Lisbon institutional frameworks.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9111111111111111,
        "choice": 9,
        "stance": "EPP fundamentally supports the alignment of rural development funding with EU climate goals through binding eco-scheme allocations, perfectly reflecting its commitment to sustainable agricultural modernization.  \nEPP perfectly aligns with the issue’s emphasis on delegated acts under Lisbon Treaty provisions, ensuring legislative clarity while maintaining flexibility for crisis management tools.  \nEPP strongly promotes prioritizing small farms in fund distribution, advancing its manifesto principle of equitable competitiveness across all member states’ agricultural sectors.  \nEPP applauds the insistence on transparent trialogue processes and inclusion of committee members in negotiations, reinforcing its democratic governance priorities under codecision powers.  \nEPP unequivocally backs maintaining emergency market intervention mechanisms, consistent with its crisis preparedness agenda for food security and price stability."
      },
      {
        "party_name": "EFD",
        "score": 0.5483870967741935,
        "choice": 5,
        "stance": "EFD supports the reduction of administrative burdens in rural development programs, aligning with the issue’s simplification objectives.  \nEFD advises reallocating resources from organic farming subsidies to conventional farmers facing high input costs, citing current market pressures.  \nEFD expresses concern over perceived Commission overreach in implementing acts, urging stricter adherence to subsidiarity principles.  \nEFD endorses measures supporting producer associations in the fruit and vegetable sector as crucial for market competitiveness.  \nEFD recommends maintaining crisis management tools while ensuring they are accessible to all farm sizes, particularly small and medium enterprises."
      },
      {
        "party_name": "ALDE",
        "score": 0.9397590361445783,
        "choice": 9,
        "stance": "ALDE totally promotes the issue’s alignment with Lisbon Treaty principles, recognizing Parliament’s colegislative authority as critical to ensuring democratic oversight of rural development funds.  \nALDE perfectly aligns with the issue’s climate-focused allocation of 30% to eco-schemes, reflecting their unwavering commitment to integrating environmental sustainability into agricultural policy.  \nALDE strongly sanctions the equitable distribution of funds prioritizing small farms, viewing this as essential to advancing fair market access and competitiveness across all member states.  \nALDE applauds the retention of crisis management tools, which resonate with their insistence on robust governance structures to protect rural economies from volatility.  \nALDE unequivocally backs transparency measures against unfair trading practices, seeing this as foundational to their advocacy for accountable supply chains and equitable stakeholder participation."
      },
      {
        "party_name": "SD",
        "score": 0.9057591623036649,
        "choice": 9,
        "stance": "SD totally advocates the strict application of delegated acts under the Lisbon Treaty to safeguard legal certainty in CAP implementation, perfectly aligning with SD's commitment to protecting farmers from disruptive policy suspensions.  \nSD perfectly aligns with defending Parliament's co-legislative authority against Council obstruction, effectively advancing SD's priority of democratic agricultural governance post-Lisbon.  \nSD totally advocates maintaining crisis management tools and direct payment structures as critical to fulfilling SD's manifesto pledge for resilient rural economies.  \nSD perfectly aligns with prioritizing Treaty-compliant decision-making processes, ensuring CAP reforms adhere to SD's legal integrity standards while delivering farmer-focused outcomes.  \nSD totally advocates leveraging Parliament's strengthened role under Lisbon to embed citizen input in CAP design, directly advancing SD's participatory democracy principles."
      }
    ],
    "resolution": "The European Parliament raised concerns regarding a legislative proposal on common agricultural policy reform, adopting its position at first reading to endorse measures aimed at enhancing market orientation, strengthening farmers’ competitiveness, and ensuring sustainable rural development. It emphasized aligning the policy with EU climate goals, reducing administrative burdens, and allocating at least 30% of direct payments to eco-schemes by 2023. The resolution called for equitable distribution of funds across member states, prioritizing small and medium-sized farms, and maintaining crisis management tools such as emergency funds and market interventions. It urged the Commission to ensure transparency in supply chains and address unfair trading practices. The Parliament also highlighted subsidiarity objections from the Lithuanian, Luxembourg, and Polish national parliaments but affirmed the proposal’s compliance with EU principles. Additionally, it referenced the European Economic and Social Committee’s 2011 opinion supporting the reform’s objectives and instructed its President to forward the adopted position to the Council and Commission for further action.",
    "total_score": 0.8554376657824934,
    "total_choice": 8,
    "party_num": 4,
    "id": 20,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.3,
      0.5,
      0.1,
      0.1
    ],
    "veto_party_name": "EFD"
  },
  {
    "topic": "agriculture",
    "title": "System of financing by the European Agricultural Guarantee Fund: REPORT on the proposal for a regulation of the European Parliament and of the Council amending Council Regulation (EC) No 485/2008 on scrutiny by Member States of transactions forming part of the system of financing by the European Agricultural Guarantee Fund",
    "background": "The Treaty of Lisbon (2009) reformed EU legislative procedures, replacing comitology with delegated and implementing acts, requiring alignment of existing regulations like Council Regulation (EC) No 485/2008 on European Agricultural Guarantee Fund financing. The Parliament will discuss amending the regulation to comply with post-Lisbon institutional frameworks.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9074074074074074,
        "choice": 9,
        "stance": "EPP firmly endorses the issue's alignment with Parliament's codecision authority under the Lisbon Treaty, perfectly reflecting EPP's commitment to robust legislative control over agricultural financing.  \nEPP perfectly aligns with the imperative to embed critical CAP provisions in basic acts, ensuring co-legislators retain direct oversight of market stabilization measures as mandated by Articles 42 and 43(2) TFEU.  \nEPP fully supports advancing institutional transparency through decisive plenary votes on unresolved trialogue matters, reinforcing Parliament’s role as an equal colegislator in CAP reforms.  \nEPP perfectly aligns with maintaining a crisis reserve mechanism at current levels, safeguarding the EU’s capacity to address agricultural market volatility while ensuring equitable competition across Member States.  \nEPP firmly endorses the strategic use of delegated acts for technical adjustments, upholding democratic accountability while providing necessary regulatory flexibility for farmers."
      },
      {
        "party_name": "EFD",
        "score": 0.5483870967741935,
        "choice": 5,
        "stance": "EFD supports the simplification of reporting requirements in rural development programmes as a step toward reducing administrative burdens.  \nEFD advises maintaining support for producer associations in the fruit and vegetable sector to strengthen market stability.  \nEFD expresses concern over continued subsidies for organic farming, urging reallocation of funds to address urgent price pressures in conventional agriculture.  \nEFD proposes amending Article 4 to include parliamentary oversight mechanisms for implementing acts, ensuring democratic accountability.  \nEFD highlights the need to prioritize market-driven solutions over bureaucratic measures, referencing wheat price volatility as requiring immediate policy focus.  "
      },
      {
        "party_name": "ALDE",
        "score": 0.9397590361445783,
        "choice": 9,
        "stance": "ALDE completely agrees the issue’s insistence on colegislative parity under Lisbon Treaty provisions, perfectly aligning with their commitment to institutional balance in agricultural policymaking.  \nALDE highlights the issue’s critical role in transforming Council resistance into enhancement opportunities for Treaty-compliant delegated acts, ensuring parliamentary scrutiny over non-essential policy elements.  \nALDE perfectly aligns with the issue’s procedural transparency demands, which advance their longstanding priority of holding the Commission accountable as a Treaty guardian rather than a Council ally.  \nALDE urges rigorous enforcement of Article 43(2) TFEU through this issue, framing Parliament’s colegislative authority as non-negotiable in CAP reform negotiations.  \nALDE champions the issue’s alignment with the European Economic and Social Committee’s recommendations, viewing it as a necessary safeguard against regression to pre-Lisbon intergovernmentalism."
      },
      {
        "party_name": "SD",
        "score": 0.9267015706806283,
        "choice": 9,
        "stance": "SD totally advocates the issue’s strict adherence to the Treaty of Lisbon’s legal framework, perfectly aligning with SD’s commitment to institutional integrity and farmer-centric policymaking.  \nSD perfectly aligns with the imperative to uphold delegated acts as essential tools for democratic accountability, reinforcing SD’s priority to counterbalance Council overreach and protect Parliament’s Treaty-mandated role.  \nSD totally advocates the issue’s emphasis on procedural continuity, which effectively advances SD’s longstanding advocacy for transparent stakeholder engagement in CAP implementation.  \nSD perfectly aligns with the urgency to avoid legal challenges to CAP stability, reflecting SD’s unwavering defense of farmers’ uninterrupted access to EU support mechanisms.  \nSD totally advocates the issue’s alignment with citizen-driven policymaking, mirroring SD’s manifesto pledge to amplify public participation in EU agricultural governance."
      }
    ],
    "resolution": "The European Parliament raised its position on a legislative proposal concerning agriculture and common market organization, based on the Commission’s 2010 proposal (COM(2010)0761) and Articles 42 and 43(2) of the TFEU, which govern agricultural policy and exceptional measures for market stabilization. It adopted its first-reading stance, emphasizing the need for alignment with Treaty objectives and the European Economic and Social Committee’s May 2011 opinion, while relying on the Committee on Agriculture and Rural Development’s report (A7-0204/2011). The resolution urged the Commission to re-engage Parliament if proposing significant amendments or alternative texts and directed its President to transmit Parliament’s position to the Council, Commission, and national parliaments, ensuring procedural continuity and institutional transparency.",
    "total_score": 0.8673740053050398,
    "total_choice": 8,
    "party_num": 4,
    "id": 21,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.1,
      0.3,
      0.5,
      0.1
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "agriculture",
    "title": "Specific measures for agriculture in the outermost regions of the Union: REPORT Proposal for a regulation of the European Parliament and of the Council laying down specific measures for agriculture in the outermost regions of the Union",
    "background": "The European Union’s outermost regions face structural agricultural challenges due to geographic remoteness, insularity, and higher transport costs under Article 349 TFEU recognizing permanent natural handicaps. The Parliament will discuss revising targeted support mechanisms to address sustainable agricultural development in these territories.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.8814814814814815,
        "choice": 8,
        "stance": "EPP strongly upholds the POSEI program's alignment with EU cohesion goals, emphasizing its critical role in sustaining agricultural economies in outermost regions like the Azores.  \nEPP proposes enhancing specific support measures for dairy sectors facing quota elimination, ensuring structural adaptation funds are prioritized in future POSEI revisions to address unique production dependencies.  \nEPP approves the inclusion of mandatory impact assessments for trade agreements, safeguarding RUP economies from external market pressures as mandated under Article 349 TFEU.  \nEPP endorses the proposed €30 million compensation for banana producers and budget inflation adjustments, recognizing transport-cost competitiveness challenges in ultra-peripheral territories.  \nEPP welcomes procedural flexibilities and Mayotte's phased integration into RUP mechanisms, demonstrating adaptive policy frameworks for evolving regional statuses."
      },
      {
        "party_name": "EFD",
        "score": 0.3870967741935484,
        "choice": 3,
        "stance": "EFD entirely rejects the geographical scope of the issue for excluding British Overseas Territories like the Falkland Islands, conflicting with their sovereignty principles.  \nThe proposal overlooks critical EFD priorities by denying UK Atlantic territories equal agricultural status to French/Spanish regions, contravening national integration commitments.  \nEFD demands amendments to Article 1 to incorporate mechanisms for UK territories’ inclusion, mirroring Mayotte’s integration into France’s outermost regions framework.  \nThe issue’s current definition of outermost regions directly contradicts EFD’s manifesto pledge to treat Gibraltar and Saint Helena as integral UK agricultural zones.  \nEFD rejects Clause 3’s cohesion criteria as incompatible with their policy to extend Norwich-equivalent support structures to Falkland Islands farmers post-referendum."
      },
      {
        "party_name": "ALDE",
        "score": 0.927710843373494,
        "choice": 9,
        "stance": "ALDE firmly approves the issue's integration of biodiversity preservation with agricultural modernization in outermost regions, perfectly aligning with our commitment to ecological stewardship and cultural continuity.  \nALDE strongly promotes the targeted measures addressing demographic and geographic challenges in remote areas, recognizing their indispensable role in sustaining rural communities through enhanced agricultural viability.  \nALDE champions the issue's prioritization of Aegean island agriculture as a catalyst for reversing unemployment trends and repopulating depopulating regions through structured EU support mechanisms.  \nALDE applauds the proposal's explicit linkage between insularity challenges and Single Market accessibility, ensuring transport-cost disparities do not marginalize peripheral agricultural producers.  \nALDE perfectly aligns with the issue's dual focus on high-efficiency food production and climate-resilient traditional practices, safeguarding both immediate food security and long-term genetic diversity."
      },
      {
        "party_name": "SD",
        "score": 0.8115183246073299,
        "choice": 8,
        "stance": "SD strongly accepts the issue's alignment with sustainable rural development goals, particularly its emphasis on leveraging cultural heritage and environmental assets of outermost islands as proposed in Spiros Danellis' integrated development plan.  \nSD approves the enhanced monitoring mechanisms for dairy and banana sectors under Article 6, aligning with Eric Andrieu's emphasis on countering trade agreement impacts through targeted production support.  \nSD proposes expanding Article 174 implementation guidelines to include inter-regional transport cost analyses, addressing Patrice Tirolien's call for EU-mediated solutions to insular logistics challenges.  \nSD endorses Luís Paulo Alves' demand for mandatory RUP-specific impact assessments in international trade deals, urging their formal incorporation into the Commission's ongoing evaluation framework.  \nSD highlights Vasilica Dăncilă's operational recommendations as critical enhancements to the supply regime, ensuring local agricultural viability while maintaining consumer price stability."
      }
    ],
    "resolution": "The European Parliament raised its position on the Commission’s 2010 proposal (COM(2010)0498) concerning agricultural and rural development policies, emphasizing the need for alignment with Treaty provisions and regional cohesion. It endorsed the Committee on Agriculture and Rural Development’s report (A7-0321/2011), incorporating input from the Committees on International Trade, Budgets, and Regional Development, to strengthen measures supporting farmers, trade fairness, and sustainable rural development. The resolution formally adopted Parliament’s first-reading stance, urging the Commission to resubmit the proposal if substantial revisions occur, and directed the President to transmit Parliament’s position to the Council, Commission, and national parliaments to ensure procedural continuity and legislative coherence.",
    "total_score": 0.7679045092838196,
    "total_choice": 7,
    "party_num": 4,
    "id": 22,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.2,
      0.3,
      0.3,
      0.2
    ],
    "veto_party_name": "ALDE"
  },
  {
    "topic": "agriculture",
    "title": "Specific measures for agriculture in the outermost regions of the Union (amendment of Regulation (EC) No 247/2006): REPORT on the proposal for a regulation of the European Parliament and of the Council amending Regulation (EC) No 247/2006 laying down specific measures for agriculture in the outermost regions of the Union",
    "background": "The Treaty of Lisbon’s entry into force altered legislative procedures, requiring updates to EU agricultural regulations. Outermost regions face structural challenges like remoteness and economic reliance on limited sectors under Regulation (EC) No 247/2006. The Parliament will discuss amending specific agricultural measures for these regions under the new institutional framework.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9118773946360154,
        "choice": 9,
        "stance": "EPP fundamentally promotes the issue’s alignment with Article 349 TFEU, perfectly reflecting its commitment to addressing structural handicaps in outermost regions through tailored agricultural safeguards.  \nEPP highlights enhancement opportunities for sugar beet production in São Miguel, proposing strengthened export allowance mechanisms to bolster crisis-resistant diversification strategies.  \nEPP perfectly aligns with measures stabilizing the Canary Islands’ milk-based preparations industry, recognizing their critical role in sustaining local employment and food security under permanent geographic constraints.  \nEPP underscores the necessity of maintaining exceptional support for sugar cane farmers in Réunion and similar regions, ensuring coherence with rural development priorities and food supply resilience.  \nEPP urges vigilant monitoring of Mercosur negotiations to prevent disproportionate impacts on outermost regions’ agricultural sectors, aligning with its manifesto pledge to prioritize EU producers in trade agreements."
      },
      {
        "party_name": "ALDE",
        "score": 0.8928571428571429,
        "choice": 8,
        "stance": "ALDE strongly endorses the balanced regional development focus, aligning with their commitment to cohesion in Europe’s outermost regions.  \nALDE applauds the emphasis on agricultural self-sufficiency as vital for security, matching their priorities for biodiversity and crisis resilience.  \nALDE endorses the long-term structural measures, noting their consistency with ALDE’s advocacy for sustainable rural economic frameworks.  \nALDE proposes specifying monitoring mechanisms in Article 4 to quantify progress while fully backing the issue’s strategic objectives.  \nALDE emphasizes the urgency of implementing these measures to address geographic vulnerabilities, reflecting their manifesto’s regional equity principles."
      },
      {
        "party_name": "SD",
        "score": 0.8655913978494624,
        "choice": 8,
        "stance": "SD strongly sanctions the harmonized criteria for delimiting agricultural areas in outermost regions, aligning perfectly with SD's commitment to transparent EU-wide policy implementation.  \nSD applauds the issue's focus on agricultural diversification strategies, particularly the promotion of sugar beet cultivation in the Azores as an environmentally sustainable alternative to dairy production.  \nSD proposes extending reconstituted milk production exemptions to Martinique and Guadeloupe during the mid-term review, enhancing economic resilience without opposing the current framework.  \nSD emphasizes that the issue's rural development coherence matches SD's 2023 manifesto priorities for territorial cohesion in geographically disadvantaged regions.  \nSD approves the integration of Lisbon Treaty provisions into outermost regions' agricultural policy, effectively advancing SD's vision of treaty-aligned sectoral modernization."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.058823529411764705,
        "choice": 0,
        "stance": "GUE_NGL entirely againsts the abolition of milk quotas, declaring it will catastrophically undermine the Azores' dairy economy and contradicts their defense of small-scale agricultural producers.  \nGUE_NGL rejects temporary aid frameworks for outermost regions, demanding permanent structural support to address enduring geographic and economic constraints as a non-negotiable principle.  \nGUE_NGL condemns the sugar compromise as dangerously insufficient, arguing it abandons Réunion Island’s farmers to market volatility despite their dependency on regulated systems.  \nGUE_NGL highlights the proposal’s failure to rectify delayed vine reconversion in Madeira, emphasizing that underfunded incentives directly contradict commitments to rural revitalization.  \nGUE_NGL opposes market-centric agricultural reforms, asserting they violate food sovereignty principles and exacerbate vulnerabilities in outermost regions’ economies."
      }
    ],
    "resolution": "The European Parliament raised concerns regarding the alignment of the Commission’s 2009 proposal (COM(2009)0510) with the legal frameworks of the EC Treaty, particularly Articles 36, 37, and 299(2), and the Treaty on the Functioning of the European Union (TFEU), including Articles 42, 43(2), and 349, which govern agricultural and outermost regions’ policies. It emphasized the implications of the Treaty of Lisbon’s entry into force, as outlined in the Commission’s communication (COM(2009)0665), for ongoing legislative procedures. The resolution incorporated the European Economic and Social Committee’s opinion and relied on the Committee on Agriculture and Rural Development’s report (A7‑0054/2010) and the Committee on Regional Development’s input, stressing the need for coherence in policies affecting rural and regional development. It adopted its first-reading position, urging the Commission to uphold the proposal’s integrity or revisit Parliament for substantial amendments, while underscoring adherence to procedural rules (Rule 55) and interinstitutional collaboration.",
    "total_score": 0.8076398362892224,
    "total_choice": 8,
    "party_num": 4,
    "id": 23,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.1,
      0.1,
      0.1,
      0.7
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "agriculture",
    "title": "Specific measures in favour of agriculture in the smaller Aegean islands: REPORT on the proposal for a regulation of the European Parliament and of the Council laying down specific measures for agriculture in favour of the smaller Aegean islands",
    "background": "Persistent geographical isolation, high transport costs, limited agricultural resources, aging populations, and economic vulnerabilities in the EU's smaller Aegean islands and outermost regions necessitated tailored agricultural support. The Parliament will discuss EU measures addressing structural challenges to sustain local farming and regional development in these disadvantaged areas.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.8740740740740741,
        "choice": 8,
        "stance": "EPP strongly upholds the POSEI program's alignment with EU solidarity principles, emphasizing its critical role in sustaining agricultural economies in outermost regions like the Azores.  \nEPP applauds the inclusion of impact assessments for trade agreements, ensuring protection for vulnerable agricultural sectors in line with EPP's economic cohesion priorities.  \nEPP proposes enhancing budget allocations to account for inflationary pressures, ensuring the program's long-term effectiveness without opposing its current structure.  \nEPP endorses procedural flexibility measures and targeted support for dairy sectors in French Caribbean territories, reflecting adaptive policy design consistent with EPP's regional development goals.  \nEPP suggests expanding the framework to recognize unique challenges in other geographically isolated EU regions while maintaining focus on the Aegean islands' immediate needs."
      },
      {
        "party_name": "EFD",
        "score": 0.3225806451612903,
        "choice": 3,
        "stance": "EFD partly accepts the agricultural framework but stresses its fundamental conflict with territorial sovereignty principles by excluding British overseas territories from outermost region provisions.  \nEFD requests revisions to Article 4 to explicitly extend agricultural subsidies to UK territories like the Falklands, mirroring support given to French and Spanish territories.  \nThe proposal overlooks critical aspects of national jurisdiction, inconsistent with EFD’s manifesto commitment to fully integrate British overseas territories into UK governance structures.  \nEFD highlights the issue’s geographic imbalance, noting its failure to address Atlantic territories’ agricultural needs despite covering Aegean islands under similar remoteness criteria.  \nEFD demands future amendments requiring Commission consultation with all member states on territorial designations, ensuring parity for British territories in EU agricultural policies."
      },
      {
        "party_name": "SD",
        "score": 0.9057591623036649,
        "choice": 9,
        "stance": "SD fully sanctions the issue’s emphasis on maximizing synergies between cultural heritage, environmental preservation, and agricultural development in the Aegean islands, perfectly aligning with SD’s commitment to integrated sustainable growth.  \nSD applauds the proposal’s focus on leveraging tourism to enhance local genetic resource utilization, effectively advancing SD’s priority of fostering resilient rural economies.  \nSD perfectly aligns with the call to expand transport cost support mechanisms to Crete, the Ionian Islands, and other peripheral regions, reflecting SD’s longstanding advocacy for equitable territorial cohesion.  \nSD fully sanctions the issue’s alignment with Article 174 of the Lisbon Treaty, which SD views as critical to addressing unique challenges of insularity through targeted agricultural investments.  \nSD highlights the issue’s reinforcement of financial safeguards for banana and dairy sectors as exemplary, mirroring SD’s manifesto goals to protect vulnerable agricultural markets from global trade pressures."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.058823529411764705,
        "choice": 0,
        "stance": "GUE_NGL rejects fundamentally the issue's failure to challenge EU austerity policies exacerbating agricultural collapse in the Aegean islands.  \nGUE_NGL opposes the proposal's alignment with CAP deregulation that eliminated milk quotas and sugar protections, directly harming small producers as evidenced in Chios' mastic crisis.  \nGUE_NGL condemns the omission of permanent compensation mechanisms for climate disasters, leaving fire-ravaged farmers without support.  \nGUE_NGL denounces the tolerance of shipping monopolies' exploitative practices that isolate island economies, contradicting claims of addressing transport constraints.  \nGUE_NGL declares the measures incompatible with their anti-capitalist platform, insisting true solutions require socialized production models beyond EU frameworks."
      }
    ],
    "resolution": "The European Parliament raised its position at first reading on the Commission’s agricultural policy proposal (COM(2010)0767), grounded in the Committee on Agriculture and Rural Development’s report (A7-0319/2011) and aligned with Treaty on the Functioning of the European Union Articles 294(2), 42, and 43(2), which govern legislative procedures and agricultural policy competencies. The resolution emphasized advancing the proposal’s objectives under the Common Agricultural Policy framework, ensuring compliance with EU legal standards, and addressing sector-specific challenges. It mandated procedural safeguards requiring the Commission to re-engage Parliament if proposing substantial amendments, thereby preserving legislative coherence and democratic oversight.",
    "total_score": 0.7957559681697612,
    "total_choice": 7,
    "party_num": 4,
    "id": 24,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.1,
      0.3,
      0.1,
      0.5
    ],
    "veto_party_name": "GUE_NGL"
  },
  {
    "topic": "agriculture",
    "title": "Vaccination against bluetongue: REPORT on the proposal for a directive of the European Parliament and of the Council amending Directive 2000/75/EC as regards vaccination against bluetongue",
    "background": "Bluetongue outbreaks in multiple EU Member States caused significant livestock losses and trade disruptions, with existing 2000 legislation restricting vaccine use to infected zones. Advances in vaccine technology enabled safer inactivated vaccines, prompting calls for updated measures. The Parliament will discuss amending animal health directives to expand preventive vaccination against bluetongue across the EU.",
    "stances": [
      {
        "party_name": "EFD",
        "score": 0.6129032258064516,
        "choice": 6,
        "stance": "EFD supports the emphasis on veterinary recommendations but questions centralized EU oversight in vaccination protocols.  \nEFD advises amending Article 2 to explicitly safeguard member state autonomy in vaccine funding and implementation timelines.  \nEFD expresses concern over unresolved legislative ambiguities stemming from Lisbon Treaty alignment in agricultural policy frameworks.  \nEFD supports maintaining national sovereignty in disease management while acknowledging procedural transparency improvements.  \nEFD highlights the need to limit bureaucratic interference in favor of localized, farmer-led decision-making structures."
      },
      {
        "party_name": "ALDE",
        "score": 0.7261904761904762,
        "choice": 7,
        "stance": "ALDE strongly endorses the issue’s emphasis on vaccination as a critical tool to combat bluetongue, aligning perfectly with ALDE’s commitment to proactive agricultural adaptation in response to climate-driven disease threats.  \nALDE approves the flexibility granted to Member States to implement preventive vaccination, which effectively advances ALDE’s priority of leveraging technological innovation to protect livestock and rural economies.  \nALDE highlights the importance of integrating climate-related epizootic risks into broader EU strategies, as exemplified by the issue’s forward-looking approach to disease management.  \nALDE commends the rapporteur’s work in aligning the legal framework with agricultural policy objectives, ensuring procedural continuity while addressing emerging veterinary challenges.  \nALDE proposes enhancing coordination with veterinary services across Member States to standardize implementation, ensuring the issue’s goals are uniformly achieved without opposing its core principles."
      },
      {
        "party_name": "SD",
        "score": 0.8913043478260869,
        "choice": 8,
        "stance": "SD strongly upholds amending Directive 2000/75/EC to authorize the inactivated bluetongue vaccine, aligning perfectly with SD’s commitment to agricultural health and economic protection for farmers facing movement restrictions.  \nSD approves the issue’s revised legal basis under Article 43(2) TFEU, ensuring parliamentary co-decision and procedural transparency in line with the Lisbon Treaty’s ordinary legislative framework.  \nSD applauds the urgency of enabling pre-summer vaccination campaigns, which effectively advances SD’s priority of rapid, science-driven crisis response to safeguard livestock markets and public health.  \nSD proposes enhancing biosecurity by prioritizing EU-funded research into marked inactivated vaccines to distinguish vaccinated animals, addressing potential trade barriers while maintaining current provisions.  \nSD emphasizes strict adherence to Treaty protocols while urging the Council to expedite approval without procedural delays, ensuring farmers benefit from the directive’s protections this season."
      },
      {
        "party_name": "ECR",
        "score": 0.7962962962962963,
        "choice": 7,
        "stance": "ECR strongly approves the issue’s accelerated vaccination timeline to combat bluetongue, aligning with their commitment to proactive agricultural disease prevention and efficient governance.  \nECR approves the provisions enabling vaccination outside exclusion zones, which enhances farmer autonomy and aligns with their policy goals for flexible livestock management.  \nECR emphasizes the urgency of swift implementation to meet pre-May vaccination deadlines, urging interinstitutional cooperation to avoid procedural delays that could jeopardize disease control.  \nECR proposes amending Article 4 to mandate EU funding for virological testing protocols, ensuring trade continuity by distinguishing vaccinated from infected animals without imposing undue costs on farmers.  \nECR highlights the issue’s alignment with reducing bureaucratic barriers while advocating ongoing review of correlation table requirements to maintain legislative agility."
      }
    ],
    "resolution": "The European Parliament raised its position on the Commission’s agricultural policy proposal, adopting its first reading stance under Article 43(2) of the Treaty on the Functioning of the European Union, as requested by the Council, which had sought a revised legal basis for the proposal. The resolution emphasized the need for the Commission to resubmit the proposal to Parliament if substantial amendments or replacements were planned, ensuring legislative transparency and procedural continuity. It further directed the Parliament’s President to formally transmit its adopted position to the Council, Commission, and national parliaments, reinforcing inter-institutional communication and adherence to EU legislative processes. The resolution focused on aligning the proposal’s legal framework with agricultural policy objectives while upholding procedural requirements under relevant Treaty provisions.",
    "total_score": 0.7997275204359673,
    "total_choice": 7,
    "party_num": 4,
    "id": 25,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.2,
      0.4,
      0.3,
      0.1
    ],
    "veto_party_name": "ALDE"
  },
  {
    "topic": "agriculture",
    "title": "Scheme for food distribution to the most deprived persons in the Union: JOINT MOTION FOR A RESOLUTION on the Scheme for food distribution to the most deprived persons in the Union",
    "background": "The EU’s food distribution scheme, established in 1987 under the Common Agricultural Policy (CAP), faced reduced intervention stocks due to CAP reforms, leading to increased market purchases. A 2011 CJEU ruling invalidated market-based provisions, triggering a funding reduction from €500 million (2011) to €113 million (2012) amid rising food poverty during the economic crisis. The Parliament will discuss the scheme’s continuity and legal framework adjustments.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.8396946564885496,
        "choice": 8,
        "stance": "EPP strongly agrees maintaining transitional funding to prevent abrupt cuts in food aid, aligning with their commitment to social solidarity during economic crises.  \nEPP emphasizes the fundamental right to food and condemns the court ruling's impact on vulnerable populations as contradictory to EU anti-poverty initiatives.  \nEPP proposes modifying Regulation (EC) No 983/2008 to clarify legal bases for market purchases rather than creating entirely new programs, ensuring continuity of aid distribution.  \nEPP applauds linking food aid to the EU 2020 Strategy’s poverty targets, reinforcing their manifesto priority of integrated social policies.  \nEPP urges sustainable financing mechanisms post-2014 while enhancing coordination with agricultural policies to address food waste and rural poverty."
      },
      {
        "party_name": "EFD",
        "score": 0.2903225806451613,
        "choice": 2,
        "stance": "EFD fully conflicts the issue's expansion of food dependency mechanisms, conflicting with their principle that welfare systems should prioritize economic self-sufficiency over perpetual aid.  \nEFD rejects the proposal's failure to mandate concrete transition timelines toward employment-based solutions, overlooking critical aspects of social inclusion outlined in their manifesto.  \nThe issue contradicts EFD's stance against institutionalizing poverty management by maintaining intervention stocks without parallel workforce integration programs.  \nEFD highlights the proposal's inconsistency with subsidiarity principles, arguing food aid should be fully nationalized rather than expanded through EU budgetary mechanisms.  \nThis approach overlooks EFD's core objection to conflating agricultural policy with social welfare, creating structural dependencies the party explicitly condemns."
      },
      {
        "party_name": "SD",
        "score": 0.8548387096774194,
        "choice": 8,
        "stance": "SD strongly sanctions maintaining EU-level funding for food distribution, aligning with their commitment to social solidarity and the Lisbon Treaty’s mandate to combat exclusion. They propose transitional financing mechanisms for 2012-2013 to prevent aid gaps while pursuing CAP reform.  \n\nSD approves the issue’s emphasis on food access as a fundamental right, urging immediate legal revisions to allow market purchases beyond intervention stocks without reducing total allocation.  \n\nSD endorses integrating food security stocks into CAP post-2014 reforms, suggesting explicit provisions for crisis-responsive agricultural reserves to address both farmer stability and emergency needs.  \n\nSD advocates maintaining the €500 million annual budget through alternative social funding streams, emphasizing that poverty reduction remains central to Europe 2020 Strategy implementation.  \n\nSD highlights the need to coordinate with food banks and NGOs in redesigning the program, recommending formal consultation requirements in the revised regulatory framework."
      },
      {
        "party_name": "ECR",
        "score": 0.24074074074074073,
        "choice": 2,
        "stance": "ECR rejects the issue's reliance on CAP mechanisms for food distribution, completely conflicting with their principle that agricultural policy should focus solely on production efficiency rather than social welfare programs.  \nECR opposes maintaining EU-level administration of food aid, asserting that such poverty alleviation measures should be devolved to national governments under subsidiarity principles.  \nThe proposal's emphasis on expanding social rights through food provision contradicts ECR's advocacy for market-driven solutions to food security challenges.  \nECR criticizes the issue's failure to prioritize CAP reforms that increase farmer profitability as the primary method to address rural poverty.  \nThe call for sustained EU funding overlooks critical aspects of ECR's fiscal conservatism, which demands strict budget neutrality in non-core policy areas."
      }
    ],
    "resolution": "The European Parliament raised concerns about the abrupt reduction of EU funding for the food distribution scheme for the most deprived persons, which faced a drastic cut from €500 million in 2011 to €113 million in 2012 following a CJEU ruling that invalidated market purchases under Regulation (EC) No 983/2008, limiting the program to using intervention stocks. Highlighting that 43 million people in the EU are at risk of food poverty and 13 million currently rely on the scheme via 240 food banks in 19 Member States, the resolution urged transitional measures for 2012-2013 to prevent sudden aid cuts and protect vulnerable populations. It called for a long-term reassessment of the scheme’s legal basis under the CAP post-2014, noting the Commission’s proposal to transfer it away from CAP funding while ensuring sustainable financing. The Parliament emphasized the right to food as a fundamental human right, stressing the importance of nutrition, particularly for children, and linked poverty reduction to the EU 2020 Strategy’s target of lifting 20 million from poverty. It also highlighted the need to address rural poverty, ensure fair farmer incomes, minimize food waste, and integrate food aid into broader anti-poverty policies, including access to social rights. The resolution urged the Commission to propose regulatory changes to resolve legal ambiguities and maintain EU-level support amid the ongoing economic crisis.",
    "total_score": 0.7445652173913043,
    "total_choice": 7,
    "party_num": 4,
    "id": 26,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.1,
      0.1,
      0.1,
      0.7
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "agriculture",
    "title": "Transitional provisions on support for rural development: REPORT on the proposal for a regulation of the European Parliament and of the Council laying down certain transitional provisions on support for rural development by the European Agricultural Fund for Rural Development (EAFRD) and amending Regulation (EU) No  [RD] as regards resources and their distribution in respect of the year 2014 and amending Council Regulation (EC) No 73/2009 and Regulations (EU) No [DP], (EU) No [HZ] and (EU) No [sCMO] as regards their application in the year 2014",
    "background": "The European Commission proposed transitional provisions in 2013 to align rural development funding under the EAFRD with 2014 budgetary adjustments, addressing legal and operational continuity amid evolving Common Agricultural Policy reforms. The Parliament will discuss transitional support mechanisms, amendments to resource distribution frameworks, and regulatory coherence for rural development programs during the 2014 implementation period.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.8759124087591241,
        "choice": 8,
        "stance": "EPP strongly agrees the rural development funding provisions, aligning with their commitment to modernize agriculture while maintaining environmental safeguards. They emphasize proper national co-financing to maximize agri-environmental schemes and Leader programs.  \nEPP applauds the recognition of pre-existing environmental efforts in disadvantaged areas as advancing their priority for regionally adapted solutions. They propose strengthening budget allocations to counteract reductions impacting mountain communities.  \nEPP endorses the flexibility for member states to implement young farmer support schemes and small farm simplification, consistent with their manifesto goals for generational renewal. They suggest refining payment criteria to ensure equitable competitiveness across EU regions.  \nEPP approves the review mechanisms for greening measures, urging rigorous parliamentary oversight during implementation to prevent bureaucratic overreach while maintaining Treaty compliance.  \nEPP recognizes rural development's critical role in food security and urges forensic analysis of production costs to align market returns with sustainability demands."
      },
      {
        "party_name": "EFD",
        "score": 0.3870967741935484,
        "choice": 3,
        "stance": "EFD slightly promotes the transitional framework but demands elimination of unworkable livestock gender verification requirements, citing impractical bureaucratic impositions on farmers.  \nEFD requests fundamental restructuring of CAP budget allocations to phase out direct subsidies and transition toward market-based agricultural support mechanisms.  \nEFD highlights the issue's failure to prevent disproportionate penalties for small-scale Italian farms through surface-area-based funding models inconsistent with regional economic realities.  \nEFD opposes the continued neglect of territorial planning provisions, which undermines effective EU support for homogeneous agricultural zones and soil conservation priorities.  \nEFD criticizes the unresolved bureaucratic complexity that maintains unsustainable administrative burdens, contradicting promises of CAP simplification for member states."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.8448275862068966,
        "choice": 8,
        "stance": "GREEN_EFA strongly promotes the principle of public funds for public goods enshrined in the issue, particularly the initial Commission proposals for greening measures and subsidy capping for large agricultural operations.  \n\nGREEN_EFA proposes amending Article 3 to explicitly prohibit chemical treatments on all ecological focus areas, strengthening the 5% biodiversity requirement to meet scientific recommendations for functional habitats.  \n\nGREEN_EFA firmly opposes the 25% fund transfer allowance from rural development (second pillar) to direct payments (first pillar), urging member states to reject this counterproductive redistribution mechanism.  \n\nGREEN_EFA approves the mandatory 30% allocation for agri-environmental schemes in rural development programs while emphasizing the need for increased overall funding to match climate adaptation targets.  \n\nGREEN_EFA highlights the issue's failure to establish robust market regulation post-milk quotas as inconsistent with fair farmer compensation, urging immediate corrective measures through delegated acts."
      },
      {
        "party_name": "ECR",
        "score": 0.19298245614035087,
        "choice": 1,
        "stance": "ECR rejects the mandatory greening of direct payments as totally disputeing with their commitment to reducing bureaucratic burdens on farmers, advocating instead for environmental measures through rural development programs.  \nECR opposes the persistent subsidy disparities between Eastern and Western member states, highlighting Poland's €4 billion reduction as inconsistent with principles of equitable agricultural funding.  \nECR totally disputes with the issue's reversal of market-oriented reforms, criticizing the continuation of wine quotas and dairy interventions as regressive steps away from a competitive single market.  \nECR rejects the failure to establish multi-year funding programs that eliminate unequal direct payments, directly contradicting their goal of harmonizing agricultural support across all EU regions.  \nECR opposes the greening proposals' administrative costs and lack of environmental efficacy, arguing they overlook critical needs for sustainable farming practices and global competitiveness."
      }
    ],
    "resolution": "The European Parliament raised its position on the Commission’s 2013 proposal (COM(2013)0226) concerning agricultural policy, adopting its first-reading stance through the Committee on Agriculture and Rural Development, with input from the Committee on Budgets. The resolution affirmed Parliament’s formal adoption of its negotiated position, urged the Commission to re-engage Parliament if proposing significant amendments or alternative texts to the original proposal, and directed its President to transmit Parliament’s position to the Council, Commission, and national parliaments. The decision underscored legislative adherence to Treaty obligations under Article 43(2) TFEU and procedural alignment with institutional workflows, while emphasizing parliamentary oversight over substantive changes to the proposal.",
    "total_score": 0.7728459530026109,
    "total_choice": 7,
    "party_num": 4,
    "id": 27,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.2,
      0.3,
      0.3,
      0.2
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "agriculture",
    "title": "CAP tools to reduce price volatility in agricultural markets: REPORT on CAP tools to reduce price volatility in agricultural markets",
    "background": "Persistent agricultural price volatility, driven by globalization, climate change, supply-demand imbalances, geopolitical trade disruptions, and financial market influences, has impacted EU farmers' incomes and food security. The Parliament will discuss Common Agricultural Policy mechanisms to stabilize markets and address systemic risks in European farming sectors.",
    "stances": [
      {
        "party_name": "ALDE",
        "score": 0.9152542372881356,
        "choice": 9,
        "stance": "ALDE totally promotes the issue's emphasis on combating unfair trading practices from field to market, perfectly aligning with their commitment to protect farmers against exploitative supply chain dynamics.  \nALDE perfectly aligns with the call to empower agricultural cooperatives, recognizing their vital role in enabling farmers to negotiate fair terms within competitive markets.  \nALDE fully supports the establishment of sector-specific insurance mechanisms and pragmatic supply-demand balancing tools, reflecting their urgent priority to stabilize producer incomes amid global trade pressures.  \nALDE endorses enhanced market transparency measures and strengthened producer organizations as essential tools to rectify power imbalances across the agricultural value chain.  \nALDE strongly advocates for maintaining decoupled direct payments as critical income stabilizers, consistent with their vision for sustainable EU agriculture competitive against major global producers."
      },
      {
        "party_name": "SD",
        "score": 0.92,
        "choice": 9,
        "stance": "SD fundamentally promotes the issue's call for countercyclical income aids as a transformative tool to shield farmers from price collapses, perfectly aligning with S&D's manifesto commitment to market-correcting mechanisms.  \nSD perfectly aligns with the demand to leverage EIB guarantees for agricultural credit access, directly addressing Michela Giuffrida's emphasis on structural financial empowerment beyond emergency measures.  \nSD fundamentally promotes mandatory standardized contracts across food supply chains, converting Nicola Caputo's criticism of power imbalances into a reinforced mechanism to institutionalize fair pricing.  \nSD perfectly aligns with the urgency to simplify risk management tools like the Income Stabilization Tool, transforming Paolo De Castro's operational critique into a roadmap for pan-European accessibility.  \nSD fundamentally promotes prioritizing ultraperipheral regions in crisis responses, elevating Ricardo Serrão Santos' territorial specificity into a binding safeguard within CAP's solidarity framework."
      },
      {
        "party_name": "ECR",
        "score": 0.07352941176470588,
        "choice": 0,
        "stance": "ECR rejects the issue's reliance on existing CAP tools, arguing they have failed to address persistent crises and lack innovation, as highlighted by Julie Girling's critique of unchanged mechanisms like crisis reserves and mutual funds.  \nECR opposes the proposal's increased funding approach, advocating instead for a complete CAP budget reallocation based on current agricultural challenges to enhance efficiency and profitability rather than expanding ineffective programs.  \nECR firmly disputes with the issue's neglect of harmful EU policies such as Russian sanctions and austerity measures, which Νότης Μαριάς identifies as exacerbating price volatility and crippling Greek farmers through increased taxes and subsidy cuts.  \nECR criticizes the issue for overlooking structural market instability caused by climate change and global competition, with Valdemar Tomaševski emphasizing the need for stronger income stabilization tools and disaster insurance absent in current proposals.  \nECR contends the issue fails to address disparities in Pillar II support distribution among Member States, creating an uneven playing field that undermines fair competition and effective risk management across the EU."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.0,
        "choice": 0,
        "stance": "GUE/NGL rejects the issue's reliance on financial instruments and private insurance schemes, which perpetuate farmer debt and corporate control over food markets instead of addressing root causes like globalized speculation.  \nGUE/NGL opposes the report's dismissal of farmers as primary shock-absorbers, arguing that proposed mutual funds and competitiveness measures further entrench corporate dominance in price-setting.  \nGUE/NGL firmly conflicts with the issue's crisis management approach, condemning the diversion of CAP funds to insurers rather than restoring public market regulation and collective price negotiations.  \nGUE/NGL rejects the conflation of climate change with financial speculation as a volatility driver, warning this distracts from needed public production controls and entrenches U.S.-style privatized risk models.  \nGUE/NGL opposes trade agreements like CETA and Mercosur cited in debates, which exacerbate volatility by prioritizing agri-food industry profits over farmer livelihoods and mental health."
      }
    ],
    "resolution": "The European Parliament raised concerns about increasing agricultural price volatility driven by climate change, market imbalances, global competition, and financial speculation, which threaten EU farmers' incomes, food security, and rural employment, noting the loss of 2.4 million farms between 2005-2010. It criticized the inadequacy of current CAP tools, with only 2% of rural development funds and 0.4% of the total CAP budget allocated to risk management, and highlighted slow implementation of crisis measures like the single CMO and underused crisis reserves. The resolution urged stronger EU-wide risk management strategies, including sector-specific insurance, mutual funds, tax-deferred savings, and enhanced market transparency through price observatories to track supply chains and curb speculation. It called for revising competition rules to empower farmers via cooperatives and contractual negotiations, addressing imbalances in the food supply chain, and boosting crisis prevention with countercyclical aids and a reformed crisis reserve funded outside the EU budget. The Parliament stressed the need to maintain decoupled direct payments as income stabilizers, ensure fair competition against global rivals like the US, Brazil, and China, and prioritize food autonomy, sustainability, and support for vulnerable regions. Proposals included improving market data accessibility, training farmers in risk management, and leveraging synergies between CAP and other EU policies to stabilize markets, protect incomes, and foster generational renewal in agriculture.",
    "total_score": 0.6052249637155298,
    "total_choice": 6,
    "party_num": 4,
    "id": 28,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.1,
      0.6,
      0.2,
      0.1
    ],
    "veto_party_name": "ALDE"
  },
  {
    "topic": "agriculture",
    "title": "Adjustment rate for direct payments in respect of 2015: REPORT on the proposal for a regulation of the European Parliament and of the Council fixing the adjustment rate provided for in Regulation (EU) No 1306/2013 for direct payments in respect of calendar year 2015",
    "background": "Following the 2014 Russian embargo on EU agricultural imports and persistent market instability under the 2013 CAP framework mandating annual crisis reserve allocations, the Parliament will discuss establishing the 2015 direct payment adjustment rate to fund the agricultural crisis reserve, as required by EU financial discipline regulations.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.8382352941176471,
        "choice": 8,
        "stance": "EPP strongly sanctions maintaining the agricultural crisis reserve as a vital mechanism for market stability, aligning with their commitment to sustainable and efficient farming practices.  \nEPP endorses the exemption of small producers from payment reductions, ensuring equitable support distribution across all agricultural sectors.  \nEPP applauds the moderate adjustment rate (1.39%) that avoids significant financial strain on farmers while securing necessary crisis funding.  \nEPP emphasizes protecting the crisis reserve for genuine market emergencies rather than geopolitical crises, consistent with their principle of sector-specific responsibility.  \nEPP proposes extending deadlines for crisis fund applications to better align with seasonal production cycles, enhancing practical accessibility for affected sectors like horticulture and dairy."
      },
      {
        "party_name": "EFDD",
        "score": 0.3684210526315789,
        "choice": 3,
        "stance": "EFDD partly upholds the adjustment mechanism but requests revisions to devolve fund management to national authorities under Article 3.  \nEFDD fully doubts with the issue's EU-level approach, proposing amendments allowing Member States to establish parallel currency compensation schemes akin to the 'green pound'.  \nEFDD requests deletion of centralized oversight clauses, arguing they contradict subsidiarity principles demonstrated by Shropshire dairy farm disparities.  \nThis proposal overlooks critical aspects of currency volatility impacts, requiring explicit opt-outs for non-eurozone states in recital 5.  \nEFDD demands strict proportionality limits on Commission intervention powers, citing undercutting of domestic prices through eurozone imports as unresolved."
      },
      {
        "party_name": "ALDE",
        "score": 0.8181818181818182,
        "choice": 8,
        "stance": "ALDE strongly promotes the establishment of the crisis reserve fund as aligning with their commitment to market stability and safeguarding family farms, emphasizing the need for transparent allocation mechanisms to maintain trust in agricultural policy.  \nALDE proposes accelerating Croatia’s inclusion in the crisis fund by 2022 to ensure equitable access for newer Member States facing embargo-related market disruptions, framing this as an enhancement to EU solidarity principles.  \nALDE endorses the financial discipline adjustment rate’s focus on larger payments but recommends further simplification of application processes for small farmers to reduce administrative burdens while maintaining policy goals.  \nALDE highlights the necessity of supplementing crisis reserve funds with general EU budget resources during geopolitical shocks like the Russia embargo, ensuring agricultural stability without disproportionate burdens on farmers.  \nALDE approves the issue’s procedural rigor under Article 43(2) TFEU, noting its consistency with their advocacy for streamlined legislative processes and accountability in CAP implementation."
      },
      {
        "party_name": "SD",
        "score": 0.8830409356725146,
        "choice": 8,
        "stance": "SD strongly promotes establishing the agricultural crisis reserve as a critical safety net aligning with SD's commitment to protecting farmer livelihoods against unpredictable market shocks.  \nSD approves the financial discipline mechanism while proposing raising the payment reduction threshold from €2,000 to €5,000 to better shield small-scale farmers from disproportionate impacts.  \nSD emphasizes strict transparency in fund distribution, urging immediate implementation of public beneficiary registers to prevent oligarchic capture as seen in Hungary's problematic allocations.  \nSD highlights the need for enhanced crisis management tools beyond current provisions, urging the Commission to develop permanent risk-sharing instruments under CAP reform.  \nSD endorses maintaining Parliament's oversight role through Article 43(2) procedures to ensure agricultural funds serve public interests rather than political patronage networks."
      }
    ],
    "resolution": "The European Parliament raised its position on the Commission’s 2015 proposal (COM(2015)0141) concerning agricultural policy, emphasizing alignment with Treaty provisions and the Committee on Agriculture and Rural Development’s recommendations. It formally adopted its first-reading stance, urging the Commission to prioritize transparency and accountability by re-engaging Parliament if proposing substantial amendments or alternative texts. The resolution underscored the need to adhere to procedural frameworks under Article 43(2) of the Treaty on the Functioning of the European Union while streamlining legislative processes. Parliament directed its President to communicate its position to the Council, Commission, and national parliaments, ensuring coordinated implementation of agricultural policy reforms without specifying numerical targets or budgetary allocations.",
    "total_score": 0.7451274362818591,
    "total_choice": 7,
    "party_num": 4,
    "id": 29,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.3,
      0.3,
      0.1,
      0.3
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "agriculture",
    "title": "Aid scheme for the supply of fruit and vegetables, bananas and milk in the educational establishments: REPORT on the proposal for a regulation of the European Parliament and of the Council amending Regulation (EU) No 1308/2013 and Regulation (EU) No 1306/2013 as regards the aid scheme for the supply of fruit and vegetables, bananas and milk in the educational establishments",
    "background": "Declining consumption of fresh fruits, vegetables, and milk among European children, coupled with rising childhood obesity linked to processed foods, prompted EU evaluations of existing school distribution programs. The Parliament will discuss reforming agricultural aid schemes to improve nutritional education and promote healthier dietary habits through unified support mechanisms for educational establishments.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.9069767441860465,
        "choice": 9,
        "stance": "GREEN_EFA entirely agrees the explicit prohibition of EU funds for products with additives like monosodium glutamate, perfectly aligning with their decades-long campaign against processed food additives in children's diets.  \n\nThe issue's mandatory educational components on healthy nutrition and agricultural connections effectively advance GREEN_EFA's strategic goal of cultivating lifelong sustainable consumption patterns through early intervention.  \n\nGREEN_EFA strongly approves the prioritization of short supply chains and local governance in distribution logistics, recognizing this as a critical step toward their vision of regionalized food systems and reduced carbon footprints.  \n\nThe expanded product list's allowance for regional specialties under national health oversight aligns with GREEN_EFA's principle of subsidiarity, ensuring cultural relevance while maintaining nutritional standards through decentralized implementation.  \n\nGREEN_EFA celebrates the abolition of co-financing requirements for fruits/vegetables as a landmark victory for equity, enabling universal access to fresh produce in schools regardless of member states' fiscal capacity."
      },
      {
        "party_name": "SD",
        "score": 0.9479768786127167,
        "choice": 9,
        "stance": "SD firmly promotes the unified educational framework's prioritization of fresh produce and local agricultural connections, perfectly aligning with SD's commitment to combat childhood obesity through sustainable food systems.  \nSD applauds the mandatory integration of regional specialties like honey and olive oil with health authority approval, effectively advancing SD's priority of celebrating Europe's culinary diversity while maintaining nutritional standards.  \nSD strongly endorses abolishing co-financing requirements for fruits/vegetables as a critical step toward equitable access, mirroring SD's manifesto pledge to remove economic barriers in public health initiatives.  \nSD highlights the issue's focus on sensory education programs as exemplary implementation of SD's \"learning through taste\" philosophy, particularly valuing Maria Noichl's emphasis on countering processed food dominance through flavor literacy.  \nSD recognizes Croatia's specific allocation and outermost regions' enhanced support as model applications of SD's cohesion policy, proposing future expansions to include all EU regions facing unique agricultural challenges."
      },
      {
        "party_name": "ECR",
        "score": 0.5671641791044776,
        "choice": 5,
        "stance": "ECR supports the unified school nutrition scheme as a necessary step to address declining consumption of fresh produce and milk, aligning with agricultural sector revitalization goals.  \nECR advises expanding product eligibility to explicitly include traditional regional specialties like apples, ensuring cultural relevance and direct farmer benefits.  \nECR emphasizes strengthening educational measures to explicitly connect dietary habits with local agricultural systems, reinforcing long-term consumer-producer relationships.  \nECR expresses concern that the scheme’s distribution efficiency requires parallel national reforms to reduce bureaucratic burdens on participating businesses.  \nECR highlights the need for periodic review of budget allocations to better address acute crises in regions like Greece, proposing flexibility beyond fixed per-child calculations.  "
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.5319148936170213,
        "choice": 5,
        "stance": "GUE_NGL supports the prioritization of local and organic products in school nutrition programs and advises mandating preferential procurement terms for regional producers.  \nGUE_NGL recommends enhancing educational components through mandatory farm visits and market interactions as outlined in Articles 8-9.  \nGUE_NGL questions the merger of fruit and milk schemes against technical recommendations, urging reassessment of administrative efficiency.  \nGUE_NGL stresses the necessity of integrating this program with broader territorial cohesion policies to strengthen urban-rural connections.  \nGUE_NGL highlights the contradiction between promoting healthy diets and allowing fast-food marketing near schools, urging complementary zoning regulations.  "
      }
    ],
    "resolution": "The European Parliament raised the need to address declining consumption of fresh fruits, vegetables, and milk among children, exacerbated by rising obesity linked to processed foods, by merging the EU’s school fruit and vegetables scheme and school milk scheme into a unified program under a common legal framework. The resolution prioritizes distributing fresh produce and drinking milk while allowing Member States to include other milk products like yogurt and cheese for lactose-intolerant children, and regional specialties such as honey and olive oil, provided national health authorities approve. Educational measures to promote healthy diets and reconnect children with agriculture are mandated, with EU funding covering these initiatives. Budget allocations for each Member State are based on the number of children aged 6–10, regional development levels (prioritizing less-developed regions, the Aegean Islands, and outermost regions), and historical milk program participation, with Croatia receiving a specific allocation. The co-financing requirement for fruits and vegetables is abolished, and Member States must submit six-year strategies, updated regularly, to access annual EU aid. The resolution delegates powers to the Commission to set rules on eligible costs, publicity, and distribution logistics, ensuring visibility of EU support. The amended regulations take effect from 1 August 2017, aiming to enhance efficiency, promote local products, and combat childhood obesity through targeted, sustainable interventions.",
    "total_score": 0.7997054491899853,
    "total_choice": 7,
    "party_num": 4,
    "id": 30,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.7,
      0.1,
      0.1,
      0.1
    ],
    "veto_party_name": "GUE_NGL"
  },
  {
    "topic": "agriculture",
    "title": "Patents and plant breeders rights: JOINT MOTION FOR A RESOLUTION on patents and plant breeders’ rights",
    "background": "Existing EU directives and patent conventions excluded patents on products from conventional plant breeding, but conflicting European Patent Office decisions and pending applications created legal uncertainty. The Parliament will discuss reconciling intellectual property frameworks with agricultural innovation, biodiversity, and access to plant genetic material.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.7128712871287128,
        "choice": 7,
        "stance": "EPP strongly sanctions the issue's demand to exclude conventional breeding methods from patentability, aligning perfectly with their commitment to safeguarding agricultural innovation and food security.  \nEPP approves the urgent clarification of Directive 98/44/EC to prevent monopolization by large corporations, reinforcing their longstanding defense of small breeders and biodiversity.  \nEPP proposes enhancing legal certainty by explicitly defining \"essentially biological processes\" in Article 4 to prevent ambiguous interpretations by patent offices.  \nEPP strongly endorses harmonizing EU patent law with UPOV 1991, ensuring breeders’ rights to reuse protected varieties remain unrestricted as per their rural development priorities.  \nEPP emphasizes the issue’s critical role in protecting farmers’ traditional seed cultivation practices, which align with their advocacy for climate-resilient agriculture and genetic diversity."
      },
      {
        "party_name": "EFDD",
        "score": 0.13157894736842105,
        "choice": 1,
        "stance": "EFDD rejects the issue’s EU-wide harmonization efforts, asserting that plant breeding legislation must remain under national control to avoid replicating the regulatory failures seen in GM crop policies.  \nEFDD fundamentally disputes with restrictions on patents for conventional breeding innovations, arguing that exclusive rights are essential to incentivize costly R&D investments by breeders.  \nThe proposal overlooks critical aspects of market autonomy by ignoring farmers’ capacity to propagate traditional varieties, which EFDD views as a natural safeguard against corporate dominance.  \nEFDD opposes the issue’s intervention in breeders’ rights frameworks, advocating instead for industry-led solutions with minimal political interference to balance innovation and competition.  \nEFDD argues that the issue’s alignment with UPOV undermines breeders’ ability to protect “step change” innovations, which are vital for addressing agricultural challenges like food security."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.023809523809523808,
        "choice": 0,
        "stance": "GREEN_EFA rejects the issue's failure to explicitly enshrine farmer protections against lawsuits for accidental contamination by patented plant traits  \nGREEN_EFA opposes fundamentally the continued tolerance of corporate patent strategies that enable seed market monopolies through trivial process claims  \nGREEN_EFA condemns the absence of binding measures to terminate the European Patent Office's illegal practice of granting patents on conventional breeding outcomes  \nGREEN_EFA highlights the issue's critical omission of mandatory seed sovereignty safeguards for small-scale breeders using traditional methods  \nGREEN_EFA conflicts with provisions allowing prolonged Commission inaction on implementing Article 4 prohibitions against biological process patents"
      },
      {
        "party_name": "ALDE",
        "score": 0.7068965517241379,
        "choice": 7,
        "stance": "ALDE strongly sanctions the issue's prohibition of patents on conventional breeding traits, aligning perfectly with their commitment to open innovation and preventing monopolies in agricultural sectors.  \nALDE endorses harmonizing Directive 98/44/EC with UPOV 1991 to safeguard breeders' freedom, effectively advancing their priority of maintaining Europe’s leadership in plant variety development.  \nALDE applauds the focus on SME protection, urging enhanced enforcement of Article 13(3)(b) to ensure small breeders retain unhindered access to genetic material for competitive innovation.  \nALDE proposes clarifying \"essentially biological processes\" in Article 4 through explicit examples (e.g., cross-breeding protocols) to prevent ambiguous patent claims while preserving biotech research incentives.  \nALDE urges immediate Commission action to codify EPO interpretation guidelines, ensuring alignment with food security goals and climate-resilient crop development priorities."
      }
    ],
    "resolution": "The European Parliament raised concerns that the European Patent Office’s (EPO) 2015 decisions on tomatoes (G2/12) and broccoli (G2/13) risked expanding patents on plants derived from conventional breeding methods, undermining prohibitions under Article 4 of Directive 98/44/EC and Article 53(b) of the European Patent Convention, which exclude products from essentially biological processes—such as crossing and selection—from patentability. It urgently called on the Commission to clarify the directive’s scope, particularly Articles 4, 12(3)(b), and 13(3)(b), to ensure legal certainty that such products, including plants, seeds, and genes, cannot be patented and to affirm breeders’ freedom to use patented biological material for further breeding. The resolution stressed the need to harmonize EU patent law with the UPOV Convention 1991 and Council Regulation (EC) No 2100/94, which safeguard breeders’ rights to reuse protected plant varieties, and urged the Commission to communicate these clarifications to the EPO as supplementary interpretation guidelines. Additionally, it demanded actions to guarantee access to biological material for breeding, prevent monopolies, promote SME opportunities, and pursue global patent law reforms to exclude biological processes. The Commission was further instructed to report on biotechnology patent developments under Article 16(c) of Directive 98/44/EC, ensuring alignment with food security, climate resilience, and innovation goals.",
    "total_score": 0.5690690690690691,
    "total_choice": 5,
    "party_num": 4,
    "id": 31,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.2,
      0.3,
      0.3,
      0.2
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "agriculture",
    "title": "Minimum standards for the protection of farm rabbits: REPORT on minimum standards for the protection of farm rabbits",
    "background": "The EU lacks specific legislation on farm rabbit welfare despite their status as the second most farmed livestock, documented health and mortality concerns by EFSA (2005), and existing standards for other species. Some member states have national regulations, while 99% of EU rabbit meat imports come from China. The Parliament will discuss establishing EU-wide minimum welfare standards for farm rabbits.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.1262135922330097,
        "choice": 1,
        "stance": "EPP absolutely challenges the issue as conflicting with subsidiarity principles, noting rabbit farming represents only 1.1% of EU meat production and lacks cross-border justification for Union-wide legislation.  \nEPP rejects the cage ban proposal for creating market distortions, warning it would accelerate reliance on Chinese imports (99% of external supplies) with lower welfare standards.  \nEPP highlights factual inaccuracies in promoting unvalidated alternative housing systems, citing unresolved health risks like coccidiosis transmission in group pens.  \nEPP condemns the issue's neglect of the sector's structural crisis, including 3.9% production decline and disproportionate impact on rural female employment.  \nEPP demands deletion of binding EU standards, advocating instead for voluntary guidelines aligned with EFSA assessments and national competence under Article 168 TFEU."
      },
      {
        "party_name": "ENF",
        "score": 0.2413793103448276,
        "choice": 2,
        "stance": "ENF explicitly opposes the issue’s reliance on centralized EU standards, which absolutely oppose with the party’s principle of national sovereignty over agricultural policy.  \nENF rejects the harmonization of import requirements for Chinese rabbit meat as insufficiently protective of EU producers, inconsistent with their trade autonomy priorities.  \nENF opposes the issue’s financial mechanisms for farm transitions, arguing it overlooks critical aspects of rural economic fragility by tying CAP funds to regulatory compliance.  \nThe proposal’s antibiotic reduction targets contradict ENF’s stance against bureaucratic overreach in veterinary practices, failing to address regional disease management realities.  \nENF condemns the labeling mandates under Regulation 1169/2011 as market interference, inconsistent with their advocacy for consumer choice without regulatory burdens."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.9574468085106383,
        "choice": 9,
        "stance": "GREEN_EFA absolutely approves the issue's mandate to eliminate battery cage systems, perfectly aligning with their campaign against intensive confinement in animal agriculture.  \nGREEN_EFA perfectly aligns with the call for binding EU-wide legislation on rabbit welfare, mirroring their 2019 manifesto pledge to extend species-specific protections beyond poultry and pigs.  \nGREEN_EFA absolutely approves harmonizing national standards to match Austria’s cage ban and Belgium’s 2025 phaseout, recognizing these as critical steps toward ethical farming practices.  \nGREEN_EFA strongly accepts the issue’s emphasis on enforcing import equivalence standards, reflecting their broader advocacy against substandard animal products from non-EU markets like China.  \nGREEN_EFA applauds the inclusion of rabbit meat in EU market monitoring and labeling reforms, advancing their transparency agenda under Regulation (EU) 1169/2011."
      },
      {
        "party_name": "ECR",
        "score": 0.7352941176470589,
        "choice": 7,
        "stance": "ECR strongly promotes the establishment of EU-wide minimum welfare standards for farm rabbits, aligning perfectly with ECR’s longstanding commitment to animal welfare and sustainable agricultural practices.  \nECR endorses harmonizing national rules to eliminate substandard cage systems, emphasizing the urgency of adopting enriched group pens as demonstrated in Austria and Belgium.  \nECR proposes enhancing financial support mechanisms under CAP to ensure small-scale farmers can transition to higher-welfare systems without disproportionate economic burden.  \nECR applauds the issue’s focus on enforcing import standards, which effectively advances ECR’s priority of protecting EU producers from unfair competition linked to lower-welfare imports.  \nECR emphasizes accelerating research into alternative housing designs and disease prevention to further reduce antibiotic reliance while maintaining rural employment stability."
      }
    ],
    "resolution": "The European Parliament raised concerns about the welfare of farmed rabbits in the EU, noting they are the second most farmed species with over 340 million slaughtered annually, yet lack specific EU legislation on minimum welfare standards. It highlighted issues in conventional battery cage systems, including inadequate space (less than two A4 sheets per rabbit), high mortality rates, diseases like coccidiosis, and stress from barren environments, as identified in EFSA’s 2005 opinion. The resolution emphasized the need for improved housing systems, such as group pens with enriched space (750–800 cm²/rabbit), access to fibrous diets, and platforms to mimic natural behavior, while acknowledging higher costs and potential market impacts. It urged the Commission to develop a roadmap for EU-wide welfare standards, including guidelines, research on health, housing, and humane stunning methods, and financial support for farmers transitioning to alternative systems. The Parliament stressed the importance of enforcing existing animal welfare directives (98/58/EC), harmonizing national rules (e.g., Austria’s cage ban, Belgium’s 2025 phaseout), and ensuring imported rabbit meat meets EU standards, given 99% of imports originate from China. It called for reduced antibiotic use to combat antimicrobial resistance, improved labeling under Regulation (EU) 1169/2011 for consumer transparency, and inclusion of rabbit meat in EU market monitoring. The resolution also noted the sector’s decline (3.9% production drop in 2016, 1.70 kg per capita consumption) and its socioeconomic role in rural employment, particularly for women, urging CAP support and dedicated research funding to address welfare, sustainability, and market challenges.",
    "total_score": 0.5584415584415584,
    "total_choice": 5,
    "party_num": 4,
    "id": 32,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.5,
      0.1,
      0.2,
      0.2
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "agriculture",
    "title": "Review of the implementation of the Dairy package: REPORT on prospects for the EU dairy sector – review of the implementation of the Dairy Package",
    "background": "The EU dairy sector faced market volatility, the 2015 milk quota abolition, and Russia's 2014 import ban, exacerbating price instability and production cost pressures, particularly in mountainous and outermost regions. The Parliament will discuss post-quota dairy sector sustainability and the Dairy Package's effectiveness in addressing market imbalances and structural challenges.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9362745098039216,
        "choice": 9,
        "stance": "EPP completely agrees the issue's emphasis on crisis management tools to stabilize dairy markets, perfectly aligning with its commitment to shield farmers from volatility caused by quota abolition and trade disruptions.  \nEPP perfectly aligns with the call to strengthen producer organizations' bargaining power through compulsory contracts, mirroring its longstanding advocacy for fair value distribution in agricultural supply chains.  \nEPP completely agrees targeted support for outermost regions like the Azores through enhanced POSEI funding, reflecting its priority to maintain EU agricultural cohesion across disadvantaged territories.  \nEPP perfectly aligns with demands to recalibrate intervention prices based on production costs, reinforcing its 2023 manifesto pledge for economically viable farming sectors.  \nEPP completely agrees leveraging PDO/PGI schemes to enhance market resilience, a strategy that advances its vision for quality-driven EU agri-food leadership."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.09090909090909091,
        "choice": 0,
        "stance": "GREEN_EFA rejects the issue's export-driven strategy as fully rejecting with their ecological transition principles, which demand localized food systems and reduced industrial overproduction.  \n\nGREEN_EFA opposes the failure to address animal welfare standards and the ecological imbalance favoring intensive dairy farming over sustainable mixed agriculture with plant-based alternatives.  \n\nGREEN_EFA condemns the issue's tolerance of price manipulation by processors and retailers, which perpetuates crisis conditions for small farmers in mountainous and remote regions like the Azores.  \n\nGREEN_EFA demands immediate supply management mechanisms rather than reactive liquidity aid, citing repeated milk dumping in Spain and Lithuania as proof of market deregulation's structural failures.  \n\nGREEN_EFA highlights the proposal's inconsistency with climate goals by promoting industrial-scale production instead of pasture-based systems that preserve biodiversity and soil health."
      },
      {
        "party_name": "ECR",
        "score": 0.8461538461538461,
        "choice": 8,
        "stance": "ECR strongly promotes the issue's emphasis on crisis management tools and market transparency to address dairy sector volatility, aligning with their commitment to empower farmers through informed decision-making.  \nECR approves enhancing the Milk Market Observatory's role while proposing streamlined bureaucratic measures to ensure producer organizations can effectively leverage EU support mechanisms.  \nECR endorses targeted rural development funding for disadvantaged regions like the Azores, urging equitable allocation of POSEI program resources to mitigate disproportionate impacts on Poland and other embargo-affected states.  \nECR advocates maintaining strict EU quality standards in trade agreements, particularly to protect PDO/PGI schemes such as Greek feta, as a strategic response to global market challenges.  \nECR emphasizes the need to expand risk-management tools like income insurance while ensuring CAP flexibility for member states to implement coupled payments and mountainous area subsidies."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.08888888888888889,
        "choice": 0,
        "stance": "GUE/NGL firmly againsts the issue's market-driven approach as it fails to implement mandatory production controls and cost-covering minimum prices, directly contradicting their demand for public milk policy reform.  \nGUE/NGL rejects reliance on voluntary producer organizations and crisis loans, citing Galician farmers' protests as evidence that such measures perpetuate below-cost pricing and debt cycles.  \nGUE/NGL condemns the refusal to reintroduce supply management quotas, which aligns with corporate agribusiness interests rather than protecting small farms from volatile global markets.  \nGUE/NGL highlights the issue's environmental negligence by omitting binding sustainability criteria for milk production volumes and industrial farming practices.  \nGUE/NGL demands full re-regulation of dairy markets through EU-wide production caps and price floors, consistent with their manifesto commitment to decommodify essential food sectors."
      }
    ],
    "resolution": "The European Parliament raised concerns about the sustainability and stability of the EU dairy sector following the 2015 abolition of milk quotas, emphasizing the need for crisis management tools to address price volatility exacerbated by the Russian embargo on EU dairy products, which caused significant market imbalances and farm-gate prices below production costs. It highlighted the disproportionate impact on disadvantaged regions, such as the Azores, where dairy farming constitutes 46% of the regional economy, and stressed the necessity of targeted support through rural development funds, the European Investment Bank’s financing mechanisms, and the POSEI program to maintain production in mountainous, outermost, and remote areas. The resolution criticized the underutilization of the 2012 Milk Package provisions, including compulsory contracts and producer organizations (POs), urging Member States to adopt these tools to strengthen farmers’ bargaining power and ensure fair value distribution in supply chains. It called for revising safety-net measures, such as raising intervention prices to reflect actual production costs, enhancing the Milk Market Observatory’s role in crisis prediction, and promoting PDO/PGI/TSG schemes to bolster market resilience. Additionally, the Parliament urged action against unfair trading practices, including retailer price manipulation, and advocated for risk-management tools like income insurance and margin protection programs. It emphasized the importance of maintaining EU quality standards in trade negotiations, expanding export markets, and leveraging innovation to develop high-value dairy products, while ensuring generational renewal and investment in sustainable practices.",
    "total_score": 0.6894502228826151,
    "total_choice": 6,
    "party_num": 4,
    "id": 33,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.1,
      0.5,
      0.1,
      0.3
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "agriculture",
    "title": "Technological solutions for sustainable agriculture: REPORT on technological solutions for sustainable agriculture in the EU",
    "background": "Global population growth projections, resource scarcity, climate impacts on agriculture, and existing EU research and rural development frameworks prompted scrutiny of agricultural sustainability challenges. The Parliament will discuss integrating technological innovations to address productivity, environmental pressures, and food security within EU farming systems while aligning with climate and biodiversity commitments.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.8905472636815921,
        "choice": 8,
        "stance": "EPP strongly upholds the integration of precision farming technologies and cross-sector collaboration, which aligns perfectly with EPP’s longstanding commitment to innovation-driven agricultural efficiency and resource optimization.  \nEPP approves the issue’s emphasis on equitable access to technologies for small farms and marginalized regions, effectively advancing EPP’s priority of inclusive rural development and competitiveness.  \nEPP endorses the call for science-based evaluation of novel breeding techniques like CRISPR, proposing enhanced risk-assessment protocols to strengthen precautionary safeguards without opposing innovation.  \nEPP applauds the focus on Horizon 2020-funded climate-smart practices and soil conservation, matching EPP’s 2023 manifesto goals for sustainable food systems and circular economy models.  \nEPP emphasizes the need to refine pesticide regulatory frameworks by prioritizing rigorous, independent evaluations of low-risk alternatives to ensure alignment with precautionary principles."
      },
      {
        "party_name": "EFDD",
        "score": 0.07692307692307693,
        "choice": 0,
        "stance": "EFDD rejects the issue's reliance on EU regulatory frameworks as totally rejecting with their demand for sovereignty post-Brexit, exemplified by criticism of CAP's financial imbalance and bureaucratic inefficiencies.  \nEFDD opposes the proposal’s emphasis on centralized EU research funding (e.g., Horizon 2020), which contradicts their stance against fiscal contributions to EU programs like the \"pre-accession agriculture funding to Turkey.\"  \nThe issue overlooks critical aspects such as deregulation for British farmers, directly conflicting with EFDD’s priority to eliminate EU \"red tape\" cited in the debate.  \nEFDD condemns the issue’s implicit endorsement of EU governance structures, inconsistent with their advocacy for national autonomy, as 59% of British farmers reportedly oppose continued EU membership.  \nThe proposal fails to address EFDD’s core objection to EU budgetary mechanisms, particularly the €1.7 billion annual deficit highlighted in CAP contributions versus returns."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.0,
        "choice": 0,
        "stance": "GREEN_EFA rejects the issue's promotion of deregulation and fast-tracked approvals for agricultural technologies, which entirely conflicts with their core principle that soil health requires stronger, legally binding protections against intensive farming practices.  \nGREEN_EFA opposes the reliance on precision farming and robotics as primary solutions, overlooking the financial inaccessibility for small farmers and perpetuating agri-business dominance inconsistent with equitable sustainability.  \nGREEN_EFA completely rejects the issue’s alignment with agri-business interests, which fails to address the systemic exploitation of farmers through high input costs and low-profit margins exacerbated by corporate-driven technological models.  \nGREEN_EFA rejects the report’s dismissal of stricter cross-compliance rules for soil conservation, directly contradicting their advocacy for enhanced regulatory frameworks to combat ecosystem degradation.  \nGREEN_EFA opposes the prioritization of genetic breeding innovations like CRISPR without stringent safeguards, ignoring precautionary principles central to GREEN_EFA’s stance on biodiversity and ecological resilience."
      },
      {
        "party_name": "ALDE",
        "score": 0.8983050847457628,
        "choice": 8,
        "stance": "ALDE strongly advocates the issue’s emphasis on precision farming technologies such as satellite data and drones, which align with ALDE’s commitment to innovation-driven sustainability and resource efficiency in agriculture.  \nALDE proposes amending Article 9 to explicitly prioritize reducing food waste by 50% by 2030, leveraging the FAO’s 33% waste statistic, as a complementary strategy to yield optimization.  \nALDE applauds the focus on genetic diversity and CRISPR innovations, which resonate with ALDE’s manifesto goals for science-based, resilient agricultural systems.  \nALDE urges enhancing Clause 6(b) to allocate dedicated Horizon 2020 funding for organic farming research, ensuring it complements—rather than competes with—precision agroecological practices.  \nALDE advocates revising the pesticide framework to include stricter CO2 emission benchmarks for supply chains, addressing delocalization concerns while maintaining competitiveness."
      }
    ],
    "resolution": "The European Parliament raised the urgent need to address global challenges such as population growth (projected to reach 9.6 billion by 2050), requiring a 60-110% increase in food production, alongside reducing food waste (currently one-third of food produced) and resource depletion. It emphasized sustainable agriculture through precision farming (PF) technologies, which could reduce water, pesticide, and fertilizer use by at least 15%, improve soil health, and optimize yields via GPS, drones, and data analytics. The resolution highlighted the critical role of genetic diversity in crops and livestock for resilience, advocating for conservation of genetic resources, including landraces and traditional varieties, and addressing regulatory barriers to breeding innovations like CRISPR and marker-assisted selection. It called for revising the EU’s pesticide regulatory framework to accelerate approvals of low-risk alternatives, address minor crop protection gaps (costing over €1 billion annually), and improve integrated pest management (IPM). The Parliament stressed the need for long-term research funding, skill development in rural areas, and knowledge transfer via initiatives like the European Innovation Partnership (EIP-AGRI). It urged leveraging Horizon 2020 and rural development funds for climate-smart practices, soil conservation, and circular economy models, while ensuring regulations balance innovation, scientific evidence, and precautionary principles. Additionally, it advocated for equitable access to technologies for small farms and marginalized regions, and emphasized the role of satellite data (e.g., ESA’s Sentinel 2B) in optimizing agricultural policies. The resolution underscored the importance of maintaining EU competitiveness through science-based regulation, public-private partnerships, and global cooperation in agricultural innovation.",
    "total_score": 0.621861152141802,
    "total_choice": 6,
    "party_num": 4,
    "id": 34,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.1,
      0.3,
      0.2,
      0.4
    ],
    "veto_party_name": "ALDE"
  },
  {
    "topic": "agriculture",
    "title": "The fruit and vegetables sector since the 2007 reform: REPORT on the fruit and vegetables sector since the 2007 reform",
    "background": "The EU's 2007 fruit and vegetable sector reform aimed to strengthen producer organizations, address market volatility, and promote competitiveness. Persistent challenges include uneven organization rates across member states, trade imbalances, third-country competition, and crises impacting producer viability. The Parliament will discuss post-reform sector performance and strategies to improve sustainability, market stability, and equitable trade practices.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9166666666666666,
        "choice": 9,
        "stance": "EPP totally advocates the issue’s emphasis on simplifying EU and national procedures for establishing producer organizations, which aligns perfectly with EPP’s longstanding commitment to reducing administrative burdens and empowering agricultural competitiveness.  \nEPP perfectly aligns with the issue’s call to increase financial support for new producer organizations, particularly in underorganized regions, as this directly advances EPP’s priority of modernizing small-scale farming and ensuring equitable access to EU benefits.  \nEPP totally advocates the urgent need to combat unfair trading practices and third-country tariff barriers, reflecting EPP’s unwavering focus on protecting EU producers from market distortions and ensuring reciprocity in trade standards.  \nEPP perfectly aligns with the issue’s demand for enhanced transnational cooperation and mergers among producer organizations, which effectively advances EPP’s vision of fostering resilient, market-driven agricultural networks across member states.  \nEPP totally advocates the streamlining of bureaucratic controls and audits for producer organizations, a measure that resonates with EPP’s strategic goal of minimizing regulatory friction while maintaining high environmental and quality standards."
      },
      {
        "party_name": "ALDE",
        "score": 0.9285714285714286,
        "choice": 9,
        "stance": "ALDE entirely upholds the issue’s prioritization of quality standards and protected geographical indications, aligning perfectly with ALDE’s commitment to enhancing the competitiveness and authenticity of EU agricultural products in global markets.  \nALDE perfectly aligns with the issue’s emphasis on youth inclusion in agriculture, recognizing it as vital for driving innovation and securing the future sustainability of the fruit and vegetables sector.  \nALDE fully supports the issue’s call to strengthen producer organizations as a vehicle for achieving market stability and environmental sustainability, which directly advances ALDE’s advocacy for collaborative, modernized agricultural practices.  \nALDE endorses the issue’s push for expanded school fruit schemes, seeing this as a strategic alignment with ALDE’s goals to improve dietary habits and foster early engagement with high-quality EU produce.  \nALDE perfectly aligns with the demand for reciprocity in trade standards, ensuring third-country products meet EU benchmarks, which reinforces ALDE’s vision of fair competition and protection of European agricultural heritage."
      },
      {
        "party_name": "ECR",
        "score": 0.8615384615384616,
        "choice": 8,
        "stance": "ECR strongly agrees the issue’s focus on strengthening producer organizations, aligning with their commitment to empower small-scale farmers against exploitative trade practices.  \nECR approves enhanced crisis management mechanisms, proposing expanded compensation for regions like Greece disproportionately impacted by geopolitical bans and extreme weather events.  \nECR endorses stricter enforcement of fair trading standards to protect farmers from middlemen exploitation, a core priority in safeguarding agricultural livelihoods.  \nECR highlights the urgency of restoring financial incentives for young farmers, directly advancing the issue’s goals for generational renewal in underorganized regions.  \nECR recommends amplifying export promotion tools to counter third-country tariff barriers, ensuring reciprocity in trade standards for EU producers."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.08888888888888889,
        "choice": 0,
        "stance": "GUE_NGL rejects the issue’s reliance on market-driven reforms, which perpetuate the dominance of multinational agribusiness over small-scale producers.  \nGUE_NGL opposes fundamentally the liberalization of the CAP, as it entrenches unfair trading practices and fails to dismantle the power of large distributors criticized in the debate.  \nThe proposal overlooks critical aspects such as binding measures to regulate corporate control of supply chains, a core GUE_NGL demand to protect farmers from exploitative market dynamics.  \nGUE_NGL condemns the issue’s inadequate crisis mechanisms, which prioritize superficial adjustments over systemic challenges to neoliberal agricultural policies.  \nThis approach absolutely condemns with GUE_NGL’s stance that food sovereignty requires dismantling, not reinforcing, market-centric frameworks that marginalize producer collectives."
      }
    ],
    "resolution": "The European Parliament raised concerns and recommendations regarding the EU fruit and vegetable (F&V) sector, emphasizing the critical role of producer organizations (POs) in enhancing competitiveness, market stability, and environmental sustainability. It noted that POs, which marketed 43% of EU F&V production in 2010 (up from 34% in 2004) and involved 16.5% of producers by 2010, remain underutilized in many Member States, particularly those with small-scale producers and low modernization. The resolution highlighted the sector’s economic significance, contributing €50 billion annually and employing 550,000 people, but flagged challenges such as declining EU production area (6% reduction from 2003–2010), falling per capita consumption (387g/day in 2012, an 8.7% drop from 2007–2011), and trade deficits exacerbated by third-country tariff barriers and uneven regulatory standards. It criticized insufficient crisis management tools, with only 2.8% of EU aid allocated to crisis prevention, and urged reforms to address unfair trading practices, simplify PO rules, and restore financial support for new POs, especially in underorganized regions. The Parliament called for stronger incentives for PO mergers, transnational cooperation, and youth inclusion (noting only 7.5% of EU farmers are under 35), alongside measures to boost exports, enforce reciprocity in trade standards, and expand school fruit schemes to improve dietary habits. Environmental goals, streamlined audits, and proportionality in penalties were stressed, alongside demands for urgent action to mitigate crises like the Russian import ban and invasive species threats. The resolution underscored the need for legal clarity, reduced administrative burdens, and enhanced crisis mechanisms, including mutual funds and withdrawal price adjustments, to stabilize producer incomes and ensure sector resilience.",
    "total_score": 0.8038632986627043,
    "total_choice": 8,
    "party_num": 4,
    "id": 35,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.1,
      0.3,
      0.5,
      0.1
    ],
    "veto_party_name": "ALDE"
  },
  {
    "topic": "agriculture",
    "title": "Unfair trading practices in business-to-business relationships in the food supply chain: REPORT on the proposal for a directive of the European Parliament and of the Council on unfair trading practices in business-to-business relationships in the food supply chain",
    "background": "Persistent power imbalances between small agricultural suppliers and large buyers in the EU food supply chain led to widespread unfair trading practices, including delayed payments and unilateral contract changes. Existing national regulations varied, creating market fragmentation. The Parliament will discuss establishing EU-wide rules to standardize protections against business-to-business unfair practices in the agricultural sector.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.6619718309859155,
        "choice": 6,
        "stance": "EPP supports the issue's ban on delayed payments and unilateral contract changes as crucial steps to stabilize farmer incomes while advising clearer guidelines for perishable goods handling timelines.  \nEPP endorses extending buyer definitions to non-EU operators but proposes amending Article 3 to mandate joint EU enforcement protocols to prevent jurisdictional loopholes.  \nEPP recommends revising the SME threshold criteria in Annex II to account for regional production disparities, ensuring equitable protection for smallholder-dominated markets.  \nEPP welcomes the 60-day complaint investigation framework but suggests adding whistleblower protections to encourage reporting from economically dependent suppliers.  \n While broadly approving the directive, EPP flags concerns about potential administrative burdens on national authorities and urges dedicated EU funding for enforcement capacity-building."
      },
      {
        "party_name": "ENF",
        "score": 0.6470588235294118,
        "choice": 6,
        "stance": "ENF supports the directive's expansion to non-EU buyers and collective complaint mechanisms as vital steps to address power imbalances in agricultural markets.  \nENF advises strengthening Article 4 to explicitly shield national enforcement systems like the UK Groceries Code Adjudicator from ECJ interference post-Brexit.  \nENF endorses the 60-day payment terms but proposes amending Recital 12 to include penalties for buyers circumventing rules through third-country subsidiaries.  \nENF highlights concerns that the issue’s effectiveness may be undermined by ongoing EU trade agreements allowing non-compliant agricultural imports.  \nENF recommends adding a clause requiring compatibility checks between future trade deals and UTP prevention measures in Article 9(3)."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.09615384615384616,
        "choice": 0,
        "stance": "GREEN_EFA rejects the issue's failure to address upstream market concentration in agrochemical and seed industries, directly contradicting their anti-monopoly principles.  \nGREEN_EFA fully doubts the exclusion of competition law reforms from UTP measures, as seen in unchecked mergers like Bayer-Monsanto that harm farmer incomes.  \nGREEN_EFA condemns the proposal's silence on evaluating mergers for climate/environmental impacts, a core GREEN_EFA manifesto requirement since 2019.  \nGREEN_EFA highlights the issue's structural inadequacy in tackling power imbalances beyond retailers, ignoring input-sector oligopolies in fertilizers/pesticides.  \nGREEN_EFA declares the directive incompatible with fair income guarantees for farmers due to omitted safeguards against input-cost inflation from dominant suppliers."
      },
      {
        "party_name": "SD",
        "score": 0.7486631016042781,
        "choice": 7,
        "stance": "SD strongly advocates the expanded scope covering all agricultural products and non-EU buyers, aligning with their commitment to eliminating power imbalances in cross-border supply chains.  \nSD approves the 60-day payment terms and perishable goods cancellation safeguards as critical advancements in protecting small producers from retailer exploitation.  \nSD highlights the anonymous complaint system as transformative for supplier confidentiality, proposing enhanced cross-border enforcement coordination between national authorities to prevent jurisdictional loopholes.  \nSD emphasizes the mandatory annual member state reporting requirements as pivotal for ensuring accountability, urging rigorous monitoring of pricing transparency mechanisms.  \nSD welcomes the directive’s collective complaint provisions through producer associations, advancing their priority of empowering collective bargaining against concentrated retail power."
      }
    ],
    "resolution": "The European Parliament raised concerns about unfair trading practices (UTPs) in the agricultural supply chain and proposed measures to strengthen protections for suppliers, including extending the scope of the directive to cover all agricultural products (not just food) and suppliers beyond SMEs, such as farmers’ organizations, to prevent trade diversion. It expanded the definition of \"buyer\" to include operators outside the EU active in the EU market, aiming to close loopholes, and introduced definitions for \"unfair trading practices\" (based on economic dependence) and \"economic dependence\" to clarify power imbalances. Key provisions included a 60-day payment term for non-perishable products, aligning with existing late payment rules, and a 60-day notice period for cancellations of perishable goods orders. Enforcement mechanisms required authorities to investigate complaints within 60 days and conclude within 6 months (extendable to 14 months in complex cases), mandate termination of prohibited practices, and allow mediation. The resolution also mandated written contracts upon supplier request, permitted collective complaints via representative associations, and required annual member state reports evaluating the effectiveness of anti-UTP measures. Exemptions were introduced for contributions to producer organizations and quality-related inter-branch agreements.",
    "total_score": 0.5799457994579946,
    "total_choice": 5,
    "party_num": 4,
    "id": 36,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.5,
      0.1,
      0.1,
      0.3
    ],
    "veto_party_name": "ENF"
  },
  {
    "topic": "agriculture",
    "title": "EU action plan for organic agriculture: REPORT on an EU action plan for organic agriculture | A9-0126/2022 | European Parliament",
    "background": "The EU's sustainability agenda, including the European Green Deal and Farm to Fork Strategy, prioritized transitioning to sustainable food systems. Organic farming accounted for 8.5% of EU agricultural land in 2019, with market growth and regional disparities. The Parliament will discuss the EU organic action plan's alignment with climate, biodiversity, and agricultural sustainability objectives.",
    "stances": [
      {
        "party_name": "SD",
        "score": 0.903448275862069,
        "choice": 9,
        "stance": "SD completely upholds the issue’s market-aligned expansion of organic farming, perfectly aligning with SD’s commitment to bridging regional disparities through CAP-funded conversion support and harmonized certification standards.  \nSD fully supports the strict enforcement of Regulation (EU) 2018/848 to prevent substandard imports, reflecting SD’s unwavering demand for parity in environmental, social, and economic sustainability criteria for all organic products.  \nSD perfectly aligns with the issue’s emphasis on equitable value distribution and fair pricing mechanisms, advancing SD’s priority to protect small-scale farmers while ensuring consumer affordability.  \nSD completely upholds the integration of digital traceability tools and local supply chain development, effectively advancing SD’s vision of reducing administrative burdens while strengthening producer-consumer trust.  \nSD fully supports the call for pan-EU research into organic seeds and biocontrol solutions, which aligns perfectly with SD’s manifesto goals to eliminate synthetic pesticide dependency by 2050 through innovation-driven transitions."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.8873239436619719,
        "choice": 8,
        "stance": "GREEN_EFA strongly endorses the binding 25% organic farmland target by 2030 as a critical step to reduce fossil fuel dependency in agriculture, aligning perfectly with their climate resilience agenda.  \nGREEN_EFA approves the issue’s emphasis on legume cultivation and organic seed research, noting this mirrors their 2022 manifesto priorities for protein autonomy and agroecological innovation.  \nGREEN_EFA proposes strengthening import controls under Regulation 2018/848 by explicitly requiring GMO contamination testing, ensuring organic integrity matches consumer expectations.  \nGREEN_EFA applauds the focus on public procurement targets for schools and municipalities, which directly advances their decade-long campaign for institutional food system transitions.  \nGREEN_EFA endorses using organic animal welfare standards as the baseline for EU-wide legislation, a position consistently advocated in their Farm Animal Rights Charter."
      },
      {
        "party_name": "ECR",
        "score": 0.8125,
        "choice": 8,
        "stance": "ECR strongly upholds the issue’s market-driven approach to organic expansion, aligning perfectly with ECR’s commitment to economically sustainable agriculture and rejection of rigid top-down targets.  \nECR approves the emphasis on financial incentives for farmers during conversion, effectively advancing ECR’s priority of ensuring fair profitability while transitioning to organic practices.  \nECR highlights the need to integrate food security considerations into implementation, proposing enhanced flexibility for Member States to adapt timelines amid geopolitical disruptions like the Ukraine war.  \nECR endorses the issue’s call for scientific impact assessments and reduced bureaucracy, which aligns with ECR’s demand for evidence-based policymaking and streamlined regulations.  \nECR strongly upholds harmonizing trade standards for third-country imports, ensuring a level playing field for EU farmers and advancing fair global competition."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.9230769230769231,
        "choice": 9,
        "stance": "GUE_NGL firmly supports the issue’s binding 25% organic farmland target as a critical step to dismantle industrial agriculture’s ecological destruction, perfectly aligning with their manifesto for climate justice.  \nGUE_NGL perfectly aligns with the demand to eliminate synthetic pesticides and mandate EU-wide animal welfare benchmarks, ensuring food production respects planetary boundaries and consumer transparency.  \nGUE_NGL fully supports abolishing CAP subsidies for intensive farming and redirecting funds to guarantee fair prices for organic smallholders during conversion, eradicating corporate agribusiness dominance.  \nGUE_NGL champions the issue’s emphasis on short-supply chains and seed sovereignty, which directly advance their vision of democratized food systems free from speculative market pressures.  \nGUE_NGL endorses strict bans on greenwashed imports like non-compliant “bio salt,” urging fortified traceability protocols to match their anti-neoliberal trade principles."
      }
    ],
    "resolution": "The European Parliament raised the importance of expanding organic farming to achieve climate, biodiversity, and sustainability goals under the European Green Deal, Farm to Fork, and Biodiversity strategies. It highlighted that organic farmland in the EU reached 13.8 million hectares (8.5% of total agricultural land) by 2019, with retail sales surging from €18 billion to €41 billion between 2009-2019, though disparities exist among Member States (0.5% to 26.5% organic land use). The resolution stressed the need to align organic production growth with market demand, support farmers during the costly three-year conversion period, and ensure fair prices and CAP funding, including eco-schemes, to incentivize transitions. It called for stricter controls under Regulation (EU) 2018/848 to boost consumer trust, harmonize certification, prevent fraudulent imports, and expand the EU organic logo’s visibility. The Parliament emphasized reducing administrative burdens, promoting local supply chains, and leveraging digital tools for traceability. It urged research into organic seeds, biocontrol solutions, and protein crops to reduce import dependency, while advocating for equitable value distribution in supply chains and addressing affordability barriers. The resolution also highlighted organic farming’s environmental benefits, including 30% higher biodiversity, reduced synthetic inputs, and climate resilience, and urged Member States to develop ambitious national organic action plans aligned with CAP Strategic Plans.",
    "total_score": 0.8666666666666667,
    "total_choice": 8,
    "party_num": 4,
    "id": 37,
    "parliament_terms": "9th_datas",
    "seat_weights": [
      0.2,
      0.3,
      0.1,
      0.4
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "agriculture",
    "title": "European Citizens' Initiative \"End the cage age\": MOTION FOR A RESOLUTION on the European Citizens’ Initiative ‘End the cage age’ | B9-0296/2021 | European Parliament",
    "background": "A European Citizens’ Initiative advocating an end to caged animal farming, supported by 1.4 million validated signatures across all EU member states, highlighted existing EU animal welfare legislation and scientific assessments on farming practices. The Parliament will discuss the phase-out of cage systems in EU animal farming.",
    "stances": [
      {
        "party_name": "SD",
        "score": 0.9379310344827586,
        "choice": 9,
        "stance": "SD totally approves the binding 2027 phase-out deadline for all cage systems, perfectly aligning with Maria Noichl's demand for decisive legislative action to end \"Käfighaltung\" across EU animal farming.  \nSD perfectly aligns with Eric Andrieu's call for WTO rule modernization to ensure imported animal products meet EU welfare standards, reinforcing the issue's trade alignment provisions.  \nSD totally approves leveraging CAP funds for farmer transitions, mirroring Leszek Miller's emphasis on essential financial support to achieve ethical husbandry without economic harm.  \nSD perfectly aligns with Jytte Guteland's ethical imperative by championing the issue's species-specific bans and shift toward organic systems as \"steg på vägen för att återvinna vår medmänskligheit\".  \nSD totally approves Pedro Silva Pereira's democratic validation of the 1.4 million-signature initiative, cementing the issue as exemplary participatory policymaking."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.9859154929577465,
        "choice": 9,
        "stance": "GREEN_EFA totally approves the issue's binding 2027 phase-out deadline, perfectly aligning with their decades-long advocacy for ending industrial animal confinement through proven organic alternatives.  \nGREEN_EFA perfectly aligns with demands for mirror clauses on imported animal products, emphasizing that global leadership requires eliminating unfair competition from substandard third-country practices.  \nGREEN_EFA totally approves the recognition of animal sentience as a legislative cornerstone, affirming that cage abolition simultaneously advances ethical food systems and prevents antimicrobial resistance crises.  \nGREEN_EFA strongly upholds redirecting CAP subsidies to fund full transitions to free-range systems, noting this aligns with their 2024 policy framework for climate-resilient agroecology.  \nGREEN_EFA totally approves applying cage bans to all species without exception, asserting that continued confinement of rabbits, ducks, and geese violates the ECI's democratic mandate and scientific consensus."
      },
      {
        "party_name": "ECR",
        "score": 0.578125,
        "choice": 5,
        "stance": "ECR supports the initiative’s objectives but advises postponing the 2027 phase-out deadline until after the 2023 scientific assessment to ensure evidence-based adjustments.  \nECR proposes augmenting CAP funding to fully offset farmers’ transition costs, including land expansion and labor demands for cage-free systems.  \nECR stresses that equivalent animal welfare standards must be legally enforced on all imports to prevent market distortion by third-country producers.  \nECR recommends maintaining compliant cage systems for species without validated alternatives until peer-reviewed studies confirm cage-free biosecurity.  \nECR highlights the need for consumer awareness campaigns to justify potential price increases linked to higher welfare standards.  "
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.9487179487179487,
        "choice": 9,
        "stance": "GUE_NGL totally accepts the issue’s demand to eradicate caged farming by 2027, as this aligns perfectly with their unwavering advocacy for animal rights and ecological justice.  \nGUE_NGL perfectly aligns with the call to leverage CAP funds to support farmers transitioning to cage-free systems, ensuring social equity in agricultural reforms.  \nGUE_NGL emphasizes that strict enforcement of EU welfare standards on imports is critical to prevent undermining ethical producers, reflecting their anti-exploitation principles.  \nGUE_NGL celebrates the issue’s recognition of the 1.4 million citizens’ voices, mirroring their commitment to participatory democracy and grassroots-driven policymaking.  \nGUE_NGL underscores the urgency to align trade agreements with cage-free standards, advancing their vision of a globalized economy rooted in sustainability and compassion."
      }
    ],
    "resolution": "The European Parliament raised concerns over the widespread use of cages in EU animal farming, citing data that over 300 million farmed animals, including 85% of rabbits in barren cages and 50% of laying hens in enriched cages, endure inadequate welfare conditions. It emphasized the need to phase out cages by 2027 through revised legislation, starting with a revision of Directive 98/58/EC, supported by species-specific approaches, scientific impact assessments, and transition periods to address economic and sanitary challenges. The resolution highlighted the success of the 'End the Cage Age' European Citizens’ Initiative, which garnered 1.4 million signatures, and urged financial support for farmers, including CAP funds and market incentives, to offset higher production costs and prevent market displacement. It called for strict enforcement of EU animal welfare standards on imports, alignment of trade agreements with these standards, and development of cage-free systems such as free-range and organic farming. The Parliament noted progress in some Member States banning cages beyond EU minima and stressed the need for uniform legislation to ensure fair competition, while promoting consumer education, voluntary labeling, and international advocacy for animal welfare.",
    "total_score": 0.7926136363636364,
    "total_choice": 7,
    "party_num": 4,
    "id": 38,
    "parliament_terms": "9th_datas",
    "seat_weights": [
      0.1,
      0.1,
      0.1,
      0.7
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "agriculture",
    "title": "Implementation report on on-farm animal welfare: REPORT Implementation report on on-farm animal welfare | A9-0296/2021 | European Parliament",
    "background": "EU directives on farm animal welfare, established between 1998-2008, faced challenges in harmonized implementation across member states due to varying compliance approaches. Scientific advancements and evolving farming practices highlighted gaps, while voluntary private labeling systems lacked standardization. The Parliament will discuss evaluating and updating EU on-farm animal welfare legislation to address enforcement consistency and regulatory modernization.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.8863636363636364,
        "choice": 8,
        "stance": "EPP strongly sanctions the issue’s emphasis on science-based legislative updates to harmonize animal welfare standards, aligning with their commitment to practical, evidence-driven agricultural policies.  \nEPP endorses the phased ban on caged hens by 2027 as a balanced approach that respects farmers’ adaptation timelines while advancing welfare goals.  \nEPP proposes enhancing financial mechanisms beyond CAP to support small farms in meeting new standards, ensuring equitable implementation across all member states.  \nEPP approves reciprocity measures for imports to protect EU farmers, urging strict enforcement of equivalent third-country welfare standards to prevent market distortion.  \nEPP advocates for voluntary labeling frameworks that incentivize farmers through market rewards rather than mandatory systems, aligning with their market-flexibility principles."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.04225352112676056,
        "choice": 0,
        "stance": "GREEN_EFA fully rejects the issue's failure to mandate EU-wide animal welfare labeling, contradicting their demand for transparent consumer information on ethical practices.  \nGREEN_EFA rejects the report's claim that foie gras production respects animal welfare, denouncing it as scientifically indefensible and incompatible with cruelty-free standards.  \nGREEN_EFA opposes the prioritization of livestock sector competitiveness over binding welfare improvements, highlighting its conflict with Green Deal commitments to sustainable food systems.  \nGREEN_EFA condemns the issue's refusal to acknowledge reduced meat consumption as essential, directly contradicting climate action and animal protection goals in their manifesto.  \nGREEN_EFA opposes the alignment with industrial farming interests, particularly the dismissal of cage-free systems and species-specific welfare upgrades as \"excessive\" burdens."
      },
      {
        "party_name": "ECR",
        "score": 0.875,
        "choice": 8,
        "stance": "ECR strongly endorses the issue’s emphasis on financial incentives for farmers to improve animal welfare, aligning with their advocacy for market-driven solutions over rigid mandates.  \nECR approves the call for strict alignment of trade agreements with EU welfare standards, urging enhanced import controls to ensure fair competition for European producers.  \nECR proposes maintaining voluntary animal welfare labeling systems to preserve market flexibility while enhancing consumer clarity, framing this as an enhancement to harmonize existing initiatives.  \nECR endorses the focus on short supply chains and local production as pragmatic measures to improve welfare outcomes without overburdening farmers with structural changes.  \n While supporting the issue’s core objectives, ECR suggests revising the endorsement of cage-free farming systems to prioritize phased, science-based transitions over abrupt bans."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.05128205128205128,
        "choice": 0,
        "stance": "GUE_NGL rejects the issue's lenient stance toward agroindustrial practices, which firmly rejects with their commitment to ending systemic animal suffering exposed by EU inspections.  \nGUE_NGL opposes the report's failure to prioritize scientific evidence in welfare standards, overlooking critical aspects such as species-specific needs and binding enforcement mechanisms.  \nGUE_NGL condemns the issue's omission of support for small-scale extensive farming, inconsistent with their principles of rural development and fair competition against industrial macrogranjas.  \nGUE_NGL disputes the report's alleged objectivity, noting its agricultural industry alignment creates inherent bias against transformative welfare reforms demanded by the \"Farm to Fork\" strategy.  \nGUE_NGL challenges the issue's silence on environmental degradation from intensive farming, contradicting their ecological mandate to link animal welfare with pollution reduction."
      }
    ],
    "resolution": "The European Parliament raised concerns about the inconsistent implementation of EU animal welfare legislation for food-producing animals, including Directives 98/58/EC (general farming), 1999/74/EC (laying hens), 2007/43/EC (broiler chickens), 2008/119/EC (calves), and 2008/120/EC (pigs). While directives on pigs, calves, and laying hens spurred positive structural changes, the general and broiler directives had limited impact due to vague requirements, insufficient monitoring, and excessive member state discretion, leading to uneven enforcement. The resolution highlighted gaps in data quality and consistency, obstructing a clear assessment of on-farm conditions. It urged the Commission to update legislation by incorporating scientific advances and technical progress, emphasizing clarity, detail, and uniform interpretation rather than stricter rules. Additionally, the Parliament noted the absence of consensus on mandatory EU-wide animal welfare labeling, as existing voluntary private systems vary widely and blend welfare with traceability or sustainability. It called for pragmatic labeling frameworks that balance market flexibility and stakeholder input, stressing the need to distinguish between legislative objectives (often overly broad) and practical measures, many of which are already implemented. Future revisions must involve farmers, national authorities, and the Parliament to align rules with realistic farming and commercial practices.",
    "total_score": 0.7035460992907802,
    "total_choice": 7,
    "party_num": 4,
    "id": 39,
    "parliament_terms": "9th_datas",
    "seat_weights": [
      0.3,
      0.1,
      0.5,
      0.1
    ],
    "veto_party_name": "GUE_NGL"
  }
]