[
  {
    "topic": "regional development",
    "title": "Eligibility of housing interventions in favour of marginalised communities: REPORT on the proposal for a regulation (EC) No .../2009 of the European Parliament and of the Council amending Regulation (EC) No 1080/2006 on the European Regional Development Fund as regards the eligibility of housing interventions in favour of marginalised communities",
    "background": "Persistent inadequate housing conditions among marginalized communities, particularly Roma populations in EU-12 rural areas, and disparities in ERDF eligibility criteria limiting interventions to urban regions prompted calls for regulatory alignment. The Parliament will discuss expanding ERDF-funded housing initiatives to all EU states, including rural areas, to address social exclusion through structural fund accessibility.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9157088122605364,
        "choice": 9,
        "stance": "EPP entirely promotes the expanded ERDF eligibility as perfectly aligning with their commitment to cohesive regional development and marginalized community integration.  \nEPP perfectly supports extending housing interventions to both urban and rural areas, emphasizing this matches their manifesto priority on eradicating territorial disparities in new Member States.  \nEPP proposes strengthening Article 47 criteria oversight to ensure funds target genuine marginalization hotspots while maintaining full alignment with the issue’s social inclusion objectives.  \nEPP applauds the issue’s recognition of Roma communities as a critical beneficiary group, viewing this as exemplary implementation of their cross-border solidarity principles.  \nEPP highlights the need for future reviews of Structural Fund criteria to maintain relevance to economic crises, framing this as an enhancement opportunity rather than opposition."
      },
      {
        "party_name": "EFD",
        "score": 0.16129032258064516,
        "choice": 1,
        "stance": "EFD rejects the expansion of ERDF eligibility to all Member States as completely challengeing with national sovereignty over immigration and housing policy.  \nEFD opposes housing interventions that disregard British public opposition to EU-driven population growth, citing unresolved tensions from uncontrolled migration.  \nThe proposal overlooks critical aspects of local democratic control by enabling non-statutory bodies like the South-West Leaders’ Council to override community planning objections.  \nEFD condemns the issue’s alignment with policies facilitating mass immigration, directly contradicting their principle of strict visa/permit-based population management.  \nThis framework completely challenges with EFD’s demand for national autonomy in addressing housing needs without EU-imposed demographic pressures."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.9090909090909091,
        "choice": 9,
        "stance": "GREEN_EFA totally upholds the expanded ERDF eligibility for housing interventions as a landmark achievement in combating social exclusion, perfectly aligning with their manifesto commitment to dignified living conditions for Roma and all marginalized communities.  \nGREEN_EFA applauds the issue’s focus on energy poverty reduction and urban regeneration, recognizing its strategic synergy with the 2010 European Year Against Poverty and their climate justice priorities.  \nGREEN_EFA emphasizes the critical need for vigilance in fund allocation to prevent gentrification, proposing enhanced monitoring mechanisms to ensure renovations prioritize community retention over speculative gains.  \nGREEN_EFA perfectly aligns with the mandate for post-2013 evaluations, urging explicit metrics on resident displacement rates and access to education/health services to solidify long-term social inclusion outcomes.  \nGREEN_EFA reinforces the imperative for binding transparency criteria in future regulations to guarantee that vulnerable populations directly benefit from housing investments without bureaucratic barriers."
      },
      {
        "party_name": "ECR",
        "score": 0.3888888888888889,
        "choice": 3,
        "stance": "ECR partially endorses the housing intervention expansion but emphasizes that physical infrastructure alone cannot resolve systemic marginalization, requiring amendment to integrate social support mechanisms.  \nECR requests revisions to Article 2 provisions, mandating parallel investments in employment programs and youth outreach services alongside building renovations.  \nThe proposal firmly condemns with ECR's principle that sustainable community development requires simultaneous economic empowerment and environmental improvements.  \nECR objects to the current text's omission of accountability measures ensuring local authorities combine housing upgrades with anti-poverty initiatives.  \nThis framework overlooks critical aspects of social integration, necessitating binding clauses for member states to allocate 30% of ERDF housing funds to on-site welfare services."
      }
    ],
    "resolution": "The European Parliament raised its approval of the amended Commission proposal (COM(2009)0382) concerning measures under Article 251(2) and Article 162 of the EC Treaty, emphasizing the need to align regional development policies with EU objectives. It mandated the Commission to resubmit the proposal to Parliament if substantial revisions or replacements were planned, ensuring legislative oversight. The resolution further directed the Parliament’s President to formally communicate its adopted position to the Council and the Commission, reinforcing procedural continuity and institutional cooperation in implementing the amended framework.",
    "total_score": 0.8,
    "total_choice": 8,
    "party_num": 4,
    "id": 0,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.2,
      0.2,
      0.5,
      0.1
    ],
    "veto_party_name": "EFD"
  },
  {
    "topic": "regional development",
    "title": "Cohesion Fund: REPORT on the proposal for a regulation of the European Parliament and of the Council on the Cohesion Fund and repealing Council Regulation (EC) No 1084/2006",
    "background": "The Cohesion Fund, established under 2006 regulations, faced reforms to align with post-2013 EU priorities amid economic crises, regional disparities, and demands for strategic investment in growth, sustainability, and social inclusion. The Parliament will discuss updating the Fund’s governance, funding allocation mechanisms, and integration with broader EU economic and territorial cohesion objectives.",
    "stances": [
      {
        "party_name": "EFD",
        "score": 0.22580645161290322,
        "choice": 2,
        "stance": "EFD rejects the Cohesion Fund's current structure for failing to address systemic inefficiencies and misallocation of resources, as evidenced by stagnant unemployment rates in Southern Italy despite previous funding.  \nEFD opposes the prioritization of specific demographic groups in funding allocation, arguing this creates unequal treatment among EU citizens and diverts resources from broader economic needs.  \nEFD fundamentally disapproves with the issue's reliance on EU-level financial mechanisms, citing Italy's disproportionate net contributions and lack of tangible benefits for national economies.  \nEFD highlights the proposal's failure to ensure transparent and accountable use of funds, referencing documented cases of corruption in member states like Bulgaria.  \nEFD criticizes the diversion of cohesion resources to large-scale infrastructure projects, which undermines the principle of reducing regional disparities through localized investments."
      },
      {
        "party_name": "ALDE",
        "score": 0.9518072289156626,
        "choice": 9,
        "stance": "ALDE completely approves the cohesion policy compromise as a strategic alignment with EU structural investment priorities, particularly its focus on macroeconomic conditionality and balanced fund allocation.  \nALDE perfectly aligns with the issue's emphasis on SME support through European Investment Bank mechanisms, advocating for maintained funding levels to ensure entrepreneurship-driven regional growth.  \nALDE emphasizes the Danube Strategy’s critical role in territorial cohesion, urging enhanced cross-border program implementation to address disparities in underdeveloped regions.  \nALDE highlights the necessity of performance-based fund distribution, fully supporting the 50% sanction mechanism as a tool to enforce fiscal discipline and growth-oriented reforms.  \nALDE proposes procedural enhancements to ensure SME-focused amendments receive prioritized consideration, reinforcing Parliament’s role in safeguarding economic recovery drivers."
      },
      {
        "party_name": "SD",
        "score": 0.9076923076923077,
        "choice": 9,
        "stance": "SD fully promotes the Cohesion Fund's strategic alignment with Europe 2020 goals, particularly its reinforced focus on youth employment and poverty reduction through mandatory ESF allocations, which perfectly advances SD's social equity priorities.  \nSD highlights the critical enhancement of regional partnership principles, urging strengthened implementation frameworks to ensure local authorities' meaningful participation in program design as voiced by stakeholders.  \nSD applauds the modernization of investment priorities to include clean energy and digital infrastructure, reflecting their manifesto commitment to sustainable territorial cohesion and climate action.  \nSD emphasizes the necessity of maintaining elevated co-financing rates for outermost regions, proposing further simplification of administrative procedures to accelerate fund absorption while fully supporting the regulation's core objectives.  \nSD underscores the importance of monitoring macroeconomic conditionality's social impacts, advocating for robust safeguards to prevent double penalization of vulnerable regions during austerity measures."
      },
      {
        "party_name": "ECR",
        "score": 0.5087719298245614,
        "choice": 5,
        "stance": "ECR supports the Cohesion Fund's focus on economic convergence in transition regions like Northern Ireland and Wales, emphasizing the need for effective fund utilization to address regional disparities.  \nECR expresses concern that macroeconomic conditionality clauses risk penalizing fund recipients for national fiscal policies beyond their control, urging amendments to safeguard cohesion principles.  \nECR advises strengthening audit mechanisms in Articles 15-18 to prevent misallocation of funds to large corporations, ensuring strict adherence to SME support priorities.  \nECR endorses the results-oriented approach for structural investments, particularly in West Wales and the Valleys, to maximize economic productivity during implementation.  \nECR requests enhanced transparency provisions requiring quarterly disclosure of member states' implementation structures to facilitate cross-border learning and best practice adoption.  "
      }
    ],
    "resolution": "The European Parliament raised its position on a Commission proposal (COM(2011)0612) concerning measures under Article 177 of the Treaty on the Functioning of the European Union, aimed at fostering economic, social, and territorial cohesion. It endorsed the Committee on Regional Development’s report and integrated opinions from multiple committees, including Budgets, Environment, Industry, and Transport, reflecting cross-sectoral priorities. The resolution emphasized adopting Parliament’s first-reading stance while urging the Commission to re-engage Parliament if proposing substantial amendments or alternative texts. It further instructed the President to formally transmit Parliament’s position to the Council, Commission, and national parliaments, ensuring alignment with EU legislative procedures and reinforcing interinstitutional accountability.",
    "total_score": 0.8054830287206266,
    "total_choice": 8,
    "party_num": 4,
    "id": 1,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.1,
      0.4,
      0.3,
      0.2
    ],
    "veto_party_name": "ALDE"
  },
  {
    "topic": "regional development",
    "title": "Common provisions on European funds: REPORT on the amended proposal for a regulation of the European Parliament and of the Council laying down common provisions on the European Regional Development Fund, the European Social Fund, the Cohesion Fund, the European Agricultural Fund for Rural Development and the European Maritime and Fisheries Fund covered by the Common Strategic Framework and laying down general provisions on the European Regional Development Fund, the European Social Fund and the Cohesion Fund and repealing Council Regulation (EC) No 1083/2006",
    "background": "The European Commission proposed amendments to regulations governing EU structural and investment funds (2011-2013), seeking to harmonize management under a Common Strategic Framework and repeal the 2006 framework. The Parliament will discuss the legislative framework for cohesion policy and fund provisions to align with EU strategic priorities for 2014-2020.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.8248175182481752,
        "choice": 8,
        "stance": "EPP strongly accepts the cohesion policy's focus on smart growth and job creation through targeted investments in SMEs and infrastructure, aligning with their economic development priorities.  \nEPP endorses the enhanced territorial cooperation provisions as critical for border regions' economic integration and cross-border project success.  \nEPP applauds the creation of transition regions as a mechanism for equitable fund distribution while maintaining support for less-developed areas.  \nEPP proposes further refinement of macroeconomic conditionality rules to prevent disproportionate impacts on economically vulnerable member states .  \nEPP emphasizes the need for streamlined fund implementation procedures to maximize absorption rates and accelerate job creation programs.  \n\nThis aligns perfectly with EPP's longstanding commitment to regional parity and EU-wide economic convergence. The issue effectively advances EPP's priority of leveraging structural funds for innovation-driven growth."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.034482758620689655,
        "choice": 0,
        "stance": "GREEN_EFA rejects fundamentally the macroeconomic conditionality clause that subordinates cohesion funding to national deficit rules, as this directly contradicts their principle of European solidarity.  \nGREEN_EFA opposes Article 21 and Recital 19 for institutionalizing austerity-driven sanctions that punish regions for member states’ fiscal policies, violating territorial cohesion commitments.  \nGREEN_EFA condemns the issue’s alignment with Stability Pact mechanisms, which destabilize long-term investments in renewable energy and social inclusion programs during economic crises.  \nGREEN_EFA highlights that conditioning funds on macroeconomic criteria overlooks critical environmental safeguards and disproportionately harms regions transitioning to low-carbon economies.  \nGREEN_EFA demands removal of Amendment 488 to prevent cohesion policy from becoming an enforcement tool for austerity, contrary to their manifesto’s anti-poverty and climate justice priorities."
      },
      {
        "party_name": "ALDE",
        "score": 0.891566265060241,
        "choice": 8,
        "stance": "ALDE strongly upholds the compromise maintaining the 23.1% ESF allocation, aligning with their commitment to balanced regional development and SME protection as economic growth drivers.  \nALDE totally upholds macroeconomic conditionality mechanisms tied to employment and GDP metrics, recognizing their alignment with fiscal responsibility principles in the Group's agenda.  \nALDE proposes enhancing Danube Strategy implementation through dedicated territorial cooperation instruments and clearer funding pathways to address regional disparities in line with Europe 2020 goals.  \nALDE approves performance reserve allocations and advance payment structures as tools to optimize cohesion policy effectiveness while safeguarding budgetary discipline.  \nALDE urges reinforced SME financing mechanisms through restored EIB funding thresholds, emphasizing their critical role in overcoming economic crises."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.02857142857142857,
        "choice": 0,
        "stance": "GUE/NGL rejects the macroeconomic conditionality clauses as fundamentally incompatible with solidarity principles, maintaining that austerity-linked fund suspensions punish vulnerable populations.  \nGUE/NGL opposes the prioritization of private infrastructure investments and PPPs, which redirect public funds toward corporate interests rather than social housing or healthcare needs.  \nGUE/NGL condemns the issue’s failure to mandate poverty eradication programs, noting its shift toward employability metrics over concrete anti-homelessness measures.  \nGUE/NGL denounces the undemocratic exclusion of amendments to remove macroeconomic sanctions, calling this procedural manipulation antithetical to parliamentary sovereignty.  \nGUE/NGL fundamentally doubts with the cohesion policy’s alignment with Europe 2020 strategies, which accelerate privatization and deepen regional disparities through profit-driven projects."
      }
    ],
    "resolution": "The European Parliament raised concerns regarding the Commission’s legislative proposals (COM(2011)0615 and subsequent amendments in 2012–2013) on regional development, emphasizing compliance with subsidiarity principles following a reasoned objection from the Italian Senate. It integrated opinions from multiple EU bodies, including the European Economic and Social Committee (April 2012, December 2012, May 2013), the Committee of the Regions (May 2012), and the Court of Auditors (December 2011), alongside input from parliamentary committees covering areas such as employment, environment, transport, and gender equality. The Parliament formally adopted its first-reading position (A7-0274/2013), urging the Commission to resubmit the proposal if substantial amendments are made and instructing its President to transmit the position to the Council, Commission, and national parliaments, ensuring alignment with Treaty obligations (Articles 177 and 294 TFEU) and procedural rules (Rule 55).",
    "total_score": 0.6253263707571801,
    "total_choice": 6,
    "party_num": 4,
    "id": 2,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.6,
      0.1,
      0.2,
      0.1
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "regional development",
    "title": "European Regional Development Fund and the 'European territorial cooperation' goal: REPORT on the proposal for a regulation of the European Parliament and of the Council on specific provisions for the support from the European Regional Development Fund to the European territorial cooperation goal",
    "background": "The European Regional Development Fund’s role in advancing cross-border cooperation under the EU’s cohesion policy necessitated regulatory updates to align with strategic priorities and address implementation challenges. The Parliament will discuss specific provisions for ERDF support to the European territorial cooperation objective.",
    "stances": [
      {
        "party_name": "EFD",
        "score": 0.5161290322580645,
        "choice": 5,
        "stance": "EFD supports the issue’s emphasis on interinstitutional collaboration but advises streamlining bureaucratic procedures to improve fund absorption rates, addressing inefficiencies observed in Southern Italy.  \nEFD endorses provisions for simplifying administrative processes and enhancing stakeholder coordination, aligning with regional development goals to stimulate job creation.  \nEFD proposes amending fund allocation criteria to prioritize micro-enterprises and local infrastructure projects, ensuring adherence to cohesion principles over trans-European networks.  \nEFD raises concerns about insufficient oversight mechanisms, urging stricter controls to prevent criminal exploitation of funds, as highlighted in Bulgaria.  \nEFD advises balancing EU budgetary influence with national fiscal autonomy, ensuring cohesion policies do not undermine member states’ financial sovereignty."
      },
      {
        "party_name": "ALDE",
        "score": 0.927710843373494,
        "choice": 9,
        "stance": "ALDE entirely accepts the issue’s integration of macroeconomic conditionality, perfectly aligning with their commitment to fiscal stability and structural reform enforcement across EU member states.  \nALDE perfectly aligns with the prioritization of small and medium-sized enterprises (SMEs) as engines of economic recovery, emphasizing the critical need to safeguard voluntary funding mechanisms that empower national initiatives.  \nALDE strongly agrees the Danube Strategy’s operationalization through territorial cooperation programs, recognizing its potential to address regional disparities and accelerate cross-border infrastructure development.  \nALDE applauds the issue’s balanced fund allocation framework, which protects regional development priorities while maintaining coherence with broader EU employment and poverty-reduction goals.  \nALDE commends the emphasis on interinstitutional transparency and procedural rigor, ensuring that legislative amendments remain aligned with the original proposal’s focus on territorial cohesion."
      },
      {
        "party_name": "SD",
        "score": 0.9025641025641026,
        "choice": 9,
        "stance": "SD completely accepts the enhanced territorial cooperation mechanisms as perfectly aligning with SD's commitment to reducing regional disparities through concrete EU-wide investment frameworks.  \nSD perfectly aligns with the issue's focus on simplified fund management procedures, recognizing this as critical for accelerating job-creating infrastructure projects across border regions.  \nSD completely accepts the mandatory 23% ESF allocation as effectively advancing SD's manifesto priority of combating youth unemployment through targeted vocational training systems.  \nSD strongly agrees the strengthened partnership principle in Article 7, which operationalizes SD's longstanding demand for direct regional authority involvement in cohesion programming.  \nSD applauds the climate-focused expenditure targets as successfully implementing SD's 2023 policy platform for green transition investments in energy-efficient urban development."
      },
      {
        "party_name": "ECR",
        "score": 0.49122807017543857,
        "choice": 4,
        "stance": "ECR partly advocates the issue’s focus on interinstitutional collaboration but requests revisions to Article 294 procedural frameworks to explicitly exclude macroeconomic conditionality penalties for cohesion fund recipients.  \nECR highlights contradictions with fiscal autonomy principles by opposing the issue’s integration of macroeconomic sanctions, which risk exacerbating regional disparities contrary to solidarity commitments.  \nECR proposes amending fund allocation clauses to mandate stricter national auditing mechanisms, referencing the European Court of Auditors’ recurrent findings on misdirected SME investments.  \nECR urges incorporating binding results-oriented benchmarks for West Wales and the Valleys’ convergence funding to rectify persistent poverty metrics despite prior EU allocations.  \nECR demands enhanced transparency requirements under the partnership principle, including real-time public disclosure of member state implementation frameworks to prevent infrastructural fund diversion."
      }
    ],
    "resolution": "The European Parliament raised its position on a legislative proposal concerning the Treaty on the Functioning of the European Union, adopting its first reading stance based on the Committee on Regional Development’s report and incorporating opinions from the Committees on Budgets, Budgetary Control, and Transport and Tourism (A7-0280/2013). It emphasized the need for the European Commission to re-engage Parliament if substantial amendments or replacements to the original 2011 proposal (COM(2011)0611) are planned, ensuring legislative coherence and transparency. The resolution instructed the Parliament’s President to formally communicate its adopted position to the Council, Commission, and national parliaments, reinforcing interinstitutional collaboration and adherence to procedural frameworks under Article 294 of the Treaty. The text integrated prior consultations with the Committee of the Regions (July 2012) and the European Economic and Social Committee (April 2012), aligning regional and economic stakeholder perspectives with EU policy objectives.",
    "total_score": 0.8211488250652742,
    "total_choice": 8,
    "party_num": 4,
    "id": 3,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.4,
      0.3,
      0.2,
      0.1
    ],
    "veto_party_name": "ALDE"
  },
  {
    "topic": "regional development",
    "title": "European Regional Development Fund and the 'investment for growth and jobs' goal: REPORT on the proposal for a regulation of the European Parliament and of the Council on specific provisions concerning the European Regional Development Fund and the Investment for growth and jobs goal and repealing Regulation (EC) No 1080/2006",
    "background": "The European Union's cohesion policy, established to reduce economic and social disparities among regions, faced evolving challenges post-2008 financial crisis, including youth unemployment and climate targets. Revisions to structural funds aimed to align with Europe 2020 growth strategies. The Parliament will discuss ERDF reforms targeting investment efficiency, thematic priorities, and regulatory simplification.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.8978102189781022,
        "choice": 8,
        "stance": "EPP strongly upholds the strategic focus on smart specialization and innovation through ERDF allocations, particularly praising the mandatory 85% co-financing rate for outermost regions as critical for reducing territorial disparities.  \nEPP approves the creation of transition regions as a key achievement ensuring fairer fund distribution while maintaining alignment with Europe 2020 targets for sustainable growth.  \nEPP highlights the €9 billion increase for territorial cooperation programs as essential for cross-border infrastructure projects that materialize European integration benefits.  \nEPP proposes enhanced monitoring mechanisms for macroeconomic conditionality clauses to prevent unintended penalization of regions needing structural investments most urgently.  \nEPP emphasizes the necessity to streamline national implementation processes, citing successful vocational training models in Romania as templates for EU-wide SME workforce development initiatives."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.8793103448275862,
        "choice": 8,
        "stance": "GREEN_EFA strongly promotes the binding allocation of 12-20% ERDF investments to low-carbon economy transitions, aligning perfectly with their climate action priorities.  \nGREEN_EFA applauds the mandatory 20% ESF focus on combating poverty and social exclusion, effectively advancing their commitment to territorial cohesion.  \nGREEN_EFA proposes amending Article 21 to remove macroeconomic conditionality clauses that risk penalizing regions for member states' fiscal policies.  \nGREEN_EFA endorses the strengthened environmental safeguards for waste management and water resources as critical progress toward ecosystem-based policymaking.  \nGREEN_EFA highlights the need to expand participatory mechanisms for local communities in project design while maintaining simplified administrative procedures."
      },
      {
        "party_name": "ALDE",
        "score": 0.9397590361445783,
        "choice": 9,
        "stance": "ALDE entirely advocates the compromise maintaining the European Social Fund share at 23.1%, perfectly aligning with their commitment to preserving Regional Development Fund allocations critical for SME competitiveness and job creation.  \nALDE perfectly aligns with the issue’s macroeconomic conditionality framework, recognizing its necessity to enforce fiscal discipline while safeguarding funding adjustments tied to employment and poverty metrics.  \nALDE strongly accepts the performance reserve mechanism and advance payment structures, affirming their role in ensuring accountability and measurable progress toward the Europe 2020 strategy’s goals.  \nALDE endorses the Danube Strategy’s integration into territorial cooperation instruments, emphasizing its potential to address regional disparities through targeted cross-border investments in infrastructure and innovation.  \nALDE applauds the issue’s focus on streamlining administrative procedures for SMEs, viewing it as essential to unlocking entrepreneurial potential and driving post-crisis economic recovery."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.05714285714285714,
        "choice": 0,
        "stance": "GUE/NGL entirely disputes the macroeconomic conditionality clauses, which impose austerity measures on regions and contradict the principle of EU solidarity.  \nGUE/NGL rejects the undemocratic exclusion of amendments targeting macroeconomic sanctions, denouncing this as a breach of parliamentary autonomy.  \nGUE/NGL condemns the prioritization of private infrastructure and airport expansions over social needs like housing and healthcare, reinforcing capitalist exploitation.  \nGUE/NGL highlights the issue’s failure to combat poverty meaningfully, criticizing the ESF’s shift toward “employability” over direct social inclusion measures.  \nGUE/NGL opposes reduced funding and restrictive criteria that deepen disparities between stronger and fragile economies, perpetuating dependency."
      }
    ],
    "resolution": "The European Parliament raised its position at first reading on the Commission’s proposal COM(2011)0614, grounded in the Treaty on the Functioning of the European Union and informed by opinions from the European Economic and Social Committee and the Committee of the Regions. It emphasized the need for the Commission to resubmit the proposal to Parliament if substantial amendments or a replacement text are planned, ensuring parliamentary oversight. The resolution also mandated the Parliament’s President to formally communicate its adopted position to the Council, Commission, and national parliaments to facilitate further legislative steps, underscoring procedural transparency and inter-institutional collaboration.",
    "total_score": 0.7898172323759791,
    "total_choice": 7,
    "party_num": 4,
    "id": 4,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.4,
      0.4,
      0.1,
      0.1
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "regional development",
    "title": "European Union Solidarity Fund: REPORT on the proposal for a regulation of the European Parliament and of the Council amending Council Regulation (EC) No 2012/2002 establishing the European Union Solidarity Fund",
    "background": "The EU Solidarity Fund, established in 2002 to address major natural disasters, faced operational challenges including delayed disbursements, complex eligibility criteria, and unsuccessful reform attempts in 2005. The Parliament will discuss amending the fund’s regulation to improve response mechanisms and accessibility for member states and regions affected by catastrophic events.",
    "stances": [
      {
        "party_name": "EFD",
        "score": 0.2903225806451613,
        "choice": 2,
        "stance": "EFD firmly conflicts the issue's approach as it fails to address EU environmental directives that restrict flood prevention measures like dredging, directly conflicting with EFD's anti-regulatory principles.  \nEFD rejects the reliance on EU Solidarity Funding mechanisms, citing the UK's disproportionate financial contributions to the EU as evidence of systemic imbalance in crisis response frameworks.  \nThe proposal overlooks critical aspects of national sovereignty by maintaining EU control over disaster management, inconsistent with EFD's advocacy for local decision-making exemplified in the Somerset Levels flooding case.  \nEFD highlights contradictions between the issue's institutional coordination goals and EU wildlife policies that prioritize habitat preservation over flood mitigation, exacerbating crises rather than resolving them.  \nThis completely conflicts with EFD's position that EU membership compounds governance failures, as demonstrated by the UK government's refusal to seek compensation for EU-caused infrastructure neglect."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.8793103448275862,
        "choice": 8,
        "stance": "GREEN_EFA strongly accepts the mandatory environmental prevention reporting requirements in the reformed Solidarity Fund, ensuring regions implement nature-based solutions like river restoration to qualify for aid.  \nGREEN_EFA applauds the issue’s integration of ecological prevention standards as perfectly aligning with their manifesto commitment to climate-resilient infrastructure.  \nGREEN_EFA endorses linking fund disbursements to proactive environmental safeguards, advancing their vision of harmonizing disaster response with long-term sustainability.  \nGREEN_EFA proposes enhancing Commission monitoring protocols to ensure uniform application of prevention criteria while fully backing the regulation’s core principles.  \nThis reform effectively advances GREEN_EFA’s priority of transforming post-disaster solidarity into systemic ecological risk reduction."
      },
      {
        "party_name": "ECR",
        "score": 0.3508771929824561,
        "choice": 3,
        "stance": "ECR slightly approves the 10% advance mechanism but demands amendments to Article 6 mandating disbursement within 20 working days, citing Poland’s four-year flood recovery delays as evidence of structural inefficiency.  \nThe proposal absolutely conflicts with ECR’s regional subsidiarity principles by maintaining excessive centralization in damage assessment, failing to empower national authorities per Croatia’s landslide response needs.  \nECR requests revisions to Annex III to include ice storm disasters explicitly, noting the issue’s current natural hazard categories overlook Gorski Kotar’s freeze-related infrastructure collapse.  \nThe issue overlooks critical anti-fraud safeguards for infrastructure resilience funding, inconsistent with ECR’s amendment requiring Member State co-financing audits before EU reimbursement.  \nECR opposes the 12-month application deadline in Section 5(2) as incompatible with multi-jurisdictional disasters, proposing variable timelines aligned with Croatia’s cross-county flood patterns."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.7428571428571429,
        "choice": 7,
        "stance": "GUE_NGL strongly approves the enhanced focus on climate-vulnerable regions, particularly the outermost territories affected by recurrent extreme weather events, which aligns with their commitment to territorial solidarity and social justice.  \n\nGUE_NGL approves the streamlined pre-financing mechanism as a critical improvement to accelerate disaster relief, exemplified by Croatia’s urgent needs following snowstorms, while emphasizing that such provisions must prioritize marginalized communities.  \n\nGUE_NGL highlights the issue’s alignment with their advocacy for structural EU solidarity tools, particularly its responsiveness to agricultural and infrastructural recovery in crisis-hit areas like Mayotte and La Réunion.  \n\nGUE_NGL proposes future enhancements to Article 4 by specifying climate adaptation obligations, ensuring preventive measures against predictable disasters are integrated into funding criteria during the next parliamentary term.  \n\nGUE_NGL commends the institutional coordination between FEAD and the Solidarity Fund as a model for multidimensional crisis response, reflecting their broader agenda of linking emergency aid with long-term social resilience."
      }
    ],
    "resolution": "The European Parliament raised its position on the Commission proposal (COM(2013)0522), adopting its first-reading stance as outlined, which includes instructing the Commission to resubmit the matter to Parliament if substantial amendments or a replacement text are proposed. It emphasized procedural adherence by invoking Treaty provisions (Articles 294(2)-(3), 175, and 212(2) TFEU) and Rule 55 of its Rules of Procedure, while directing its President to formally communicate Parliament’s position to the Council, Commission, and national parliaments. The resolution incorporated inputs from the Committee on Regional Development’s report (A7-0078/2014) and the Committee on Budgets’ opinion, focusing on institutional coordination and ensuring parliamentary oversight over potential revisions to the proposal.",
    "total_score": 0.685378590078329,
    "total_choice": 6,
    "party_num": 4,
    "id": 5,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.1,
      0.6,
      0.1,
      0.2
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "regional development",
    "title": "European Union Solidarity Fund, implementation and application: REPORT on the European Union Solidarity Fund, implementation and application",
    "background": "The European Union Solidarity Fund, established in 2002 to address major disasters, faced operational challenges including slow mobilization processes, bureaucratic complexities, and evolving disaster patterns. The European Commission proposed regulatory revisions to improve responsiveness. The Parliament will discuss reforms to enhance the fund's operational efficiency and disaster response mechanisms.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.8111111111111111,
        "choice": 8,
        "stance": "EPP strongly promotes the issue's call to streamline EUSF administrative procedures, aligning with members' emphasis on reducing delays and enhancing operational efficiency as highlighted by Sanchez-Schmid and Teixeira's practical experiences.  \nEPP totally advocates expanding EUSF coverage to include \"slowly unfolding\" climate-related disasters, perfectly matching their commitment to addressing Mediterranean environmental challenges and urban resilience strategies discussed by Mazzoni and Jordan.  \nEPP approves the critical linkage between EUSF and structural funds, reinforcing their longstanding priority of integrated territorial development as emphasized in Cozzolino's report and Zeller's urban focus.  \nEPP proposes adjusting the regional GDP damage threshold calculation to better reflect actual recovery needs while maintaining rigorous accountability, addressing concerns raised in the issue about current rejection rates.  \nEPP applauds the issue's focus on sustainable disaster prevention, strongly aligning with their manifesto goals on climate adaptation and cross-border energy projects advocated by Jordan and Gyürk."
      },
      {
        "party_name": "EFD",
        "score": 0.5161290322580645,
        "choice": 5,
        "stance": "EFD supports the issue’s emphasis on streamlining EUSF administrative procedures, proposing amendments to introduce upfront payments of 30% anticipated aid to accelerate crisis response, directly addressing delays criticized in Article 6.  \nEFD advises revising the 1.5% regional GDP damage threshold to a dynamic model accounting for local economic vulnerabilities, aligning with concerns about high rejection rates while maintaining fiscal safeguards.  \nEFD endorses expanding EUSF coverage to \"slowly unfolding\" climate-linked disasters but urges explicit recognition of regional energy autonomy, allowing fossil fuel-dependent areas transitional flexibility to avoid \"energy poverty\" as raised in cohesion policy debates.  \nEFD supports integrating cascading socio-economic impacts into disaster definitions, suggesting Annex II amendments to include unemployment spikes and infrastructure collapse metrics post-catastrophe.  \nEFD highlights the need to clarify EUSF’s complementary role with structural funds, proposing a joint taskforce to prevent overlaps in climate adaptation projects while maintaining the fund’s budgetary independence."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.6206896551724138,
        "choice": 6,
        "stance": "GREEN_EFA supports the issue's expansion of EUSF coverage to include slowly unfolding climate-linked disasters like droughts, aligning with their climate justice agenda.  \nGREEN_EFA advises revising Article 4 to lower the 1.5% GDP damage threshold, citing its role in historically high rejection rates that undermine solidarity principles.  \nGREEN_EFA proposes streamlining administrative protocols to ensure fund disbursement within six months, addressing delays that exacerbate post-disaster recovery challenges.  \nGREEN_EFA emphasizes integrating mandatory prevention frameworks into EUSF allocations, noting proactive adaptation reduces long-term costs and human suffering.  \nGREEN_EFA questions the adequacy of \"transnational energy infrastructure\" definitions in Clause 12, urging explicit exclusion of shale gas projects to prevent fossil fuel lock-ins."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.7941176470588235,
        "choice": 7,
        "stance": "GUE/NGL strongly upholds the issue's emphasis on maintaining the EUSF outside the EU budget to preserve flexibility, aligning with their commitment to robust public funding mechanisms.  \nGUE/NGL applauds the call to expand EUSF coverage for climate-linked disasters and socio-economic impacts, advancing their priority of addressing systemic inequalities exacerbated by environmental crises.  \nGUE/NGL proposes enhancing Article 4 to explicitly prioritize public infrastructure like earthquake protections and free public transport in fund allocation, ensuring disaster resilience serves communal needs over private interests.  \nGUE/NGL strongly endorses the criticism of the 1.5% GDP damage threshold, urging its revision to prevent exclusion of vulnerable regions—a stance consistent with their opposition to austerity-driven eligibility criteria.  \nGUE/NGL highlights the need to synchronize EUSF reforms with increased cohesion policy budgets, noting current negotiations to reverse proposed cuts that risk undermining disaster prevention in urban and rural areas."
      }
    ],
    "resolution": "The European Parliament raised the critical role of the European Union Solidarity Fund (EUSF) as the primary mechanism for demonstrating EU solidarity by providing financial support to Member States and accession countries affected by major natural or man-made disasters. It emphasized the need to improve the Fund’s flexibility, speed, and operational efficiency, noting that 63% of past applications were submitted under the \"regional disaster\" category, with 66% rejected due to stringent criteria. The resolution highlighted excessive delays in mobilizing the EUSF, often exceeding a year, due to complex administrative procedures involving multiple EU institutions, and called for streamlined processes, including advances representing a fixed percentage of anticipated aid to accelerate assistance. It criticized the proposed 1.5% regional GDP damage threshold for eligibility as insufficient, arguing it would perpetuate high rejection rates and public frustration. The Parliament urged clearer definitions of disasters, expanded coverage for \"slowly unfolding\" events like droughts and Mediterranean disasters linked to climate change, and inclusion of cascading socio-economic impacts. It stressed the EUSF’s complementary role with other EU funds, such as structural funds, and advocated for sustainable disaster prevention. The resolution also underscored the need to maintain the EUSF outside the EU budget to ensure flexibility, while urging timely regulatory revisions before the 2014-2020 financial framework to enhance responsiveness and address evolving disaster risks.",
    "total_score": 0.7453580901856764,
    "total_choice": 7,
    "party_num": 4,
    "id": 6,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.3,
      0.3,
      0.3,
      0.1
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "regional development",
    "title": "European grouping of territorial cooperation: REPORT on the proposal for a regulation of the European Parliament and of the Council amending Regulation (EC) No 1082/2006 of the European Parliament and of the Council of 5 July 2006 on a European grouping of territorial cooperation (EGTC) as regards the clarification, simplification and improvement of the establishment and implementation of such groupings",
    "background": "The 2006 EGTC Regulation established cross-border cooperation frameworks, but implementation challenges and evolving territorial cohesion priorities under the EU treaties prompted calls for procedural updates. The Parliament will discuss amendments to Regulation (EC) No 1082/2006 to clarify and streamline European territorial cooperation group formation and operational rules.",
    "stances": [
      {
        "party_name": "EFD",
        "score": 0.5806451612903226,
        "choice": 5,
        "stance": "EFD supports the issue’s focus on administrative simplification for EGTC implementation, advising stricter safeguards against bureaucratic delays that hinder fund absorption.  \nEFD advises amending Article 4 to prioritize SME support in cohesion strategies, aligning with regional economic needs rather than broad integration programs.  \nEFD raises concerns about misallocated funds for non-cohesive priorities, urging explicit exclusion of ethnically targeted spending to ensure equal territorial development.  \nEFD proposes stricter accountability mechanisms in Article 7 to mandate national audits, addressing inefficiencies highlighted by low fund absorption rates in Southern Europe.  \nEFD cautions against diverting cohesion funds to trans-European infrastructure projects, advocating clear demarcation between regional development and EU-wide initiatives."
      },
      {
        "party_name": "ALDE",
        "score": 0.9518072289156626,
        "choice": 9,
        "stance": "ALDE absolutely advocates the issue's reinforcement of economic conditionality mechanisms, perfectly aligning with their commitment to linking structural funds to macroeconomic stability and employment growth targets.  \nALDE perfectly aligns with the issue's protection of Regional Development Fund allocations, strongly opposing any amendments that would divert resources from SME support to the European Social Fund.  \nALDE absolutely advocates the prioritization of Danube Strategy implementation through enhanced territorial cooperation instruments, recognizing their vital role in addressing regional disparities and fostering cross-border economic integration.  \nALDE strongly agrees the issue's performance reserve system and advance payment structures, which align with their principles of results-oriented budgeting and accountability in cohesion policy execution.  \nALDE absolutely advocates the streamlined governance provisions for EGTCs, recognizing their capacity to accelerate transnational infrastructure projects critical for single market competitiveness."
      },
      {
        "party_name": "SD",
        "score": 0.9179487179487179,
        "choice": 9,
        "stance": "SD totally accepts the issue's emphasis on territorial cohesion mechanisms that perfectly align with S&D's commitment to reducing regional disparities through enhanced cross-border cooperation.  \nSD perfectly aligns with provisions enabling EGTCs to address energy transition and public health challenges, directly advancing SD's 2023 priorities for green infrastructure and social welfare integration.  \nSD proposes strengthening Article 7 implementation guidelines to ensure strategic synergies between regional authorities and Commission directorates, addressing operational concerns raised during stakeholder consultations.  \nSD applauds the issue's incorporation of Committee of Regions' input as fully consistent with S&D's governance model prioritizing multi-level decision-making and subsidiarity principles.  \nSD emphasizes the critical need for swift operationalization of simplified funding procedures to maximize youth employment initiatives outlined in the European Social Fund provisions."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.42857142857142855,
        "choice": 4,
        "stance": "GUE_NGL partly approves the EGTC reform but demands removal of Article 7's macroeconomic conditionality, which weaponizes cohesion funds to enforce austerity—fully condemning with their anti-neoliberal governance principles.  \n\nGUE_NGL requests revisions to prioritize social infrastructure in Article 4, opposing the current focus on private-sector projects like airports and energy monopolies that neglect housing, healthcare, and worker needs.  \n\nGUE_NGL highlights the undemocratic bypassing of amendments on funding suspensions, overlooking critical safeguards against poverty escalation in crisis-hit regions as outlined in their 2022 cohesion manifesto.  \n\nGUE_NGL criticizes the diluted ESF allocation (20% poverty target) as inconsistent with their demand for binding 25% minimums, urging stricter wording to prevent employability metrics from overriding direct social inclusion."
      }
    ],
    "resolution": "The European Parliament raised its position on a legislative proposal concerning regional development and external action, adopting its first reading stance as outlined in the Committee on Regional Development’s report (A7-0309/2013). The resolution emphasized alignment with Treaty provisions, particularly Articles 175, 209(1), and 212(1) of the Treaty on the Functioning of the European Union, which govern EU action in economic, social, and territorial cohesion, as well as development and external cooperation. It called on the Commission to re-engage Parliament if substantial amendments or replacements to the original 2011 proposal (COM(2011)0610/2) were planned, ensuring legislative transparency. The Parliament also instructed its President to formally communicate its adopted position to the Council, the Commission, and national parliaments, reinforcing procedural adherence under EU legislative frameworks. The resolution integrated opinions from the European Economic and Social Committee (April 2012) and the Committee of the Regions (February 2012), reflecting stakeholder input while focusing on substantive policy coherence and institutional accountability.",
    "total_score": 0.8224543080939948,
    "total_choice": 8,
    "party_num": 4,
    "id": 7,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.5,
      0.2,
      0.2,
      0.1
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "regional development",
    "title": "General provisions on the European Regional Development Fund, the European Social Fund and the Cohesion Fund as regards simplification of certain requirements and as regards certain provisions relating to financial management: REPORT on the proposal for a regulation of the European Parliament and of the Council amending regulation (EC) No 1083/2006 concerning general provisions on the European Regional Development Fund, the European Social Fund and the Cohesion Fund as regards simplification of certain requirements and as regards provisions relating to financial management",
    "background": "The European Union faced economic crisis impacts, administrative complexities in Structural Funds management, and delayed absorption of cohesion policy resources, prompting calls for streamlined procedures. The Parliament will discuss regulatory amendments to simplify financial management and access requirements for the European Regional Development, Social, and Cohesion Funds.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9045801526717557,
        "choice": 9,
        "stance": "EPP absolutely promotes the issue's alignment with Treaty provisions and interinstitutional cooperation, perfectly reflecting their commitment to cohesive EU governance.  \nEPP applauds the crisis-response measures including financial advances and extended fund utilization periods, which directly advance regional economic stability priorities.  \nEPP emphasizes the issue’s success in preserving cofinancing mechanisms as essential for shared responsibility in regional development projects.  \nEPP recognizes the procedural acceleration as critical for tangible results, converting past bureaucratic challenges into streamlined implementation frameworks.  \nEPP highlights the issue’s foundational role in future policy architecture, urging continued simplification efforts post-2013 while maintaining current achievements."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.10909090909090909,
        "choice": 1,
        "stance": "GREEN_EFA totally disputes the increased threshold for project evaluations, as it eliminates mandatory environmental compliance checks and transparent cost-benefit analyses, directly conflicting with principles of ecological accountability.  \nGREEN_EFA rejects reduced sustainability requirements for SMEs, demanding five-year commitments instead of three to prevent transient subsidy exploitation as seen in the Nokia case.  \nGREEN_EFA condemns the proposal’s allowance of non-transparent project assessments, which overlooks critical public oversight mechanisms enshrined in EU environmental legislation.  \nGREEN_EFA highlights the issue’s failure to address disproportionate financial burdens on regions, enabling risky debt structures that violate fiscal responsibility commitments.  \nGREEN_EFA insists on maintaining ex-ante evaluations for all major projects, asserting that weakened scrutiny fundamentally undermines taxpayer trust in Structural Funds management."
      },
      {
        "party_name": "ALDE",
        "score": 0.9047619047619048,
        "choice": 9,
        "stance": "ALDE completely agrees the issue’s prioritization of the European Social Fund’s crisis-response capacity, perfectly aligning with their commitment to combat unemployment through targeted workforce development.  \nALDE perfectly aligns with the advance payment mechanisms for liquidity support, recognizing their critical role in accelerating economic recovery for crisis-impacted Member States.  \nALDE strongly advocates the streamlined fund accessibility provisions, which effectively advance their priority of reducing bureaucratic barriers to EU-funded social and cohesion initiatives.  \nALDE highlights the issue’s alignment with lifelong learning strategies, reinforcing their advocacy for adaptable workforce training in a globalized economy.  \nALDE commends the focus on marginalized groups through ESF allocations, reflecting their longstanding dedication to inclusive social policy and equitable resource distribution."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.0,
        "choice": 0,
        "stance": "GUE_NGL rejects the inadequate crisis response measures that fail to implement full interim payments for labor market policies as originally proposed by the Commission  \nGUE_NGL opposes fundamentally the compromised provisions that neglect urgent unemployment challenges across all Member States beyond the five prioritized countries  \nGUE_NGL highlights the issue's inconsistency with their demand for maximal Structural Fund utilization to counteract rising poverty and precarious employment conditions  \nGUE_NGL condemns the missed opportunity to operationalize Article 161's potential through binding mechanisms for social protection in cohesion spending  \nGUE_NGL underscores the proposal's failure to address systemic underinvestment in public services critical to GUE/NGL's anti-austerity platform"
      }
    ],
    "resolution": "The European Parliament raised its position on a proposed regulation concerning regional development, emphasizing alignment with Treaty provisions and interinstitutional procedures following the Lisbon Treaty’s entry into force. It adopted its first-reading stance, urging the Commission to re-engage Parliament if substantial amendments or replacement of the proposal (COM(2009)0384) were planned, ensuring legislative transparency and continuity. The resolution highlighted collaboration with the Committee on Regional Development, incorporating opinions from the Committees on Budgets and Employment and Social Affairs, and stressed adherence to the Treaty on the Functioning of the European Union (Articles 294(3) and 177) and the EC Treaty (Article 161). It mandated forwarding the adopted position to the Council, Commission, and national parliaments, reinforcing procedural accountability while prioritizing regional policy coherence and institutional cooperation.",
    "total_score": 0.7051630434782609,
    "total_choice": 7,
    "party_num": 4,
    "id": 8,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.2,
      0.1,
      0.1,
      0.6
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "regional development",
    "title": "Implementation of the synergies of research and innovation earmarked funds in Regulation (EC) No 1080/2006 concerning the European Fund of Regional Development and the Seventh Framework Programme for Research and Development: REPORT on the implementation of the synergies of research and innovation earmarked Funds in Regulation (EC) No 1080/2006 concerning the European Fund of Regional Development and the Seventh Framework Programme for Research and Development in cities and regions as well as in the Member States and the Union",
    "background": "The European Regional Development Fund and Seventh Framework Programme allocated significant EU resources for research, innovation, and regional development, aligned with Lisbon Strategy goals for competitiveness. Institutional frameworks emphasized cohesion policy alongside excellence-based research funding. The Parliament will discuss optimizing coordination between structural funds and research programmes to strengthen innovation capacities across EU regions.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.8390804597701149,
        "choice": 8,
        "stance": "EPP strongly endorses the issue's emphasis on integrated governance and multi-level coordination, aligning perfectly with EPP's commitment to reinforcing economic union through strengthened political cohesion and cross-policy synergies.  \nEPP approves the harmonization of Structural Funds with FP7 and CIP for infrastructure development, proposing enhanced SME access to mixed funding streams through simplified application portals.  \nEPP endorses the prioritization of smart specialization strategies in regions, matching EPP's manifesto focus on place-based innovation ecosystems and territorial cohesion.  \nEPP highlights the need to operationalize fiscal discipline mechanisms alongside growth initiatives, urging stricter Stability and Growth Pact enforcement to complement R&D investments.  \nEPP emphasizes resolving administrative barriers as critical enhancement opportunities, advocating for real-time digital reporting systems to reduce bureaucratic delays in fund disbursement."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.8703703703703703,
        "choice": 8,
        "stance": "GREEN_EFA strongly promotes the issue's emphasis on multi-level governance and smart specialization strategies, which align perfectly with their advocacy for place-based green innovation ecosystems in urban and rural regions.  \n\nGREEN_EFA approves the call for harmonizing Structural Funds with FP7/CIP but proposes explicitly mandating 30% of such synergies to target low-carbon infrastructure and circular economy clusters, enhancing alignment with climate goals.  \n\nGREEN_EFA endorses the prioritization of cities as sustainable growth hubs and urges amendment to Article 4 to include binding metrics for green job creation through ERDF-funded urban innovation projects.  \n\nGREEN_EFA applauds the focus on transnational cooperation while recommending the issue integrate macro-regional strategies (e.g., Baltic, Danube) as formal implementation mechanisms for cross-border knowledge transfer.  \n\nGREEN_EFA welcomes criticism of mixed funding barriers and suggests adding explicit provisions for joint FP7-SF financing of community-led renewable energy R&D, addressing democratic access to innovation resources."
      },
      {
        "party_name": "SD",
        "score": 0.8655913978494624,
        "choice": 8,
        "stance": "SD strongly endorses the issue's emphasis on integrated governance and multi-level coordination, which aligns perfectly with S&D's commitment to territorial cohesion and reducing regional disparities through smart specialization strategies.  \nSD approves the call for harmonizing Structural Funds with FP7/CIP frameworks, proposing enhanced monitoring mechanisms to ensure transparent allocation of unspent funds to high-impact regional innovation projects.  \nSD emphasizes the critical need to prioritize social dimensions within the 2020 Strategy, urging explicit integration of gender equality targets and poverty reduction metrics into Member States' operational programs.  \nSD endorses the urban focus as central to sustainable growth, strongly advocating for expanded JEREMIE-style instruments to empower cities as laboratories for green job creation and low-carbon infrastructure development.  \nSD highlights the necessity to convert austerity critiques into proactive investment mandates, suggesting amendments to prioritize ESF allocations for upskilling programs that address youth unemployment and demographic challenges."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.0,
        "choice": 0,
        "stance": "GUE/NGL rejects fundamentally the issue's alignment with the EU 2020 strategy's growth paradigm that perpetuates austerity measures and financial market prioritization over social protections.  \nGUE/NGL opposes the failure to incorporate binding poverty reduction targets or worker protections against precarious employment in structural fund allocations.  \nGUE/NGL condemns the issue's endorsement of Stability Pact frameworks that enable IMF-imposed austerity rather than proposing wealth redistribution mechanisms.  \nGUE/NGL denounces the continued reliance on liberalization policies that accelerate privatization of public services through cohesion funding instruments.  \nGUE/NGL highlights the issue's democratic deficit in excluding parliamentary oversight of EU 2020 implementation, mirroring citizens' marginalization in crisis responses."
      }
    ],
    "resolution": "The European Parliament raised the critical role of cohesion policy, research frameworks (FP7), and innovation programs (CIP) in advancing the EU’s competitiveness, growth, and territorial cohesion, particularly through synergies between these instruments. It highlighted that €86 billion from Structural Funds (SF) was allocated to research and innovation (R&D&I) for 2007-2013, with €50 billion dedicated to core R&D, rivaling FP7’s €50.5 billion and CIP’s €3.6 billion. Emphasizing the need for integrated governance, the resolution stressed multi-level coordination to address disparities between regions, enhance innovation capacity, and align policies with the EU 2020 Strategy’s goals of smart, sustainable, and inclusive growth. It called for simplifying administrative procedures, harmonizing funding rules, and improving synergies through joint strategies, such as combining SF with FP7 and CIP for infrastructure, clusters, and knowledge transfer. The Parliament urged regions to adopt place-based innovation strategies, prioritize smart specialization, and leverage cities as hubs for sustainable growth, noting that 80% of Europeans live in urban areas. It welcomed initiatives like JEREMIE and Risk Sharing Finance Facility to boost SME financing but criticized barriers to mixed funding between SF and FP7. Future recommendations included strengthening territorial cohesion, enhancing transnational cooperation, allocating unspent SF to regional projects, and ensuring peer reviews for large SF-funded research infrastructures. The resolution underscored the need for streamlined bureaucracy, better communication of funding opportunities, and alignment of future programs (e.g., EU 2020’s Innovation Union, Youth on the Move) with SF to maximize impact on jobs, education, and low-carbon innovation.",
    "total_score": 0.762619372442019,
    "total_choice": 7,
    "party_num": 4,
    "id": 9,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.3,
      0.1,
      0.4,
      0.2
    ],
    "veto_party_name": "GUE_NGL"
  },
  {
    "topic": "regional development",
    "title": "Motions for resolutions - EU strategy for the Atlantic region: MOTION FOR A RESOLUTION on the European Strategy for the Atlantic Region",
    "background": "In June 2010, the European Council mandated the Commission to develop an EU Atlantic strategy, following precedents like the Baltic and Danube strategies. Five EU states (France, Ireland, Portugal, Spain, UK) share Atlantic coastlines, with maritime activities and territorial cohesion objectives under EU treaties. The Parliament will discuss formulating an integrated EU strategy addressing Atlantic maritime and territorial cooperation.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.916030534351145,
        "choice": 9,
        "stance": "EPP totally accepts the issue's integration of maritime and territorial cohesion priorities, perfectly aligning with EPP's commitment to multi-level governance and leveraging existing cohesion frameworks.  \nEPP perfectly aligns with the emphasis on marine energy and climate action, recognizing the Atlantic's strategic role in advancing renewable technologies central to EPP's 2020 energy transition goals.  \nEPP fully supports the inclusive territorial approach encompassing Macaronesia's outermost regions, reflecting EPP's principle of equitable development for all EU peripheries.  \nEPP endorses the bottom-up governance model involving local authorities and EGTC tools, mirroring EPP's advocacy for subsidiarity in EU policymaking.  \nEPP applauds the issue's geopolitical focus on Atlantic trade corridors and maritime security, which directly advance EPP's vision of a globally competitive EU."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.9636363636363636,
        "choice": 9,
        "stance": "GREEN_EFA completely promotes the issue’s emphasis on marine spatial planning as a cornerstone for harmonizing sectoral interests, perfectly aligning with their commitment to ecosystem-based maritime governance.  \nGREEN_EFA perfectly aligns with the call for transboundary cooperation to combat microscopic plastic pollution and illegal fishing, recognizing these as critical to achieving the environmental prosperity central to the Atlantic strategy.  \nGREEN_EFA completely promotes the prioritization of marine energy interconnectors and maritime transport networks, which advance both climate objectives and regional economic resilience as outlined in their renewable energy advocacy.  \nGREEN_EFA applauds the issue’s integration of a bottom-up approach, ensuring local stakeholders shape policies that directly affect coastal communities’ ecological and socioeconomic futures.  \nGREEN_EFA highlights the issue’s alignment with their vision for multi-level governance, particularly through tools like the EGTC, to strengthen territorial cohesion without requiring new financial instruments."
      },
      {
        "party_name": "SD",
        "score": 0.9297297297297298,
        "choice": 9,
        "stance": "SD completely promotes the Atlantic strategy’s alignment with climate action and sustainable development priorities, perfectly reflecting S&D’s commitment to territorial cohesion and green transition.  \nSD perfectly aligns with integrating maritime safety enhancements for the Channel’s strategic gateway, proposing strengthened European coordination to address transport density and offshore energy synergies.  \nSD fully supports the strategy’s geopolitical focus on Atlantic connectivity to global markets, endorsing innovation in marine energy and biotechnology as critical to S&D’s economic resilience agenda.  \nSD endorses the issue’s multi-level governance model, emphasizing the necessity of regional authority participation to advance cohesion policy and stakeholder-driven implementation.  \nSD highlights the imperative of including Macaronesia’s outermost regions, aligning with S&D’s territorial equity principles to ensure no community is marginalized in EU-wide strategies."
      },
      {
        "party_name": "ECR",
        "score": 0.09259259259259259,
        "choice": 0,
        "stance": "ECR rejects the strategy's failure to mandate rigorous evaluation of existing INTERREG and cohesion programmes before launching new initiatives, conflicting with fiscal responsibility principles.  \nECR opposes the issue's omission of binding trans-Atlantic cooperation frameworks with the United States, a critical gap given shared Euro-Atlantic security and trade priorities.  \nECR fundamentally objects to the strategy's implicit reliance on EU funding expansion rather than reprioritising current budgets, contradicting austerity commitments.  \nECR condemns the lack of measurable safeguards against duplicative bureaucracy, which risks undermining national sovereignty in coastal management.  \nECR disputes the geopolitical relevance claims, arguing the text inadequately addresses NATO coordination and fails to counter third-state influence in Atlantic maritime zones."
      }
    ],
    "resolution": "The European Parliament raised the need for an integrated EU strategy for the Atlantic region, encompassing maritime and territorial issues, to enhance territorial cohesion and cooperation among five Atlantic Member States (France, Ireland, Portugal, Spain, and the UK). It emphasized leveraging existing cohesion policy frameworks, particularly Objective 3 (territorial cooperation), to coordinate multi-level governance, optimize funding without additional resources, and align with the EU 2020 strategy and post-2013 policies. The resolution highlighted priorities such as marine energy, climate action, maritime safety, transport networks (including short-sea shipping and projects like the Gijón-Nantes maritime road to reduce CO2 emissions), fisheries, tourism, and research. It stressed inclusivity for all Atlantic coastal regions, including Macaronesia’s outermost regions, and advocated for a bottom-up approach involving local authorities, stakeholders, and civil society. The strategy’s external dimension was noted for its geopolitical relevance in trade and security, while internal coordination with EU policies (e.g., maritime, energy, transport) was deemed critical. Simplified rules, multi-level governance, and the use of tools like the European Grouping of Territorial Cooperation (EGTC) were recommended to streamline implementation from 2014 onward, aligned with the next multiannual financial framework. The Parliament urged the Commission to prioritize synergies across policies, ensure efficient fund allocation, and maintain regular consultation with Parliament during strategy development.",
    "total_score": 0.8024523160762943,
    "total_choice": 8,
    "party_num": 4,
    "id": 10,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.1,
      0.7,
      0.1,
      0.1
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "regional development",
    "title": "Good governance and EU regional policy: REPORT on good governance with regards to the EU regional policy: procedures of assistance and control by the European Commission",
    "background": "The European Court of Auditors identified persistent irregularities in Structural Funds expenditure, prompting the European Commission to initiate supervisory reforms. Existing EU cohesion policy frameworks aimed to address regional disparities but faced challenges from administrative complexity and evolving geopolitical pressures. The Parliament will discuss governance mechanisms in EU regional policy, focusing on Commission assistance and control procedures.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.946360153256705,
        "choice": 9,
        "stance": "EPP absolutely upholds the issue's emphasis on compulsory multi-level governance across EU territorial policies, perfectly aligning with their decades-long advocacy for decentralized decision-making and regional legislative empowerment.  \nEPP perfectly aligns with the strengthened partnership principle requiring Member States to formally consult regional authorities on development priorities, as emphasized by Olbrycht's call for binding partnership agreements in cohesion contracts.  \nEPP fully supports the issue's demand for simplified funding architectures and lump-sum payments, mirroring Teixeira and Kelly's arguments for reducing administrative complexity to accelerate fund absorption.  \nEPP endorses the territorial cohesion mechanisms for cross-border cooperation, echoing Matera and Mikolášik's emphasis on leveraging border regions' economic synergies through streamlined partnerships.  \nEPP fully backs the issue's integration of cohesion policy with EU2020 strategy goals, aligning with Kozłowski and Jahr's insistence on measurable outcomes for regional competitiveness and crisis resilience."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.9454545454545454,
        "choice": 9,
        "stance": "GREEN_EFA completely upholds the issue's integration of sustainable low-carbon economy principles and biodiversity safeguards, perfectly aligning with their environmental transition priorities.  \nGREEN_EFA perfectly aligns with the issue's emphasis on multi-level governance and civil society partnerships, reflecting their longstanding advocacy for regional empowerment and participatory decision-making.  \nGREEN_EFA highlights the issue's advancement of ecological innovation through research frameworks, advocating for explicit prioritization of green economy metrics in competitiveness strategies.  \nGREEN_EFA fully supports the administrative capacity-building measures, including the \"Erasmus for elected local representatives,\" as a critical step toward equitable regional governance aligned with their principles.  \nGREEN_EFA endorses the rejection of cohesion policy renationalization and sustained EU funding post-2013, ensuring continuity in addressing territorial disparities through green investment."
      },
      {
        "party_name": "ECR",
        "score": 0.4444444444444444,
        "choice": 4,
        "stance": "ECR partially accepts the issue’s cohesion policy framework but demands explicit retention of GDP-based regional eligibility criteria to prevent arbitrary fund allocation.  \nECR objects to reduced financing for remote regions, insisting the issue must prioritize geographic balance over efficiency-driven cuts.  \nECR requests amendments to explicitly designate north-south infrastructural corridors in Western Europe as critical investments under territorial pacts.  \nECR supports higher co-financing rates but requires safeguards against diverting resources from less developed regions in Central/Southern Europe.  \nECR emphasizes that measurable result indicators must directly address growth disparities between \"old\" and \"new\" EU member states."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.5588235294117647,
        "choice": 5,
        "stance": "GUE_NGL supports the issue's emphasis on territorial cohesion but advises increasing the budgetary allocation to cohesion funds beyond current proposals to address deepening regional inequalities.  \nGUE_NGL recommends amending Clause 9 to explicitly prioritize public-sector investments in health, education, and earthquake protection over public-private partnerships that prioritize capital returns.  \nGUE_NGL expresses concern that the issue insufficiently challenges EU macro-economic policies exacerbating poverty through salary cuts and privatization, urging binding links between cohesion funding and social rights protections.  \nGUE_NGL advises incorporating measurable indicators for social cohesion in Article 6, including poverty reduction targets and minimum service accessibility standards aligned with sustainable development goals.  \nGUE_NGL calls for deletion of references to \"market liberalization competitiveness\" in Annex 3, proposing replacement language emphasizing job creation through localized green industrial strategies."
      }
    ],
    "resolution": "The European Parliament raised the need to strengthen multi-level governance and partnership in EU cohesion policy, emphasizing coordinated action among EU, national, regional, and local authorities, socio-economic partners, and NGOs to enhance legitimacy, transparency, and fund absorption. It highlighted systemic weaknesses in control mechanisms, citing a 12% error rate in 2006 and 11% in 2008 for unduly reimbursed cohesion funds, urging the Commission to improve audit systems, reduce administrative burdens, and prioritize result-oriented policies with measurable indicators. The resolution called for compulsory application of multi-level governance in EU policies with territorial impact, including integrated approaches addressing economic, social, and environmental challenges, tailored to regional specificities. It advocated for stronger regional involvement in program design, implementation, and decision-making, alongside simplified funding rules, harmonized Structural Funds, and wider use of lump-sum payments to boost efficiency. Administrative capacity-building at all levels, including training initiatives like an \"Erasmus for elected local representatives,\" and enhanced public consultation were stressed. The Parliament urged maintaining cohesion policy funding post-2013, rejecting renationalization, and demanded timely Commission proposals for the next programming period to avoid delays. It endorsed territorial pacts, a European multi-level governance label, and improved coordination within the Commission to ensure coherence, while promoting transparency, flexible crisis responses, and trust-based partnerships with Member States demonstrating effective fund use.",
    "total_score": 0.8367346938775511,
    "total_choice": 8,
    "party_num": 4,
    "id": 11,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.3,
      0.4,
      0.1,
      0.2
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "regional development",
    "title": "Regional strategies for industrial areas in the European Union: REPORT on regional strategies for industrial areas in the European Union",
    "background": "The European Union’s emphasis on economic cohesion, industrial competitiveness via structural funds, and challenges in adapting industrial regions to environmental and economic transitions prompted attention. The Parliament will discuss regional strategies for industrial areas to address structural economic shifts and cohesion policy alignment.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.8847583643122676,
        "choice": 8,
        "stance": "EPP strongly promotes the strategic use of EU structural funds for industrial revitalization, aligning perfectly with their longstanding commitment to regional economic resilience and sustainable job creation.  \nEPP approves the issue’s focus on sustainable production and energy-efficient technologies, which effectively advances their priority of decarbonizing industry while maintaining competitiveness.  \nEPP endorses the integration of gender and age considerations in regional strategies, reflecting their comprehensive approach to inclusive growth and social cohesion in industrial transitions.  \nEPP emphasizes the critical role of cultural industries and high-value craftsmanship in territorial reconversion, urging their explicit inclusion as innovative sectors under the issue’s investment priorities.  \nEPP proposes strengthening rural-urban synergies by linking industrial modernization with agricultural supply chains and vocational training systems, ensuring a holistic regional development framework."
      },
      {
        "party_name": "EFD",
        "score": 0.5161290322580645,
        "choice": 5,
        "stance": "EFD supports the issue’s emphasis on energy-efficient renovations but advises amending funding criteria to prioritize modernization of existing industrial assets like Prato’s textile districts rather than solely funding replacement sectors.  \nEFD endorses job creation through sustainable production yet proposes modifying Article 7 to include heritage status protections for legacy manufacturing ecosystems with proven technical expertise.  \nEFD agrees with leveraging structural funds for green transitions but urges explicit Cohesion Fund allocations to defend regionally vital industries such as Piombino’s steelworks from disproportionate phase-out pressures.  \nEFD concurs with reducing industrial footprints through smart transport solutions while emphasizing the need to retain core production capacities through updated emissions-reduction technologies.  \nEFD cautions against overreliance on cultural industries to replace traditional sectors, advocating balanced regional strategies that preserve historical supply chains alongside innovation investments."
      },
      {
        "party_name": "ALDE",
        "score": 0.8674698795180723,
        "choice": 8,
        "stance": "ALDE strongly advocates the issue’s emphasis on regional coordination with municipalities, aligning perfectly with ALDE’s longstanding commitment to decentralized governance and local economic empowerment.  \nALDE highlights the success of Bilbao’s transformation as a model for sustainable industrial renewal, demonstrating how regional strategies can drive innovation and citizen engagement.  \nALDE urges enhanced institutional recognition of regional identities in EU policy frameworks to maximize structural fund efficiency and grassroots development.  \nALDE proposes strengthening multi-level governance mechanisms to ensure regional expertise directly shapes industrial modernization and green investment priorities.  \nALDE approves the focus on public-private synergies for eco-innovation, noting its alignment with job creation and climate resilience goals in regional industrial strategies."
      },
      {
        "party_name": "SD",
        "score": 0.8842105263157894,
        "choice": 8,
        "stance": "SD strongly advocates the integration of EU structural funds to drive sustainable industrial transformation, aligning perfectly with SD's commitment to regional job creation and decarbonization through energy-efficient renovations.  \nSD applauds the issue's emphasis on public-private synergies in eco-innovation, which effectively advances SD's priority of transitioning industrial regions to high-value green technologies.  \nSD proposes enhancing fund allocation oversight to ensure strict alignment with inclusive reindustrialization goals, addressing concerns about misdirected investments in non-sustainable sectors.  \nSD endorses the call for gender- and age-sensitive regional strategies, recognizing this as critical to maximizing workforce potential in line with SD's social equity principles.  \nSD emphasizes the urgency of modernizing legacy industrial zones through smart transport solutions and repurposing port areas, a key opportunity to reduce environmental footprints without public debt burdens."
      }
    ],
    "resolution": "The European Parliament raised the importance of leveraging EU structural funds, including the European Regional Development Fund (ERDF) and Cohesion Fund, to advance renewable energy, energy efficiency, and sustainable production and consumption patterns. It emphasized energy-efficient building renovations as a means to reduce carbon emissions, create local jobs, and lower heating costs for consumers. The resolution called for synergies between public and private investments in eco-innovation, environmental technologies, and renewable energy to generate high-value jobs and address societal challenges, while stressing the need for budget-neutral restructuring of industrial areas using existing funds. It urged the continuation of state aid for large firms in sustainable industries under the 2014-2020 regional guidelines and highlighted the role of regional strategies in integrating gender and age considerations to avoid missed opportunities. Environmental protection measures, including alignment with the Waste, Water, and Air Quality Directives, were underscored, alongside sustainable transport solutions like waterways, rail networks, and smart distribution to reduce industrial footprints. The resolution advocated strict implementation of the Seveso III Directive to mitigate risks for citizens near industrial zones and promoted public participation in land-use planning. It noted the potential of modernizing outdated industrial areas with energy-efficient technologies and repurposing former industrial sites, such as port areas, to fund green investments and reduce reliance on public financing.",
    "total_score": 0.8196286472148541,
    "total_choice": 8,
    "party_num": 4,
    "id": 12,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.4,
      0.2,
      0.3,
      0.1
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "regional development",
    "title": "Territorial, social and economic cohesion: REPORT on achieving real territorial, social and economic cohesion within the EU – a sine qua non for global competitiveness?",
    "background": "Persistent regional economic disparities, global competition pressures, and challenges from demographic shifts, climate change, and infrastructure gaps prompted EU institutional focus on cohesion policies. The Parliament will discuss whether territorial, social, and economic cohesion is indispensable for enhancing the EU's global competitiveness through coordinated regional development strategies and funding frameworks.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.8659003831417624,
        "choice": 8,
        "stance": "EPP strongly promotes the issue's emphasis on multi-level governance and bottom-up approaches, aligning perfectly with EPP's longstanding commitment to subsidiarity and regional empowerment in cohesion policy implementation.  \nEPP approves maintaining GDP as the primary eligibility criterion while advocating enhanced regional management roles to address specific territorial challenges like depopulation, consistent with EPP's territorial justice principles.  \nEPP proposes simplifying fund access procedures and strengthening audit mechanisms to reduce error rates, enhancing cohesion policy's effectiveness without opposing its core architecture.  \nEPP applauds the focus on cross-border cooperation and urban-rural integration as critical drivers of EU competitiveness, matching EPP's 2023 priorities for interconnected regional economies.  \nEPP endorses decentralized fund management models that leverage regional expertise, noting this directly advances the Treaty of Lisbon's governance objectives as championed by EPP members."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.01818181818181818,
        "choice": 0,
        "stance": "GREEN_EFA opposes fundamentally the issue’s prioritization of GDP-driven growth metrics and infrastructure-centric cohesion, which neglects ecological transformation as a core competitiveness strategy.  \nGREEN_EFA rejects the failure to mandate green economy transitions in cohesion funding, contradicting their manifesto’s call for a binding \"Green New Deal\" to replace extractive growth models.  \nGREEN_EFA highlights the issue’s inconsistency with biodiversity safeguards, as it omits explicit criteria to align R&D investments with nature restoration or circular economy principles.  \nGREEN_EFA condemns the inadequate emphasis on civil society partnerships in governance, undermining grassroots-led territorial development central to Green/EFA’s multi-level democracy ethos.  \nGREEN_EFA underscores the proposal’s incompatibility with climate resilience goals by permitting remoteness or depopulation to remain secondary to GDP in fund allocation."
      },
      {
        "party_name": "SD",
        "score": 0.8387096774193549,
        "choice": 8,
        "stance": "SD strongly advocates maintaining or increasing cohesion policy funding to ensure equitable development and regional ownership, aligning with their commitment to reducing disparities and advancing sustainable growth.  \nSD approves enhancing multi-level governance and technical assistance for local authorities, crucial for effective fund management and aligning with SD’s focus on participatory governance and simplified access to resources.  \nSD advocates against punitive conditionality that penalizes regions for national government shortcomings, proposing collaborative frameworks to protect regional autonomy while ensuring accountability.  \nSD emphasizes the need for streamlined Structural Fund rules and reinforced oversight mechanisms to reduce administrative burdens, enhance transparency, and address ineligible expenditure risks.  \nSD highlights public-private partnerships and infrastructure investment as essential to cohesion policy, strongly endorsing their role in achieving EU 2020 goals and global competitiveness."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.0,
        "choice": 0,
        "stance": "GUE/NGL opposes fundamentally the issue's emphasis on capitalist competitiveness, which entrenches systemic inequalities inherent to EU economic policies.  \nGUE/NGL rejects the allocation of cohesion funds to public-private partnerships, arguing these prioritize capital returns over grassroots social needs like healthcare and education.  \nGUE/NGL condemns the issue's alignment with the EU 2020 strategy, viewing it as a vehicle for anti-worker restructuring and erosion of social rights.  \nGUE/NGL disputes the adequacy of GDP-based funding criteria, citing Latvia's poverty rates as proof of the policy's failure to address real territorial disparities.  \nGUE/NGL asserts that leaving the EU and pursuing socialist planned economies are necessary to achieve genuine cohesion, contrary to the issue’s market-driven framework."
      }
    ],
    "resolution": "The European Parliament raised the critical role of cohesion policy in reducing regional disparities, enhancing global competitiveness, and achieving EU 2020 strategy goals, emphasizing its necessity for sustainable, low-carbon economic growth and resilience against crises. It highlighted that €86 billion was allocated to R&D and innovation for 2007-2013, with €50 billion dedicated to core activities, stressing continued investment in these areas alongside infrastructure, education, and workforce development to address global challenges. The resolution underscored the interdependence of competitiveness and cohesion, advocating for a place-based approach to leverage regional strengths, address territorial disparities, and promote multi-level governance, with only 30.5% of cohesion funds currently managed by regions. It called for strengthened partnerships, simplified fund access for SMEs, and enhanced public-private collaborations, while maintaining GDP as the primary criterion for funding eligibility alongside region-specific factors like remoteness or depopulation. The Parliament urged alignment of cohesion policy with EU 2020 priorities—smart, sustainable, and inclusive growth—while preserving its independence to address regional needs, and stressed the importance of cross-border cooperation, urban-rural integration, and gender equality in driving economic growth. It advocated maintaining or increasing the cohesion budget post-2013 to ensure equitable development, support lagging regions, and consolidate progress in key sectors like energy, transport, and digital innovation, ensuring accessibility and social inclusion across all EU territories.",
    "total_score": 0.6680272108843538,
    "total_choice": 6,
    "party_num": 4,
    "id": 13,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.2,
      0.3,
      0.4,
      0.1
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "regional development",
    "title": "Smart specialisation: networking excellence for a sound Cohesion Policy: REPORT on smart specialisation: networking excellence for a sound Cohesion Policy",
    "background": "The European Union’s post-2013 Cohesion Policy reforms, aligned with Europe 2020 goals, emphasized regional innovation strategies, supported by Commission proposals (2011), OECD analysis (2012), and RIS3 guidelines. The Parliament will discuss integrating smart specialisation into cohesion frameworks to enhance regional competitiveness and research-driven growth.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.8321167883211679,
        "choice": 8,
        "stance": "EPP strongly endorses the regional smart specialization strategies as a catalyst for innovation-driven growth, aligning perfectly with their commitment to cohesion policy and Europe 2020 objectives.  \nEPP approves the emphasis on ex-ante conditionalities to ensure strategic alignment with EU priorities, effectively advancing competitiveness through ERDF and ESF synergies.  \nEPP proposes strengthening monitoring frameworks to safeguard R&D investment levels, ensuring the 3% GDP target remains a binding benchmark for member states.  \nEPP endorses cross-border knowledge transfer initiatives as critical for territorial cohesion, reflecting their longstanding advocacy for reducing regional disparities through collaborative ecosystems.  \nEPP emphasizes democratic stakeholder engagement in strategy design, ensuring local authorities, academia, and businesses jointly define comparative advantages."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.8103448275862069,
        "choice": 8,
        "stance": "GREEN_EFA strongly advocates the issue's emphasis on cross-regional cooperation and innovation ecosystems, aligning perfectly with their commitment to reducing disparities through collaborative knowledge transfer.  \nGREEN_EFA approves the integration of territorial cohesion in external cooperation, effectively advancing their priority of inclusive growth across EU regions.  \nGREEN_EFA proposes enhancing the Sevilla platform's accessibility to ensure all regions can actively contribute to smart specialization strategies, strengthening the issue's participatory framework.  \nGREEN_EFA applauds the focus on measurable innovation outputs, which matches their manifesto goals for transparent and accountable regional development policies.  \nGREEN_EFA recommends explicitly prioritizing youth engagement in RIS3 implementation to bridge future innovation needs, building on the issue's support for next-generation researchers."
      },
      {
        "party_name": "SD",
        "score": 0.8512820512820513,
        "choice": 8,
        "stance": "SD strongly agrees the emphasis on cross-border smart specialisation strategies, aligning with SD's longstanding commitment to territorial cohesion through shared innovation ecosystems and stakeholder collaboration.  \nSD approves the mandatory integration of research and innovation strategies for 2014-2020, proposing enhanced DG-led training to ensure regions maximize structural fund synergies as a minor operational refinement.  \nSD emphasizes the critical need for sustained R&D investment to match smart specialisation goals, urging member states to avoid funding cuts that undermine regional competitiveness and SD’s priority of reducing disparities.  \nSD applauds the focus on innovation incubators and creative industry linkages as a direct advancement of SD’s manifesto goals for inclusive, knowledge-driven growth.  \nSD highlights cross-regional knowledge transfer as pivotal to reducing inequalities, urging stricter ex-ante conditionalities to ensure private sector engagement aligns with EU-wide priorities."
      },
      {
        "party_name": "ECR",
        "score": 0.5087719298245614,
        "choice": 5,
        "stance": "ECR supports the principle of regional empowerment in smart specialisation strategies but advises enhancing administrative capacity-building programs to ensure effective fund utilization.  \nECR proposes amending ex-ante conditionalities to include mandatory assessments of regional implementation capabilities before allocating structural funds.  \nECR highlights concerns about overburdening regions with complex socio-economic challenges, urging phased capacity development aligned with national competency frameworks.  \nECR recommends strengthening central-level technical assistance mechanisms to support regions in accessing and managing cohesion policy instruments efficiently.  \nECR emphasizes the need for clear metrics tracking both innovation outputs and administrative efficiency gains to validate cohesion policy effectiveness."
      }
    ],
    "resolution": "The European Parliament raised the need to enhance cohesion policy post-2013 by aligning it with the Europe 2020 Strategy’s objectives for smart, sustainable, and inclusive growth, emphasizing innovation-driven regional development through smart specialization strategies (RIS3). It stressed the importance of synergies between the European Regional Development Fund (ERDF), European Social Fund, and other structural funds to maximize efficiency, avoid duplication, and support cross-regional cooperation. The resolution highlighted the role of regions in fostering innovation ecosystems through closer collaboration with businesses, universities, and research institutions, while advocating for stronger ex-ante conditionalities to ensure strategic alignment with EU priorities. It called for integrating territorial cohesion into external cooperation to address disparities and promote knowledge transfer, particularly in cross-border initiatives. The Parliament underscored the need for measurable innovation outputs and urged coherence between regional policies and broader EU frameworks, such as the Innovation Union and Research and Development programs, to strengthen competitiveness and reduce economic, social, and territorial inequalities.",
    "total_score": 0.7545691906005222,
    "total_choice": 7,
    "party_num": 4,
    "id": 14,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.3,
      0.3,
      0.2,
      0.2
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "regional development",
    "title": "Risk sharing instruments for Member States experiencing or threatened with serious difficulties with respect to their financial stability: REPORT on the proposal for a regulation of the European Parliament and of the Council amending Council Regulation (EC) No 1083/2006 as regards certain provisions relating to risk-sharing instruments for Member States experiencing or threatened with serious difficulties with respect to their financial stability",
    "background": "Following the 2008 financial crisis and subsequent sovereign debt challenges, several EU Member States faced severe financial instability, impacting cohesion policy implementation due to constrained private investment and banking sector liquidity issues. The Parliament will discuss regulatory amendments to establish risk-sharing instruments enabling access to finance for infrastructure and productive investments in affected states.",
    "stances": [
      {
        "party_name": "ALDE",
        "score": 0.8433734939759037,
        "choice": 8,
        "stance": "ALDE strongly upholds the adoption of risk-sharing instruments as a vital mechanism to stabilize Member States’ economies, aligning perfectly with ALDE’s commitment to pragmatic financial solidarity and crisis-responsive cohesion policy.  \nALDE approves the emphasis on rigorous project evaluations, proposing enhanced cost-benefit analyses to ensure funded initiatives directly boost job creation and long-term competitiveness without opposing the instrument’s core structure.  \nALDE endorses the European Investment Bank’s pivotal role in deploying these instruments, emphasizing the need for swift operationalization to maximize impact within the 18-month implementation window.  \nALDE highlights the issue’s alignment with economic governance reforms, particularly its reinforcement of budgetary oversight to prevent fiscal mismanagement while maintaining flexibility for crisis-hit states.  \nALDE commends the procedural safeguards requiring Commission re-engagement with Parliament on substantive amendments, ensuring institutional accountability matches ALDE’s transparency principles."
      },
      {
        "party_name": "SD",
        "score": 0.8802083333333334,
        "choice": 8,
        "stance": "SD strongly agrees the risk-sharing mechanism as a critical tool to maintain private investment in crisis-affected Member States, aligning with their commitment to economic cohesion and crisis response.  \nSD approves leveraging cohesion policy funds to multiply investment impact, particularly noting Greece’s potential for job creation and infrastructure completion through enhanced financial instruments.  \nSD proposes enhanced monitoring provisions to ensure the mechanism does not disproportionately affect less-developed regions, suggesting explicit safeguards in Article 4 implementation guidelines.  \nSD endorses the efficient use of existing allocations through risk coverage, emphasizing how guaranteed loans can generate greater economic activity than direct project funding.  \nSD emphasizes the urgency of swift implementation for pre-approved projects in Greece, urging immediate operationalization of the regulation to address acute crisis effects."
      },
      {
        "party_name": "ECR",
        "score": 0.03636363636363636,
        "choice": 0,
        "stance": "ECR rejects the reliance on cohesion policy funds for loan guarantees as creating future debt risks  \nECR opposes fundamentally any market interference requiring public guarantees for EIB lending criteria  \nThis proposal conflicts with ECR's principle that banks must independently assess creditworthiness without subsidy distortions  \nThe issue overlooks critical fiscal responsibility aspects by prioritizing liquidity over repayment assurance mechanisms  \nECR contends the instrument's design contradicts sound economic governance through artificial risk-sharing provisions"
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.0,
        "choice": 0,
        "stance": "GUE_NGL absolutely doubts the transfer of Structural and Cohesion Funds to cover private investor losses, which contradicts their stance against austerity and financialization of public resources.  \nGUE_NGL rejects the reduction of allocations to crisis-hit Member States as antithetical to their demand for increased EU solidarity through direct fiscal support.  \nThe proposal's alignment with IMF/EU austerity programs conflicts with GUE_NGL's commitment to challenging regressive financial mechanisms that burden working-class populations.  \nGUE_NGL condemns the prioritization of private banking interests over public welfare, a recurring flaw in EU crisis responses that exacerbates social inequality.  \nThe issue's failure to address alternative investment strategies reveals its incompatibility with GUE_NGL's vision of democratic economic planning and public-led recovery."
      }
    ],
    "resolution": "The European Parliament raised its position on the Commission’s 2011 proposal (COM(2011)0655) concerning regional development and economic cohesion, emphasizing alignment with Treaty on the Functioning of the European Union provisions (Articles 294(2), 177, and 294(3)) and incorporating the European Economic and Social Committee’s 8 December 2011 opinion. The resolution endorsed measures to strengthen budgetary oversight, economic governance, and regional policy coherence, reflecting inputs from the Committee on Regional Development, the Committee on Budgetary Control, and the Committee on Economic and Monetary Affairs as outlined in report A7-0067/2012. It urged the Commission to re-engage Parliament if proposing substantial amendments to the original text and directed the Parliament’s President to transmit its formal position to the Council, Commission, and national parliaments, ensuring procedural continuity and institutional accountability.",
    "total_score": 0.6684350132625995,
    "total_choice": 6,
    "party_num": 4,
    "id": 15,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.1,
      0.7,
      0.1,
      0.1
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "regional development",
    "title": "Role of EU cohesion policy in implementing the new European energy policy: REPORT on the role of EU cohesion policy and its actors in implementing the new European energy policy",
    "background": "The European Union established energy policy objectives (security, sustainability, competitiveness) through treaties and strategic frameworks (Energy 2020, Energy Roadmap 2050), while cohesion policy prioritized regional development via Structural Funds. Rising energy costs, infrastructure disparities, and alignment challenges between energy transition goals and regional investment mechanisms created operational tensions. The Parliament will discuss integrating cohesion policy instruments with EU energy priorities to address territorial disparities and market integration.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.8740740740740741,
        "choice": 8,
        "stance": "EPP strongly advocates the prioritization of urban development within cohesion policy, aligning with the issue's call to link city strategies with Europe 2020 goals through smart specialization and integrated territorial investments.  \nEPP totally advocates simplifying administrative procedures for fund access, proposing enhanced technical assistance to help regions meet thresholds while maintaining the 20% energy efficiency allocation.  \nEPP approves cross-border energy infrastructure projects as essential for eliminating energy isolation, urging accelerated implementation of smart grid initiatives through reinforced INTERREG cooperation.  \nEPP emphasizes the critical role of cohesion funds in building renovation programs, particularly welcoming the focus on district heating upgrades as matching EPP's climate-neutral cities agenda.  \nEPP advocates maintaining strict alignment between national partnership agreements and EU energy targets, suggesting quarterly monitoring reports to ensure fossil fuel-dependent regions meet transition timelines."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.017241379310344827,
        "choice": 0,
        "stance": "GREEN_EFA rejects the issue's failure to explicitly exclude fossil fuel infrastructure like LPG/LNG in off-grid areas, entirely condemning with their mandate for 100% renewable energy transitions.  \nGREEN_EFA opposes the ambiguous definition of \"transnational energy sources\" as dangerously permitting shale gas exploitation, directly contradicting their ban on extractive hydrocarbons.  \nGREEN_EFA condemns the issue’s tolerance for large-scale renewable energy exports over local distribution networks, which perpetuates energy poverty in producing regions.  \nGREEN_EFA highlights the issue’s inadequate simplification of cohesion fund access, failing to abolish prohibitive thresholds that exclude rural communities from climate resilience projects.  \nGREEN_EFA disputes the prioritization of market-driven energy strategies over binding mechanisms to prevent corporate capture of renewable subsidies, undermining just transition principles."
      },
      {
        "party_name": "SD",
        "score": 0.8848167539267016,
        "choice": 8,
        "stance": "SD strongly advocates the issue’s emphasis on combating energy poverty through cohesion funds, aligning with their commitment to equitable access to affordable energy in vulnerable regions.  \nSD applauds the focus on regional flexibility and diverse energy solutions, including renewables and transitional fuels like biogas, which effectively advances SD’s vision of inclusive, context-sensitive energy transitions.  \nSD proposes increasing the minimum allocation for energy-efficient housing renovations to 10-15% of ERDF funds to accelerate urban sustainability, enhancing the issue’s impact on energy poverty reduction.  \nSD strongly endorses simplifying fund access for small communities, as bureaucratic barriers disproportionately hinder rural and less-developed regions from achieving energy autonomy.  \nSD highlights the issue’s alignment with job creation through green energy projects, exemplified by successful cohesion-funded initiatives in sustainable transport and smart grids."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.0,
        "choice": 0,
        "stance": "GUE_NGL rejects the issue’s emphasis on channeling cohesion funds to large corporate interests, which absolutely disapproves with their demand for public investment in free transportation, disaster prevention, and education infrastructure.  \nGUE_NGL opposes the inadequate budget allocations for cohesion policy, highlighting that proposed cuts contradict the urgent need to address social inequality and urban-rural divides.  \nGUE_NGL condemns the issue’s alignment with the Europe 2020 strategy, which they argue exacerbates capitalist crises by prioritizing private profit over workers’ needs.  \nGUE_NGL absolutely opposes the failure to substantially increase cohesion funding, warning that current proposals will deepen regional disparities and economic divergence.  \nGUE_NGL criticizes the issue’s bureaucratic mechanisms for fund access, arguing they perpetuate exclusion of small communities and fail to address energy poverty in vulnerable households."
      }
    ],
    "resolution": "The European Parliament raised the need to align cohesion policy with EU energy objectives under the Europe 2020 strategy, emphasizing investments in energy efficiency, renewable energy, and low-carbon infrastructure to achieve smart, sustainable, and inclusive growth. It stressed that cohesion funds, including the Structural Funds and Cohesion Fund, should prioritize projects contributing to regional development, job creation, and energy poverty reduction, particularly in less-developed regions, while ensuring 20% of funding for energy efficiency and 6% for renewables. The resolution highlighted the importance of simplifying access to these funds, reducing bureaucratic barriers, and enhancing administrative capacity to improve absorption rates, especially for small communities and rural areas facing challenges with large funding thresholds (e.g., ELENA’s €50 million minimum). It advocated for flexible, region-specific energy strategies, cross-border cooperation, and smart grids to integrate renewable sources and eliminate energy isolation by 2015. The Parliament called for leveraging financial instruments like JESSICA and the Connecting Europe Facility to modernize energy infrastructure, support Smart Cities initiatives, and promote synergies between public and private funding. It underscored the role of cohesion policy in transitioning fossil fuel-dependent regions to sustainable energy, addressing energy price impacts on vulnerable households, and balancing climate goals with regional competitiveness. Additionally, the resolution urged VAT reductions for energy-efficient projects, prioritized local renewable distribution over large-scale transmission, and emphasized the need for rural-focused energy strategies, including microgeneration and LPG/LNG alternatives in off-grid areas. Achieving the 20% energy efficiency target by 2020 was deemed critical to reducing fossil fuel imports by 25%, with cohesion funds playing a pivotal role in building renovations, public transport, and district heating upgrades.",
    "total_score": 0.7029177718832891,
    "total_choice": 7,
    "party_num": 4,
    "id": 16,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.1,
      0.2,
      0.5,
      0.2
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "regional development",
    "title": "Role of territorial development in cohesion policy: REPORT on optimising the role of territorial development in cohesion policy",
    "background": "The Lisbon Treaty established territorial cohesion as a core EU objective, with cohesion policy historically targeting regional disparities through structural funds. Proposed 2014-2020 regulatory frameworks sought improved coordination across EU funding instruments and integration of territorial strategies into regional development. The Parliament will discuss optimizing territorial development's role in cohesion policy to address regional challenges and EU-wide cohesion goals.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.7888888888888889,
        "choice": 7,
        "stance": "EPP strongly sanctions the integration of urban development with Europe 2020 goals through minimum 5% funding allocations, aligning perfectly with EPP's commitment to smart city ecosystems.  \nEPP approves enhanced multi-level governance models like Greater Manchester's ITI framework, effectively advancing territorial cohesion priorities through cross-fund coordination.  \nEPP endorses administrative simplification measures for cohesion funds, mirroring EPP's manifesto pledge to reduce bureaucratic barriers for SME access.  \nEPP proposes streamlining European Solidarity Fund activation timelines to address disaster response delays while maintaining rigorous accountability checks.  \nEPP advocates expanding communication strategies about cohesion investments to citizens, enhancing visibility of EU value-added without altering budget allocations."
      },
      {
        "party_name": "ALDE",
        "score": 0.7108433734939759,
        "choice": 7,
        "stance": "ALDE strongly agrees the issue’s emphasis on urban development and cohesion policy as vital tools for economic revitalization, aligning perfectly with ALDE’s commitment to reducing territorial disparities and boosting competitiveness.  \nALDE endorses the integration of energy efficiency investments and multi-level governance, which aligns with their longstanding advocacy for streamlined administrative procedures and local authority empowerment.  \nALDE proposes strengthening provisions for renewable energy funding within cohesion policy to maximize job creation in remote regions, enhancing the issue’s alignment with climate goals.  \nALDE highlights the critical need to safeguard regional cooperation programs from budget cuts, ensuring cross-border best practice exchanges remain central to territorial cohesion.  \nALDE applauds the focus on simplified fund absorption mechanisms and results-driven flexibility, reflecting their priority of reducing bureaucracy while maintaining accountability."
      },
      {
        "party_name": "SD",
        "score": 0.7277486910994765,
        "choice": 7,
        "stance": "SD strongly sanctions the issue’s emphasis on multi-level governance and integrated territorial investments, aligning perfectly with S&D’s commitment to empowering regional actors in cohesion policy design. This mirrors proposals by Krehl and De Angelis for deepened partnership principles and localized fund combinations.  \n\nSD approves the prioritization of combating energy poverty and renewable energy transitions through cohesion instruments, as stressed by Olejniczak and Neveďalová, which synergize with Horizon 2020 innovation goals outlined in the issue.  \n\nSD proposes amending Article 12 to increase flexibility for energy-efficient housing funds from 4% to 10% of ERDF allocations, addressing Ţicău’s call for enhanced urban sustainability tools while maintaining the issue’s focus on territorial adaptability.  \n\nSD strongly sanctions maintaining cohesion funding levels for disadvantaged regions, as demanded by Tabajdi and Sehnalová, to prevent austerity-driven disparities—a stance perfectly aligned with the issue’s budget defense against cuts.  \n\nSD endorses cross-border cooperation extensions to outermost regions like the Azores, per Alves’ argument, urging an amendment to Section 9.2 to include RUP territories in transnational programs without opposing the issue’s core territorial cohesion framework."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.0,
        "choice": 0,
        "stance": "GUE/NGL rejects the issue's approach to cohesion policy as fundamentally inadequate given proposed budget cuts, which contradict their demand for substantial funding increases to address regional inequalities.  \nGUE/NGL opposes the prioritization of private-sector financial instruments and corporate partnerships, arguing this redirects public funds toward capitalist interests rather than public services like housing and education.  \nGUE/NGL condemns the alignment with Europe 2020 strategies, citing evidence that 63% of Greek cohesion funds enrich monopolies while austerity exacerbates geographic and social disparities.  \nGUE/NGL firmly disapproves with the issue’s reliance on market-driven territorial development, which fails to prevent urban segregation of marginalized groups like Roma or reverse rural depopulation dynamics.  \nGUE/NGL highlights the proposal’s failure to acknowledge systemic flaws, noting that reduced budgets and fragmented funding mechanisms deepen divergence rather than cohesion."
      }
    ],
    "resolution": "The European Parliament raised the critical role of cohesion policy in reducing economic, social, and territorial disparities across EU regions, advocating for maintaining its post-2013 budget at current levels to sustain support for disadvantaged areas. It emphasized a multi-level governance approach, requiring collaboration across European, national, regional, and local levels in planning and implementing funding programs, alongside simplified administrative procedures and results-driven flexibility to enhance effectiveness. The resolution endorsed integrating funds (ERDF, ESF, Cohesion Fund, EARDF, EMFF) through mechanisms like community-led local development (CLLD), integrated territorial investments (ITIs), and joint action plans, highlighting examples such as Wales’ single funding portal and Greater Manchester’s cross-fund ITI model. It stressed aligning cohesion policy with Europe 2020 goals, particularly employment, education, and poverty reduction, while fostering synergies with Horizon 2020 and LIFE+ for innovation and research. The Parliament underscored the importance of territorial cohesion, supporting urban-rural linkages, SMEs, vocational training, and addressing challenges in cross-border, mountain, island, and outermost regions. It advocated leveraging financial instruments to attract private investment, improving healthcare access via broadband and telemedicine, and combating youth unemployment and social exclusion through targeted, region-specific strategies. The resolution also called for balanced checks on fund use, stakeholder involvement, and capacity-building to ensure cohesive, sustainable development across all EU territories.",
    "total_score": 0.656498673740053,
    "total_choice": 6,
    "party_num": 4,
    "id": 17,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.3,
      0.1,
      0.4,
      0.2
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "regional development",
    "title": "Urban redevelopment as contribution to economic growth: REPORT on urban re-development as contribution to economic growth in the framework of the EU Cohesion Policy",
    "background": "High urban population concentration in EU member states, combined with economic crisis impacts, climate change challenges, and social inequalities in cities, necessitated strategic urban development approaches under existing cohesion policy frameworks. The Parliament will discuss optimizing urban redevelopment initiatives within EU regional policy to address economic growth and territorial disparities.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.7444444444444445,
        "choice": 7,
        "stance": "EPP strongly sanctions the issue's emphasis on integrated urban-rural development as aligning perfectly with EPP's commitment to territorial cohesion, particularly the requirement to allocate minimum 5% ERDF resources for sustainable city regeneration.  \nEPP totally approves linking urban agenda objectives to Europe 2020 targets through energy-efficient housing upgrades and green space preservation, which matches EPP's climate action priorities in the 2023 Work Programme.  \nEPP approves the focus on empowering local authorities in programming decisions, proposing enhanced technical assistance for municipalities to streamline fund absorption rates while maintaining rigorous accountability standards.  \nEPP highlights opportunities to strengthen disaster response mechanisms by amending Solidarity Fund activation thresholds to enable faster disbursement during regional emergencies like those experienced in Madeira and Slovenia.  \nThis issue effectively advances EPP's advocacy for smart specialization strategies, particularly through Horizon 2020 synergies to boost innovation in urban mobility systems and brownfield redevelopment projects."
      },
      {
        "party_name": "EFD",
        "score": 0.2903225806451613,
        "choice": 2,
        "stance": "EFD rejects the issue's climate-aligned ERDF allocation mandates as incompatible with national energy sovereignty, directly opposing Poland's shale gas development priorities.  \nEFD totally againsts with the issue's low-emission transition requirements, warning they will devastate Central Europe's fossil-dependent industries through forced renewable adoption.  \nThe proposal overlooks critical EFD demands to eliminate bureaucratic delays in disaster relief funds, contradicting urgent Veneto flood recovery experiences.  \nEFD opposes integrated urban-rural synergy provisions as undermining local autonomy, advocating instead for hyper-localized energy and infrastructure strategies.  \nThis issue's climate logic totally againsts with EFD's position that pollution reduction must not prioritize renewables over affordable coal alternatives."
      },
      {
        "party_name": "SD",
        "score": 0.6910994764397905,
        "choice": 6,
        "stance": "SD supports the issue's emphasis on ERDF allocations for sustainable urban development but advises increasing the minimum energy efficiency housing funding threshold to 10-15% to adequately address thermal renovation backlogs and public transport modernization.  \n\nSD endorses combating spatial segregation through urban-rural synergies but proposes amending Article 9 to explicitly include cross-border cooperation with non-EU territories like the Azores, leveraging diaspora networks for economic revitalization.  \n\nSD approves the focus on marginalized neighborhoods yet cautions against competitive CEF funding models, urging retention of dedicated cohesion envelopes for less-developed regions to prevent infrastructure disparities.  \n\nSD welcomes simplified Solidarity Fund activation procedures but recommends adding mandatory technical assistance provisions for local authorities in Article 6 to accelerate disaster relief applications while maintaining audit rigor.  \n\nSD aligns with integrated territorial approaches but suggests reinforcing multilevel governance through binding consultation mechanisms for city councils in operational program design, particularly for cultural heritage preservation projects."
      },
      {
        "party_name": "ECR",
        "score": 0.32727272727272727,
        "choice": 3,
        "stance": "ECR partly accepts urban development funding but requests revisions to Article 5, demanding explicit safeguards against fund misuse in line with concerns over projects like unnecessary noise barriers.  \nECR entirely disapproves the issue’s focus on cities without proportional rural inclusion, citing warnings about neglecting smaller municipalities and agricultural regions dependent on agricultural development funds.  \nThe proposal overlooks critical ECR demands for mandatory administrative capacity assessments before allocating ERDF resources, contradicting the principle that only cities with proven fiscal management should handle large budgets.  \nECR rejects the budget maintenance stance as inconsistent with calls for structural fund efficiency and measurable savings in cohesion spending, particularly given unresolved audit irregularities.  \nECR demands amendment of Clause 12 to require single regional portals for all EU fund access, aligning with simplification proposals to reduce bureaucratic barriers for under-resourced municipalities."
      }
    ],
    "resolution": "The European Parliament raised concerns that 80% of EU citizens live in urban areas facing intensified challenges from climate change, economic crises, social exclusion, and environmental pollution, urging integrated, sustainable urban development. It stressed the need for medium-to-long-term action plans to enhance economic, social, and territorial cohesion, regenerate marginalized neighborhoods, repurpose disused spaces, and preserve cultural heritage while promoting social inclusion and citizen participation. The resolution called for allocating at least 5% of European Regional Development Fund (ERDF) resources to sustainable urban development managed by cities, emphasizing energy-efficient housing, green spaces, sustainable mobility, and resilience against natural disasters. It highlighted the role of urban areas in achieving Europe 2020 goals, advocating integrated approaches linking environmental, cultural, and economic priorities, and fostering urban-rural synergies to prevent spatial segregation. The Parliament urged leveraging Horizon 2020 and Covenant of Mayors initiatives for innovation, improved multilevel governance, and technical assistance to local authorities for effective fund management. It prioritized combating energy inefficiency, waste management, water quality, and addressing inequalities through housing policies and service accessibility, while warning against gentrification risks and advocating inclusive planning to protect vulnerable groups.",
    "total_score": 0.6273209549071618,
    "total_choice": 6,
    "party_num": 4,
    "id": 18,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.1,
      0.1,
      0.2,
      0.6
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "regional development",
    "title": "Cohesion policy and review of the Europe 2020 strategy: REPORT on cohesion policy and the review of the Europe 2020 strategy",
    "background": "Persistent economic disparities, uneven recovery post-financial crisis, and delayed implementation of cohesion funds under the Europe 2020 strategy prompted scrutiny. The European Commission’s sixth cohesion report (2014) and mid-term review of the strategy highlighted gaps in achieving employment, innovation, and sustainability targets. The Parliament will discuss cohesion policy’s alignment with the Europe 2020 framework.",
    "stances": [
      {
        "party_name": "EFDD",
        "score": 0.02564102564102564,
        "choice": 0,
        "stance": "EFDD rejects the cohesion policy's emphasis on wealth redistribution as a socialist overreach incompatible with national sovereignty.  \nEFDD opposes the EU's use of cohesion funds to assume nation-state functions like job creation and poverty reduction, which belong to member states.  \nThis issue fully rejects with EFDD's anti-federalist stance by advancing a \"United States of Europe\" through centralized investment tools like EFSI.  \nThe proposal’s multi-level governance framework is deemed an attack on subsidiarity, imposing EU priorities over regional self-determination.  \nEFDD condemns the Europe 2020 strategy’s integration with cohesion policy as a vehicle for supranational state-building, rejecting all budget allocations for this purpose."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.8863636363636364,
        "choice": 8,
        "stance": "GREEN_EFA strongly upholds the emphasis on macroregional strategies as vital tools for European integration and cross-border cooperation, aligning perfectly with their commitment to territorial cohesion and shared environmental challenges.  \nGREEN_EFA applauds the issue’s focus on sustainable renewable energy development and intermodal infrastructure, which effectively advances their priority of climate-resilient, green economic transitions.  \nGREEN_EFA approves the inclusion of environmental safeguards for high-risk Adriatic oil and gas exploration, recognizing this as critical progress toward balancing energy needs with ecological protection.  \nGREEN_EFA proposes refining the macroeconomic conditionality mechanism to prevent disproportionate penalties on regional actors, ensuring cohesion policy remains shielded from national governance failures.  \nGREEN_EFA endorses the issue’s vision for green job creation in macroregions, which aligns with their manifesto goals of combating unemployment through sustainable growth models."
      },
      {
        "party_name": "SD",
        "score": 0.9127906976744186,
        "choice": 9,
        "stance": "SD absolutely upholds the issue's emphasis on territorial cohesion as perfectly aligning with their commitment to address regional disparities through direct citizen engagement in Adriatic-Ionian macro-regional strategies.  \nSD perfectly aligns with the call to prioritize simplification of cohesion funds administration, transforming procedural critiques into enhanced governance frameworks that maintain rigorous oversight while accelerating project implementation.  \nSD absolutely upholds the issue's cautious application of macroeconomic conditionality, reinforcing Victor Boştinaru's stance that Article 23 must only serve as an exceptional measure to protect long-term cohesion investments from austerity-driven penalties.  \nSD perfectly aligns with the integration of refugee crisis responses into cohesion programming, endorsing Andrea Cozzolino's emphasis on flexible fund reallocation to meet urgent social needs without disrupting strategic objectives.  \nSD absolutely upholds the issue's focus on youth employment and education investments as critical to achieving Europe 2020 targets, echoing Момчил Неков's demand for sustained human capital development in peripheral regions."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.0,
        "choice": 0,
        "stance": "GUE/NGL fundamentally condemns Article 23 as an undemocratic austerity tool that subordinates cohesion policy to macroeconomic surveillance, directly contradicting solidarity principles.  \nGUE/NGL rejects the institutionalization of macroeconomic conditionality for Structural Funds, arguing this imposes centralized austerity diktats on regional authorities and penalizes communities for national-level fiscal decisions.  \nGUE/NGL condemns the issue’s failure to decouple cohesion funding from European Semester recommendations, which perpetuate neoliberal frameworks that exacerbate regional inequalities and public service cuts.  \nGUE/NGL demands full removal of deficit-linked fund suspensions, highlighting how these mechanisms punish vulnerable populations for financial crises caused by banking speculation and Troika-imposed austerity.  \nGUE/NGL opposes the issue’s implicit endorsement of cohesion policy’s alignment with failing monetary union structures, citing Portugal’s accelerated divergence under current austerity-compliant investment models."
      }
    ],
    "resolution": "The European Parliament raised concerns and outlined key priorities regarding the EU’s cohesion policy and its alignment with the Europe 2020 strategy, emphasizing its role as the Union’s primary investment tool with a budget of €351.8 billion until 2020 to reduce regional disparities, promote sustainable growth, and address crises like high unemployment and uneven economic recovery. It stressed the need for stronger multi-level governance, territorial cohesion, and synergies between cohesion policy and other EU initiatives, such as the European Fund for Strategic Investments (EFSI), which aims to mobilize €315 billion for strategic projects, while ensuring complementarity with European Structural and Investment Funds (ESI Funds). The resolution highlighted delays in implementing the 2014-2020 cohesion programmes, despite increased allocations for R&D, SMEs, climate action, and social inclusion, and called for improved coordination with the Europe 2020 strategy’s objectives—employment, innovation, climate sustainability, education, and poverty reduction—through enhanced governance, performance frameworks, and ex-ante conditionalities linked to country-specific recommendations. It urged a territorial approach to address diverse regional needs, including rural, cross-border, and outermost regions, and emphasized the role of cities and macro-regional strategies in driving growth. The Parliament advocated for a mid-term review of the Europe 2020 strategy to strengthen ownership by local and regional actors, improve result-oriented indicators beyond GDP, and integrate gender equality and social inclusion, while avoiding disruptive reprogramming of cohesion policy. It also highlighted the importance of Horizon 2020 synergies, administrative capacity-building, and future cohesion policy post-2020, stressing the need for sustained funding and coherence with the EU’s long-term strategic goals.",
    "total_score": 0.7123695976154992,
    "total_choice": 7,
    "party_num": 4,
    "id": 19,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.1,
      0.3,
      0.3,
      0.3
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "regional development",
    "title": "Cohesion policy and the circular economy: REPORT on cohesion policy and the circular economy",
    "background": "The EU's 2015 Circular Economy Action Plan and cohesion policy funding frameworks prioritized sustainable development, waste reduction, and regional competitiveness, while China’s 2018 ban on waste imports intensified pressure to improve recycling infrastructure. The Parliament will discuss aligning post-2020 cohesion policy with circular economy goals to address resource efficiency, regional disparities, and climate commitments.",
    "stances": [
      {
        "party_name": "EFDD",
        "score": 0.35714285714285715,
        "choice": 3,
        "stance": "EFDD conditionally endorses the issue’s illegal landfill remediation targets but demands explicit EU-funded emergency measures for regions like Campania, where decades of criminal waste mismanagement require immediate health-focused interventions.  \nEFDD requests revisions to Article 17 financial clauses to mandate that infringement fines fund local environmental rehabilitation rather than replenish the EU budget, as penalizing citizens for systemic governance failures exacerbates economic disparities.  \nEFDD opposes the issue’s reliance on infringement procedures as fundamentally inconsistent with cohesion principles, arguing that fines against member states contradict territorial equality goals and indirectly harm affected populations.  \nEFDD challenges the waste hierarchy implementation guidelines for overlooking mafia infiltration in waste sectors, proposing binding amendments to integrate EU anti-corruption audits into cohesion-funded circular economy projects.  \nEFDD rejects the presumption of uniform regional recycling capacity, urging amended conditionalities acknowledging organized crime’s stranglehold on Southern Europe’s waste systems and allocating dedicated cohesion funds to dismantle it."
      },
      {
        "party_name": "ENF",
        "score": 0.14285714285714285,
        "choice": 1,
        "stance": "ENF fundamentally rejects the centralized EU funding mechanisms, which contradict their principle of subsidiarity in managing waste through local employment initiatives.  \nENF rejects binding ex-ante conditionalities as an infringement on national sovereignty, arguing they stifle member states' autonomy to design region-specific circular economy programs.  \nThe issue's emphasis on EU-wide taxation and harmonized regulations conflicts with ENF's advocacy for decentralized decision-making on recycling infrastructure and job creation.  \nENF criticizes the proposal's reliance on large-scale cross-border projects, which overlook critical local economic priorities like low-skilled job retention in vulnerable communities.  \nThe issue's focus on globalized financing mechanisms fails to address ENF's demand for hyper-localized waste processing to minimize transport emissions and strengthen community self-sufficiency."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.9,
        "choice": 9,
        "stance": "GREEN_EFA fully sanctions the issue's integration of circular economy principles into education and vocational training, perfectly aligning with their manifesto's emphasis on systemic ecological literacy.  \nGREEN_EFA perfectly aligns with binding ex-ante conditionalities for cohesion funding, ensuring compliance with waste hierarchy priorities that prevent incineration overuse as long advocated by the party.  \nGREEN_EFA fully sanctions leveraging €150 billion in cohesion funds for circular infrastructure, recognizing cities as critical transformation hubs matching their urban sustainability agendas.  \nGREEN_EFA perfectly aligns with the call to remediate illegal landfills and boost bioeconomy innovations, directly advancing their zero-waste and climate neutrality roadmaps.  \nGREEN_EFA fully sanctions strict tracking methodologies for circularity progress, a demand consistently raised in their parliamentary oversight initiatives since 2019."
      },
      {
        "party_name": "SD",
        "score": 0.9411764705882353,
        "choice": 9,
        "stance": "SD completely approves the issue’s prioritization of local and regional authorities in circular economy strategies, aligning perfectly with SD’s commitment to subsidiarity and community-led sustainability transitions.  \nSD perfectly aligns with the call for binding ex-ante conditionalities in cohesion policy, ensuring compliance with circular economy goals while safeguarding regional autonomy through tailored financial and functional support.  \nSD completely approves the issue’s emphasis on Green Public Procurement as a transformative lever, matching SD’s 2023 manifesto pledge to amplify market incentives for circular products and SMEs.  \nSD applauds the focus on remediating illegal landfills and enhancing waste hierarchy adherence, which directly advances SD’s environmental justice agenda to protect vulnerable communities from hazardous waste impacts.  \nSD underscores the critical integration of circular economy principles into vocational training and smart specialization strategies, reflecting SD’s longstanding advocacy for green skills and inclusive growth."
      }
    ],
    "resolution": "The European Parliament raised the critical role of cohesion policy in advancing the circular economy, emphasizing the need to align post-2020 funding with EU climate and sustainability goals. It highlighted that cities, responsible for 75% of global resource consumption and 60-80% of greenhouse gas emissions, require targeted investments in waste reduction, recycling infrastructure, and renewable energy to meet 2030 and 2035 EU waste targets. Noting that 60% of EU waste remains unrecycled, the resolution urged leveraging €150 billion in 2014-2020 EU funds for circular economy projects, alongside €2.4 billion in EIB financing for waste, water, and agricultural R&D. It called for improved tracking methodologies to monitor cohesion policy’s contribution to circularity, stricter adherence to the waste hierarchy (prioritizing prevention, reuse, and recycling over incineration), and enhanced regional cooperation to address challenges like China’s scrap import ban and marine litter (80% of which originates on land). The Parliament stressed integrating circular economy principles into education, vocational training, and smart specialization strategies, while boosting Green Public Procurement (€1.8 trillion annual potential) and supporting SMEs through platforms like the Circular Economy Finance Support Platform. It advocated for binding ex-ante conditionalities in future cohesion policy to ensure compliance with circular economy goals, increased climate-related spending, and synergies between Horizon 2020, LIFE, and ESI Funds. The resolution also emphasized remediating illegal landfills, promoting bioeconomy innovations to reduce CO2 emissions by 2.5 billion tonnes annually by 2030, and revising policies to incentivize recycled materials over raw resources, including EU-level taxation and single-use plastic regulations.",
    "total_score": 0.7953615279672579,
    "total_choice": 7,
    "party_num": 4,
    "id": 20,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.3,
      0.2,
      0.1,
      0.4
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "regional development",
    "title": "Cohesion policy and thematic objective ‘promoting sustainable transport and removing bottlenecks in key network infrastructures’: REPORT on the implementation of cohesion policy and the thematic objective of ‘promoting sustainable transport and removing bottlenecks in key network infrastructures’ - Article 9(7) of the Common Provisions Regulation",
    "background": "The EU’s cohesion policy framework, including the Common Provisions Regulation and funding instruments like the ERDF, Cohesion Fund, and Connecting Europe Facility, has supported transport infrastructure development since 2007. Persistent bottlenecks, sustainability goals, and disparities in regional connectivity underpin ongoing efforts. The Parliament will discuss cohesion policy implementation regarding sustainable transport and critical network infrastructure challenges.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.8726415094339622,
        "choice": 8,
        "stance": "EPP strongly promotes the centralized funding approach through CEF and Cohesion Fund as instrumental in aligning member states' transport priorities with EU-wide connectivity goals, perfectly reflecting their commitment to cohesive infrastructure development.  \nEPP proposes enhancing DG MOVE's coordination role with DG REGIO to ensure transport investments under cohesion policy fully align with TEN-T core network completion timelines, while maintaining strong approval of current funding mechanisms.  \nEPP applauds the issue's multimodal decarbonization focus, particularly its emphasis on rail electrification and LNG infrastructure expansion, which directly advances their climate-conscious transport agenda outlined in the 2023 Green Mobility Pact.  \nEPP strongly endorses targeted support for ultra-peripheral regions' port and airport resilience against climate disruptions, aligning with their longstanding advocacy for geographically balanced cohesion investments.  \nEPP approves the \"use it or lose it\" principle for transport projects as critical to accelerating TEN-T implementation, while suggesting technical assistance programs to help mountainous regions meet accelerated deadlines."
      },
      {
        "party_name": "ENF",
        "score": 0.058823529411764705,
        "choice": 0,
        "stance": "ENF completely opposes the issue’s market-driven transport agenda, condemning it as a tool to perpetuate social dumping and corporate exploitation at the expense of workers’ rights and ecological integrity.  \nENF rejects the prioritization of road freight expansion, arguing it accelerates environmental degradation and congestion while sidelining sustainable alternatives like rail and inland waterways.  \nENF highlights the issue’s failure to address systemic inequalities, noting that EU infrastructure investments disproportionately benefit multinational corporations rather than local communities.  \nENF condemns the omission of binding measures to shift freight from roads to rail, which directly contradicts stated decarbonization goals and ENF’s advocacy for ecologically coherent transport systems.  \nENF opposes the issue’s alignment with EU “competitiveness” narratives, asserting this entrenches a cycle of exploitative labor practices and environmental neglect masked as cohesion policy."
      },
      {
        "party_name": "ALDE",
        "score": 0.9230769230769231,
        "choice": 9,
        "stance": "ALDE fundamentally accepts the issue’s prioritization of cross-border sustainable transport infrastructure, perfectly aligning with ALDE’s commitment to cohesion and internal market integration through Interreg and ERDF-funded projects.  \nALDE perfectly aligns with the emphasis on the \"use it or lose it\" principle and TEN-T network completion, reflecting ALDE’s strategic focus on tangible EU value and countering populism via concrete connectivity achievements.  \nALDE fully supports the issue’s call for integrated Western Balkans infrastructure development, advancing ALDE’s vision of territorial cooperation and macroregional strategies as pivotal for EU enlargement.  \nALDE fundamentally accepts blending CEF, Cohesion Fund, and ERDF resources, mirroring ALDE’s advocacy for complementary financing to maximize sustainable transport outcomes.  \nALDE perfectly aligns with the issue’s push for smart transport systems, reinforcing ALDE’s innovation-driven agenda to optimize infrastructure efficiency and decarbonization."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.0,
        "choice": 0,
        "stance": "GUE_NGL rejects the issue's promotion of public-private partnerships as completely rejecting with their opposition to privatizing public transport infrastructure, citing Spain's €2 billion misuse of public funds to bail out private highways.  \nGUE_NGL opposes the issue's failure to address systemic socioeconomic imbalances caused by centralized globalization policies that drive excessive freight/worker mobility and rural depopulation.  \nGUE_NGL condemns the inadequate prioritization of conventional rail networks in the issue, which overlooks their critical role in territorial cohesion and combating rural abandonment across Europe.  \nGUE_NGL completely rejects with the issue's market-driven infrastructure expansion model, which perpetuates urban-rural divides rather than decentralizing economic activity to reduce transport demands.  \nGUE_NGL highlights the issue's inconsistency with climate justice by neglecting binding requirements to reactivate abandoned rail lines for sustainable passenger/freight mobility instead of road-centric investments."
      }
    ],
    "resolution": "The European Parliament raised the critical role of EU cohesion policy and sustainable transport investments in fostering economic growth, reducing regional disparities, and advancing climate goals. It emphasized maintaining the Connecting Europe Facility (CEF), Cohesion Fund (CF), and European Regional Development Fund (ERDF) as core funding sources for transport infrastructure, with €81 billion (31% of ESI Funds) allocated to transport in 2007-2013 and €24 billion via CEF for 2014-2020, prioritizing rail and TEN-T core networks. The resolution highlighted the need for balanced, spillover-effective investments across all regions, particularly lagging, mountainous, remote, and outermost areas, to address bottlenecks, multimodal connectivity, and decarbonization through shifts to rail, waterways, and electric vehicles. It called for integrating climate objectives into transport projects, enforcing environmental legislation (e.g., Natura 2000, air quality directives), and aligning funding with EU decarbonization targets. Cross-border infrastructure, including with the Western Balkans, was stressed, alongside simplified funding procedures, blended financing (e.g., EFSI, PPPs), and technical assistance to enhance project implementation. The Parliament urged strengthening urban mobility, intelligent transport systems, cycling infrastructure (e.g., EuroVelo), and accessibility for persons with disabilities, while maintaining grants as the primary tool for public transport. It advocated for harmonized transport strategies post-2020, increased DG MOVE involvement, and adherence to the \"use it or lose it\" principle to ensure timely project execution. Road safety initiatives, user-pays principles for green logistics, and equitable resource allocation to close infrastructure gaps between Member States were also underscored.",
    "total_score": 0.6451169188445667,
    "total_choice": 6,
    "party_num": 4,
    "id": 21,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.2,
      0.2,
      0.5,
      0.1
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "regional development",
    "title": "Boosting growth and cohesion in EU border regions: REPORT on boosting growth and cohesion in EU border regions",
    "background": "EU border regions, covering 40% of EU territory and 30% of its population, face persistent administrative, legal, and linguistic barriers hindering economic development and cross-border cooperation, as identified in a 2017 Commission analysis. The Parliament will discuss strategies to enhance cross-border integration and address disparities to unlock regional potential.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.8967136150234741,
        "choice": 8,
        "stance": "EPP strongly agrees the issue's focus on cross-border worker mobility, aligning perfectly with EPP's longstanding commitment to eliminating barriers to free movement and labor market integration.  \nEPP approves the emphasis on transport connectivity enhancements, particularly completing missing infrastructure links, which effectively advances EPP's priority of creating seamless trans-European networks.  \nEPP endorses the creation of joint digital portals for cross-border entrepreneurship, matching EPP's manifesto goals to empower SMEs through digital single market tools.  \nEPP highlights the need to strengthen regional authorities' implementation capacity through increased Interreg funding simplification, proposing clearer guidelines for local administrations to access EU cooperation instruments.  \nEPP applauds the territorial cooperation programs as critical mechanisms to reduce disparities, a principle central to EPP's cohesion policy agenda since 2014."
      },
      {
        "party_name": "EFDD",
        "score": 0.34146341463414637,
        "choice": 3,
        "stance": "EFDD partly advocates infrastructure investments but demands amendments to remove binding EU legal harmonization clauses, prioritizing national sovereignty.  \nEFDD opposes the European cross-border convention as centralizing governance, advocating instead for bilateral agreements under subsidiarity principles.  \nEFDD rejects expanded Interreg funding post-2020, insisting allocations be decided by member states without Brussels-led territorial assessments.  \nEFDD highlights the issue’s failure to address Brexit’s democratic mandate, urging deletion of cohesion policy references to the UK’s withdrawal.  \nEFDD requests revising SME support mechanisms to exclude EU-level regulatory oversight, emphasizing national control over labor mobility frameworks."
      },
      {
        "party_name": "SD",
        "score": 0.9144385026737968,
        "choice": 9,
        "stance": "SD fundamentally sanctions the issue’s emphasis on simplifying cross-border employment procedures and enhancing labor mobility, perfectly aligning with S&D’s commitment to dismantling administrative barriers for SMEs and job creation.  \nSD perfectly aligns with the call to expand post-2020 funding for Interreg and ETC programs, recognizing their indispensable role in fostering economic cohesion and infrastructure development in border regions.  \nSD fully supports the prioritization of Schengen integration for Romania and Bulgaria, viewing it as a critical step to eliminate internal border disparities and strengthen the single market’s integrity.  \nSD endorses preserving maritime cross-border cooperation frameworks, advocating for tailored strategies that protect successful models like Baltic Sea transport networks and youth cultural exchanges.  \nSD advocates leveraging cohesion policy to harmonize qualifications recognition and cross-border healthcare access, advancing social integration and equitable growth across all EU territories."
      },
      {
        "party_name": "ECR",
        "score": 0.8333333333333334,
        "choice": 8,
        "stance": "ECR strongly promotes the issue’s focus on dismantling administrative barriers to cross-border SME growth, aligning perfectly with ECR’s longstanding commitment to fostering competitive markets and reducing bureaucratic overreach.  \nECR applauds the emphasis on sustainable transport infrastructure through dedicated CEF budgets, which effectively advances ECR’s priority of strategic connectivity without expanding EU regulatory frameworks.  \nECR proposes amending the cohesion policy provisions to explicitly reference bilateral agreements as complementary tools to Interreg programs, ensuring respect for national competencies in post-Brexit cooperation.  \nECR approves the call for harmonizing legal frameworks for cross-border workers, urging enhanced wording to safeguard member states’ autonomy in labor market regulations.  \nECR endorses the issue’s recognition of multilingual education and cultural initiatives as drivers of integration, reflecting ECR’s advocacy for subsidiarity in community-led cohesion efforts."
      }
    ],
    "resolution": "The European Parliament raised concerns about persistent challenges in EU border regions, which cover 40% of EU territory, host 30% of its population, and contribute nearly a third of EU GDP, yet face socio-economic disparities, administrative barriers, and underdeveloped infrastructure. It highlighted that removing 20% of existing obstacles could boost GDP by 2% (€91 billion) and create 1 million jobs, emphasizing the need to address legal, linguistic, and regulatory barriers hindering cross-border healthcare, labor mobility (noting 2 million cross-border workers and students), SME growth (SMEs employ 67% of workers and generate 57% of value added), and transport connectivity, including missing railway links. The resolution urged enhanced use of EU tools like European Territorial Cooperation (ETC) and Interreg programs, calling for increased post-2020 funding, simplified procedures, and dedicated CEF budgets for sustainable transport. It stressed multilingual education, mutual recognition of qualifications, e-government interoperability, and cross-border cultural initiatives to foster integration, while advocating tailored approaches for maritime and external borders, including support for outermost regions. The Parliament also emphasized cohesion policy’s role in addressing Brexit impacts, promoting macro-regional strategies, and leveraging cultural and creative industries (CCIs) to drive growth, social cohesion, and tourism. It urged Member States to harmonize legal frameworks, improve emergency services cooperation, and expand cross-border healthcare zones (e.g., ZOAST areas), while highlighting the need for youth engagement, apprenticeships, and measures to combat discrimination and support vulnerable groups. Finally, it called for a European cross-border convention to resolve legal obstacles and enhance territorial impact assessments in EU legislation.",
    "total_score": 0.8048780487804879,
    "total_choice": 8,
    "party_num": 4,
    "id": 22,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.4,
      0.4,
      0.1,
      0.1
    ],
    "veto_party_name": "EFDD"
  },
  {
    "topic": "regional development",
    "title": "Building blocks for a post-2020 EU cohesion policy: REPORT on building blocks for a post-2020 EU cohesion policy",
    "background": "The EU's 2014-2020 Multiannual Financial Framework neared its conclusion, requiring evaluation of cohesion policy's role in addressing regional disparities, economic recovery, and structural challenges like migration, climate change, and Brexit's budgetary implications. The Parliament will discuss post-2020 cohesion policy reforms, funding priorities, and alignment with EU strategic goals.",
    "stances": [
      {
        "party_name": "ENF",
        "score": 0.06896551724137931,
        "choice": 0,
        "stance": "ENF rejects the integration of migration funding into cohesion policy, completely disputeing with their stance that EU funds must prioritize citizens facing poverty over migrant support.  \nENF opposes replacing GDP-based allocation metrics, declaring the issue’s supplementary indicators inconsistent with their demand for objective economic prioritization.  \nENF condemns the issue’s trust in EU financial management, citing the Spaak building’s €340M waste as proof of systemic incompetence in fund oversight.  \nENF demands cohesion policy reforms to eliminate fraud, highlighting OLAF’s €631M findings as evidence current anti-corruption measures are insufficient.  \nENF opposes administrative flexibility clauses, warning they could create bureaucratic burdens contrary to ENF’s push for deregulated, nationally tailored implementation."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.8695652173913043,
        "choice": 8,
        "stance": "GREEN_EFA strongly upholds maintaining cohesion policy as the cornerstone of European solidarity, aligning perfectly with their commitment to reducing regional disparities through sustainable investments in renewable energy and social infrastructure.  \nGREEN_EFA proposes enhancing anti-corruption safeguards by amending funding rules to require full participation in the European Public Prosecutor’s Office (EPPO) as a precondition for accessing cohesion funds, thereby strengthening accountability mechanisms.  \nGREEN_EFA applauds the issue’s climate action targets and 20% budget allocation as effectively advancing their manifesto priorities for a green economic transition, particularly through local energy communities and Just Transition mechanisms.  \nGREEN_EFA endorses the emphasis on urban development and Integrated Territorial Investments to address migration integration, urging explicit inclusion of climate asylum frameworks in future operational programs.  \nGREEN_EFA highlights the need to eliminate macroeconomic conditionality clauses that disproportionately penalize vulnerable communities, proposing instead performance indicators focused on social equity and decarbonization progress."
      },
      {
        "party_name": "ALDE",
        "score": 0.22580645161290322,
        "choice": 2,
        "stance": "ALDE rejects the issue's approach to maintaining cohesion funding levels post-Brexit, absolutely disputeing with their insistence on stricter macroeconomic conditionalities tied to structural reforms.  \nThe proposal overlooks critical aspects such as binding linkages between cohesion funds and country-specific reform agendas, a core ALDE requirement for fiscal accountability.  \nALDE opposes the issue's insufficient emphasis on streamlining state aid rules and audit processes, which contradicts their demand for radical simplification to enhance policy efficiency.  \nThe urban dimension and Interreg provisions fail to address ALDE's priority of mandating performance-based allocation to ensure funds directly target growth-oriented regions.  \nBy not requiring explicit alignment with Stability Pact compliance, the issue undermines ALDE's principle that cohesion investments must reinforce, not circumvent, economic governance frameworks."
      },
      {
        "party_name": "SD",
        "score": 0.9080459770114943,
        "choice": 9,
        "stance": "SD fully advocates the issue's insistence on maintaining cohesion policy funding at current levels, perfectly aligning with SD's commitment to EU solidarity and addressing regional disparities through structural investments.  \nSD perfectly aligns with the call for enhanced communication strategies to demonstrate cohesion policy's tangible impacts, mirroring SD's emphasis on citizen engagement and countering populist narratives against EU value visibility.  \nSD fully advocates the prioritization of SMEs and territorial cooperation tools like ITI, which directly advance SD's manifesto goals of job creation and inclusive growth across all regions.  \nSD perfectly supports integrating climate action with 20% budget allocation, reflecting SD's climate justice agenda and demand for synergies between cohesion funds and Horizon 2020 sustainability projects.  \nSD fully advocates abolishing macroeconomic conditionality clauses in cohesion spending, aligning with SD's opposition to austerity-driven policies that undermine social convergence targets."
      }
    ],
    "resolution": "The European Parliament raised the necessity of maintaining a robust, adequately funded cohesion policy post-2020 to address regional disparities, foster economic and social convergence, and uphold EU solidarity. It emphasized cohesion policy’s role as the EU’s primary investment tool for sustainable growth, job creation, and climate action, advocating for its budget share to remain at least equivalent to current levels despite challenges like Brexit. Key priorities included simplifying administrative procedures, enhancing flexibility through mechanisms like a reserve for unforeseen events, and accelerating implementation by reducing bureaucratic burdens and leveraging digital tools. The resolution stressed the importance of territorial cooperation (Interreg), macro-regional strategies, and support for outermost regions, while calling for increased funding for European Territorial Cooperation (ETC) to address cross-border challenges. It highlighted the need to integrate climate objectives, including dedicating 20% of the EU budget to climate-related actions, and improving synergies between cohesion funds, Horizon 2020, and the European Fund for Strategic Investments (EFSI) without undermining grants. The Parliament advocated for maintaining the seven-year programming period (or a 5+5 model with midterm review), performance-based allocation, and supplementary indicators beyond GDP—such as social progress or demographics—to better capture regional inequalities. It underscored the urban dimension, SMEs (responsible for 80% of EU jobs), and tools like Integrated Territorial Investments (ITI) to address challenges like migration integration, demographic shifts, and digital transformation. Lastly, the resolution urged stronger multi-level governance, streamlined state aid rules, balanced use of financial instruments, and enhanced communication to improve policy visibility and citizen engagement.",
    "total_score": 0.48703170028818443,
    "total_choice": 4,
    "party_num": 4,
    "id": 23,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.6,
      0.1,
      0.2,
      0.1
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "regional development",
    "title": "Acceleration of implementation of cohesion policy: MOTION FOR A RESOLUTION on acceleration of implementation of cohesion policy",
    "background": "Delays in implementing the 2014-2020 EU cohesion policy, including late operational program approvals, unmet ex-ante conditionalities, and risks of financial decommitment under regulatory deadlines, prompted concerns over fund utilization. The Parliament will discuss measures to accelerate cohesion policy execution while addressing administrative and structural challenges.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9653465346534653,
        "choice": 9,
        "stance": "EPP firmly supports the issue's emphasis on simplified procedures and administrative capacity building, perfectly aligning with EPP's commitment to efficient fund absorption and structural reform.  \nEPP perfectly aligns with the call for integrated territorial strategies, particularly in mountainous regions, advancing EPP's priority of balanced regional development through synergies between agriculture, tourism, and environmental protection.  \nEPP firmly supports leveraging ESI Funds with EFSI to maximize private investment, reflecting EPP's manifesto goals for job creation and competitiveness in cohesion regions.  \nEPP perfectly aligns with the demand for early post-2020 planning, reinforcing EPP's longstanding focus on policy stability and reduced implementation delays.  \nEPP firmly supports enhanced communication measures to increase public awareness of cohesion benefits, mirroring EPP's emphasis on tangible EU visibility in local projects."
      },
      {
        "party_name": "EFDD",
        "score": 0.05128205128205128,
        "choice": 0,
        "stance": "EFDD rejects the issue's reliance on financial instruments like EFSI, which Isabella Adinolfi criticizes as unproven \"financial engineering\" that fails to address geographic disadvantages in mountainous regions.  \nEFDD fully againsts cohesion policy's linkage to EU governance conditions, with Rosa D'Amato condemning structural fund ties to economic reforms as \"absolutely inconceivable\" and incompatible with local participation.  \nEFDD opposes integrated territorial investments as federalist overreach, with Julia Reid denouncing them as political tools to erode national identities under false economic pretenses.  \nEFDD rejects redistribution mechanisms that Bill Etheridge argues penalize poorer UK regions, calling cohesion funds a \"shameful\" diversion of resources from domestic healthcare and schools to EU priorities.  \nEFDD condemns mandatory EU propaganda signage referenced by Julia Reid as deceptive branding of reclaimed taxpayer funds, fully doubting with transparency claims in the issue."
      },
      {
        "party_name": "ENF",
        "score": 0.0,
        "choice": 0,
        "stance": "ENF fundamentally rejects the cohesion policy's premise of EU unity as contradictory to their core belief that \"Europe has become an incontinent continent\" through EU-induced disintegration.  \nENF opposes ESI Fund allocations as perpetuating wealth extraction from impoverished regions like South Wales to fund \"everywhere in the world\" against local needs (Resolution §1, §14).  \nENF condemns agricultural standardization attempts under cohesion policy as destructive to mountain communities' sovereignty, citing Loiseau's Alpine example of \"28% farm loss\" from EU-driven concentration (Resolution §5, §9).  \nENF declares the issue's EU governance tools like Integrated Territorial Investment incompatible with their demand for \"collaborations between sovereign states\" rather than federalist overreach (Resolution §8).  \nENF argues the issue's focus on gender equality in mountain regions (§49) exemplifies ideological overreach that \"destroys nations\" by ignoring territorial specificities (Loiseau debate point)."
      },
      {
        "party_name": "ALDE",
        "score": 0.9333333333333333,
        "choice": 9,
        "stance": "ALDE fundamentally accepts the issue's emphasis on subsidiarity and decentralized governance as critical to empowering mountain communities and local action groups.  \nALDE perfectly aligns with the issue's call for simplified procedures and streamlined access to ESI Funds to accelerate territorial development through LAG-led initiatives.  \nALDE fundamentally accepts the integration of ITI and CLLD instruments as essential tools to operationalize subsidiarity principles in line with ALDE's localism agenda.  \nALDE perfectly supports the issue's demand for administrative capacity building to eliminate bottlenecks hindering cohesion policy's transformative potential.  \nALDE fundamentally accepts combining ESI Funds with EFSI to amplify private investments in marginalized regions, reflecting ALDE's innovation-driven growth model."
      }
    ],
    "resolution": "The European Parliament raised concerns over delays and challenges in implementing the 2014-2020 Cohesion Policy, which allocates over €350 billion through European Structural and Investment (ESI) Funds to reduce regional disparities, boost competitiveness, and advance Europe 2020 goals. It emphasized the need to address risks of decommitment under Article 136(1) of the Common Provisions Regulation, urging the Commission to analyze payment forecasts and propose measures to prevent fund losses. The resolution highlighted persistent obstacles from the 2007-2013 period, including complex procurement, state aid rules, and administrative bottlenecks, and called for simplified procedures, strengthened administrative capacity, and better use of financial instruments to leverage private investment. It stressed the importance of fulfilling ex-ante conditionalities by 2016 to avoid payment suspensions and urged alignment with EU priorities like the Energy Union and digital single market. The Parliament welcomed the Commission’s Task Force for Better Implementation in eight Member States but demanded accelerated action and transparency. It advocated combining ESI Funds with the European Fund for Strategic Investments (EFSI) to enhance impact, urged flexibility under the Stability and Growth Pact to address liquidity shortages, and highlighted the need for decentralized governance through tools like Integrated Territorial Investment. The resolution also called for improved communication to raise public awareness of Cohesion Policy’s benefits and urged early planning for post-2020 reforms to enhance efficiency and targeting.",
    "total_score": 0.7400881057268722,
    "total_choice": 7,
    "party_num": 4,
    "id": 24,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.1,
      0.1,
      0.3,
      0.5
    ],
    "veto_party_name": "ENF"
  },
  {
    "topic": "regional development",
    "title": "Common provisions on European Structural and Investment Funds: specific measures for Greece: REPORT on the proposal for a regulation of the European Parliament and of the Council amending Regulation (EU) No 1303/2013 of the European Parliament and of the Council laying down common provisions on the European Regional Development Fund, the European Social Fund, the Cohesion Fund, the European Agricultural Fund for Rural Development and the European Maritime and Fisheries Fund and laying down general provisions on the European Regional Development Fund, the European Social Fund, the Cohesion Fund and the European Maritime and Fisheries Fund as regards specific measures for Greece",
    "background": "Greece's prolonged economic crisis, liquidity shortages, and capital controls impeded access to EU structural funds, necessitating urgent measures to utilize remaining 2007-2013 allocations and secure pre-financing for 2014-2020 programs. The Parliament will discuss regulatory amendments to enable exceptional financial support through European Structural and Investment Funds for Greece.",
    "stances": [
      {
        "party_name": "EFDD",
        "score": 0.358974358974359,
        "choice": 3,
        "stance": "EFDD partially agrees the liquidity measures but demands immediate termination of austerity policies linked to cohesion funding.  \nEFDD requests amendment to Article 2 to explicitly prohibit macroeconomic conditionalities affecting Greek social welfare programs.  \nThis firmly conflicts with EFDD's position that EU fiscal rules disproportionately target weaker economies while tolerating northern member states' deficits.  \nThe proposal overlooks critical aspects such as mandating debt relief parallel to fund accessibility increases.  \n While voting for short-term relief, EFDD maintains the issue's 100% co-financing model perpetuates dependency rather than enabling Grexit preparations."
      },
      {
        "party_name": "ENF",
        "score": 0.037037037037037035,
        "choice": 0,
        "stance": "ENF rejects the issue’s accelerated fund access as an unacceptable burden on taxpayers, exemplified by Olaf Stuger’s calculation of Dutch citizens working 7 additional minutes daily to finance Greek transfers.  \nENF opposes fundamentally the temporary lifting of payment ceilings, arguing it undermines fiscal discipline and perpetuates dependency, inconsistent with ENF’s anti-bailout principles.  \nENF condemns the 100% co-financing rate as a violation of national sovereignty, echoing Gerolf Annemans’ warning of EU-imposed “political unity economies” eroding self-determination.  \nENF highlights the issue’s failure to mandate enforceable Greek reforms, aligning with Barbara Kappel’s demand for strict success controls to prevent wasted investments.  \nENF asserts the proposal exemplifies EU overreach, contradicting ENF’s core stance against centralized fiscal coercion and “democratic dismantling” of member states."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.9534883720930233,
        "choice": 9,
        "stance": "GREEN_EFA completely advocates the accelerated fund access as perfectly aligning with their commitment to European solidarity through crisis-responsive cohesion policy.  \nGREEN_EFA perfectly supports the 100% co-financing provision as effectively advancing their priority of ecological and social investments in Greece's economic recovery.  \nGREEN_EFA emphasizes the critical need for technical assistance to ensure transparent, job-creating projects that match their sustainability principles.  \nGREEN_EFA highlights the necessity of directing funds toward citizen needs rather than bank recapitalization, reinforcing their manifesto stance on equitable crisis responses.  \nGREEN_EFA welcomes the issue's temporary payment ceiling adjustments as exemplifying pragmatic EU problem-solving against austerity-focused approaches."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.9347826086956522,
        "choice": 9,
        "stance": "GUE/NGL completely agrees the accelerated access to EU cohesion funds as a vital expression of European solidarity, perfectly aligning with their manifesto commitment to combat austerity through structural redistribution mechanisms.  \nGUE/NGL perfectly aligns with the 100% co-financing provision, recognizing this as essential for enabling immediate crisis response while maintaining public control over strategic investments in Greece’s social infrastructure.  \nGUE/NGL fully supports leveraging the European Maritime and Fisheries Fund reforms as a model for democratizing EU financial instruments, directly advancing their agenda to prioritize regional needs over market-driven conditionalities.  \nGUE/NGL endorses the temporary suspension of payment ceilings as a necessary correction to previous technocratic barriers, affirming that such flexibility should become permanent for all member states facing asymmetric economic shocks.  \nGUE/NGL applauds the issue’s implicit rejection of macroeconomic conditionality in fund allocation, seeing this precedent as crucial for dismantling austerity frameworks across EU fiscal governance structures."
      }
    ],
    "resolution": "The European Parliament raised urgent measures to address Greece’s immediate financial needs by enabling accelerated access to EU cohesion and fisheries funds. The resolution approved amendments to allow Greece to utilize remaining 2007-2013 cohesion funds by the end of 2015, increase pre-financing for 2014-2020 operational programmes under the Investment for Growth and Jobs Goal and the European Maritime and Fisheries Fund, and raise the co-financing rate to 100% for 2007-2013 operational programmes under the Convergence and Regional Competitiveness and Employment objectives. These measures aimed to alleviate liquidity constraints, expedite project implementation, and maximize fund absorption, with specific provisions to temporarily lift payment ceilings to 100% for cumulative pre-financing and interim payments. The Parliament endorsed the Commission’s proposal without substantive changes but reserved the right to reassess if the proposal were significantly altered.",
    "total_score": 0.8044776119402985,
    "total_choice": 8,
    "party_num": 4,
    "id": 25,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.4,
      0.2,
      0.1,
      0.3
    ],
    "veto_party_name": "GUE_NGL"
  },
  {
    "topic": "regional development",
    "title": "Deployment of cohesion policy instruments by regions to address demographic change: REPORT on the deployment of cohesion policy instruments by regions to address demographic change",
    "background": "Persistent demographic shifts across EU regions, including aging populations, declining birth rates, and uneven urban-rural population distribution, coupled with economic pressures and migration patterns, have strained public services and territorial cohesion. The Parliament will discuss regional deployment of cohesion policy instruments to address these demographic challenges.",
    "stances": [
      {
        "party_name": "EFDD",
        "score": 0.30952380952380953,
        "choice": 3,
        "stance": "EFDD partly upholds the rural depopulation framework but requests explicit ESF allocations to a minimum income fund, diverging from the issue’s generalized poverty measures.  \nEFDD argues the issue fails to prioritize small-scale traditional agriculture, inconsistent with their emphasis on decentralized, sustainable rural economies.  \nEFDD requests revisions to Article 6 to prevent centralized governance models, demanding binding provisions for local autonomy in demographic strategies.  \nEFDD highlights contradictions in urban migration solutions, advocating stricter funding quotas for community-led rural transport over smart village technologies.  \nEFDD opposes the issue’s passive stance on ESF budget cuts, citing fundamental conflicts with EFDD’s social equity commitments."
      },
      {
        "party_name": "SD",
        "score": 0.9060773480662984,
        "choice": 9,
        "stance": "SD fully approves the issue’s integration of gender equality measures, perfectly aligning with SD’s commitment to empowering women through childcare support, labor market inclusion, and combating poverty among single mothers.  \nSD perfectly aligns with the call for cohesion funds to prioritize rural-urban cohesion, echoing Sergio Gutiérrez Prieto’s demand for positive discrimination in funding regions facing acute depopulation and service gaps.  \nSD fully approves the emphasis on smart villages and digital connectivity, which directly advances SD’s vision for closing rural-urban divides through targeted investments in e-health and sustainable infrastructure.  \nSD perfectly aligns with Nicola Caputo’s insistence on embedding demographic criteria across EU policies, ensuring cohesion funds address longevity, fertility rates, and territorial imbalances as systemic priorities.  \nSD fully approves Viorica Dăncilă’s focus on youth retention and generational renewal, reflecting the issue’s alignment with SD’s agenda for inclusive education, vocational training, and intergenerational solidarity."
      },
      {
        "party_name": "ECR",
        "score": 0.125,
        "choice": 1,
        "stance": "ECR rejects the issue’s cohesion fund mechanisms for failing to address austerity-driven demographic collapse in Greece, as repeatedly raised in 2015-2016 parliamentary inquiries.  \nThis completely conflicts with ECR’s position that EU-mandated austerity (mnimonia) directly caused a 3% population loss, rendering structural investments ineffective without reversing fiscal constraints.  \nThe proposal overlooks critical aspects such as the Berlin Institute’s findings linking economic crisis to plummeting birth rates, which cohesion policies cannot offset while austerity persists.  \nECR opposes fundamentally the issue’s gender equality prioritization as inconsistent with its evidence that EU-imposed reforms deepened poverty among single mothers and the elderly.  \nThe issue’s rural-urban linkage investments contradict ECR’s demand to first abolish measures exacerbating rural depopulation via wage cuts and public service erosion under memoranda."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.88,
        "choice": 8,
        "stance": "GUE/NGL strongly upholds the issue’s prioritization of rural population retention through cohesion funds, aligning perfectly with their commitment to territorial justice and combating urban hyper-concentration.  \nGUE/NGL applauds the integration of gender equality measures in labor markets and childcare access as essential to addressing demographic aging, reflecting their longstanding advocacy for feminist economic policies.  \nGUE/NGL proposes amending agricultural subsidy allocations under the CAP to prioritize small-scale farmers over agribusinesses, ensuring coherence with cohesion policy goals to reverse rural depopulation drivers.  \nGUE/NGL endorses the emphasis on public service accessibility in remote areas, which directly advances their vision of decommodified healthcare, education, and transport as tools for spatial equity.  \nGUE/NGL urges strengthening environmental safeguards in smart village investments to explicitly link rural revitalization with wildfire prevention strategies, addressing root causes of ecological crises highlighted in recent disasters."
      }
    ],
    "resolution": "The European Parliament raised concerns over significant demographic challenges in the EU, including aging populations, declining birth rates, rural depopulation, and urban migration, projecting a drop in the EU’s global population share from 6.9% (2015) to 5.1% by 2060, with 132 of 273 NUTS-2 regions expected to shrink by 2050. It emphasized the need for coordinated policies leveraging cohesion funds (ESI, ERDF, ESF, Cohesion Fund) to address infrastructure gaps, digital divides, and access to public services, particularly in rural and remote areas. The resolution called for integrating demographic criteria into EU policies, prioritizing gender equality through improved labor market participation for women, childcare support, and combating poverty among single mothers and the elderly. It advocated for targeted investments in smart villages, sustainable transport, e-health, and rural-urban linkages, while urging reforms to enhance the effectiveness of funds via community-led local development (CLLD), streamlined governance, and demographic-specific indicators. The Parliament stressed the importance of aligning regional strategies with the Europe 2020 goals, fostering innovation, and addressing generational solidarity through inclusive growth measures, including youth employment programs and integration of migrants, to mitigate socio-economic disparities exacerbated by demographic shifts.",
    "total_score": 0.6884561891515995,
    "total_choice": 6,
    "party_num": 4,
    "id": 26,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.3,
      0.1,
      0.3,
      0.3
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "regional development",
    "title": "Implementation of EU macro-regional strategies: REPORT on the implementation of EU macro-regional strategies",
    "background": "The EU established four macro-regional strategies (Baltic Sea, Danube, Adriatic-Ionian, Alpine) between 2009-2015 to address transnational challenges across member states and third countries. A 2016 Commission report evaluated their implementation amid calls for improved governance, funding coherence, and environmental integration. The Parliament will discuss enhancing cross-border cooperation frameworks and aligning strategies with EU cohesion policies.",
    "stances": [
      {
        "party_name": "ENF",
        "score": 0.125,
        "choice": 1,
        "stance": "ENF totally againsts the issue’s failure to prevent fund diversion toward migration policies, which directly contradicts ENF’s demand that EU resources exclusively serve regional development and citizen welfare.  \nENF rejects the insufficient binding mechanisms to ensure equitable state commitments, creating persistent imbalances in political support and resource allocation across macro-regional strategies.  \nThe proposal overlooks critical aspects such as strict safeguards against repurposing cohesion funds for migration management, a red line for ENF’s anti-EU overreach principles.  \nENF highlights contradictions in the issue’s alignment with SDGs while permitting diluted accountability for pollution enforcement, notably in the Baltic Sea where lax Sulphur Directive compliance persists.  \nThis approach conflicts with ENF’s insistence on prioritizing tangible citizen benefits over abstract climate targets, exemplified by underfunded Danube projects despite Romania’s procedural efforts."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.9791666666666666,
        "choice": 9,
        "stance": "GREEN_EFA fundamentally approves the issue's integration of UN Sustainable Development Goals, perfectly aligning with their foundational commitment to ecological transition and transnational environmental governance.  \nGREEN_EFA perfectly aligns with the demand for binding political commitments in macro-regional strategies, recognizing this as essential for achieving Paris Agreement targets through coordinated climate action.  \nGREEN_EFA highlights the issue's emphasis on circular economy integration as a critical enhancement opportunity to transform cohesion policy into a driver of zero-waste systems.  \nGREEN_EFA fundamentally approves strict synchronization of ESI Funds with marine spatial planning initiatives, advancing their decades-long advocacy for Baltic Sea pollution mitigation and Natura 2000 protections.  \nGREEN_EFA applauds the issue's focus on post-2020 budget prioritization for cross-border renewable energy projects, which directly operationalizes their clean energy transition agenda across all macro-regions."
      },
      {
        "party_name": "ALDE",
        "score": 0.9523809523809523,
        "choice": 9,
        "stance": "ALDE fully upholds the issue’s recognition of macro-regional strategies as vital frameworks for territorial cohesion, perfectly aligning with ALDE’s longstanding commitment to decentralized, multi-level governance.  \nALDE highlights the Adriatic-Ionian strategy’s success in mobilizing cities, regions, and universities like UniAdrion as a model for achieving the issue’s goals, effectively advancing ALDE’s priority of cross-border innovation ecosystems.  \nALDE emphasizes the critical role of local stakeholders and economic chambers in operationalizing macro-regional strategies, reflecting their principle of subsidiarity and bottom-up policymaking.  \nALDE welcomes the issue’s adherence to the \"three no’s\" principle while proposing dynamic application of existing structures to enhance long-term funding coordination—a natural evolution of ALDE’s original vision.  \nALDE applauds the focus on marine spatial planning and pollution combatting in the Adriatic-Ionian and Baltic regions, which aligns perfectly with their blue growth and circular economy advocacy."
      },
      {
        "party_name": "SD",
        "score": 0.9226519337016574,
        "choice": 9,
        "stance": "SD totally supports the issue’s emphasis on empowering local and regional actors to drive macro-regional strategies, aligning perfectly with SD’s commitment to decentralized, participatory governance.  \nSD perfectly aligns with the call to synchronize EU funds for climate mitigation and renewable energy, highlighting the urgency of combating pollution in the Baltic and Adriatic-Ionian regions through strict enforcement of environmental directives.  \nSD proposes strengthening governance frameworks to integrate Mediterranean-wide strategies, addressing shared risks like desertification, as a natural extension of the issue’s focus on territorial cohesion.  \nSD fully supports expanding marine spatial planning and circular economy integration, exemplified by DANUBEPARKS 2.0, to meet 2020 biodiversity targets across all macro-regions.  \nSD emphasizes the need to enhance cross-border infrastructure projects in the Danube and Alpine regions, leveraging simplified funding mechanisms to accelerate hydrogeological stability and green mobility."
      }
    ],
    "resolution": "The European Parliament raised the importance of EU macro-regional strategies (MRS)—including the Baltic Sea Region (2009), Danube Region (2011), Adriatic-Ionian Region (2014), and Alpine Region (2015)—as frameworks for addressing shared territorial challenges, fostering cross-border cooperation, and aligning with EU priorities such as the Sustainable Development Goals (SDGs), Energy Union, Paris Agreement, and blue growth. It emphasized environmental integration, urging enhanced protection of biodiversity through Natura 2000 and Emerald networks, marine spatial planning, and combating pollution, eutrophication, and marine litter, with specific calls for coordinated monitoring systems and contingency plans for oil spills. The resolution stressed the need to synchronize EU funds, including ESI Funds and the European Fund for Strategic Investments (EFSI), to support climate mitigation, renewable energy, and sustainable tourism, while maintaining the \"three no’s\" principle (no new EU legislation, funding, or structures). It highlighted challenges in the Adriatic-Ionian region, including untreated waste and coastal management, and in the Alpine Region, where climate change threatens biodiversity and hydrogeological stability. The Baltic Sea’s pollution crisis was underscored, advocating stricter enforcement of the Sulphur Directive and NOx Emission Control Areas. Parliament called for new strategies for the Iberian Peninsula and Mediterranean, focusing on forestry, desertification, and shared environmental risks, while urging improved governance, stakeholder engagement, and long-term funding approaches to enhance MRS effectiveness. Projects like DANUBEPARKS 2.0 and BLASTIC were cited as successful models, with a focus on achieving marine protected area targets by 2020 and integrating circular economy principles.",
    "total_score": 0.7969187675070029,
    "total_choice": 7,
    "party_num": 4,
    "id": 27,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.4,
      0.2,
      0.1,
      0.3
    ],
    "veto_party_name": "ENF"
  },
  {
    "topic": "regional development",
    "title": "European Structural and Investment Funds and sound economic governance: REPORT on the European Structural and Investment Funds and sound economic governance: guidelines for the implementation of Article 23 of the Common Provisions Regulation",
    "background": "The European Structural and Investment Funds (ESIF) constitute key EU cohesion policy instruments, with significant public investment roles in Member States. Article 23 of the 2013 Common Provisions Regulation introduced measures linking ESIF effectiveness to economic governance through potential fund reprogramming. The Parliament will discuss implementation guidelines for these macroeconomic conditionality provisions.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.801980198019802,
        "choice": 8,
        "stance": "EPP strongly agrees the issue's emphasis on using Article 23 as a last resort, aligning with their commitment to preserving cohesion policy's role in reducing regional disparities and maintaining multiannual investment stability.  \nEPP applauds the call for enhanced institutional coordination between economic governance mechanisms and cohesion objectives, reflecting their manifesto priority to balance fiscal discipline with solidarity-driven development.  \nEPP proposes accelerating procedural simplification measures through standardized e-Cohesion platforms and cross-border project frameworks to reduce administrative burdens while fully maintaining accountability standards.  \nEPP strongly endorses the requirement for territorial impact assessments before any fund reprogramming, reinforcing their longstanding advocacy for Article 174 TFEU principles in EU policymaking.  \nEPP welcomes the demand for formalized parliamentary oversight through early warning systems and suspension reporting, enhancing transparency in line with their 2023 governance reform priorities."
      },
      {
        "party_name": "EFDD",
        "score": 0.02564102564102564,
        "choice": 0,
        "stance": "EFDD rejects the issue's linkage of ESI Funds to EU economic governance as a direct contradiction of its opposition to centralized wealth redistribution.  \nEFDD entirely disapproves cohesion policy mechanisms that enable supranational control over national investment priorities, viewing Article 23 as a tool for EU state-building.  \nThe proposal's emphasis on reducing regional disparities through structural funds conflicts with EFDD's principle that wealth allocation must remain under exclusive member state sovereignty.  \nEFDD condemns the issue's validation of ESI Funds' crisis-response role as legitimizing permanent EU intervention in domains requiring democratic national oversight.  \nThe call for institutional coordination between cohesion policy and economic governance disregards EFDD's core stance against harmonizing EU budgetary control with member state fiscal autonomy."
      },
      {
        "party_name": "SD",
        "score": 0.8546511627906976,
        "choice": 8,
        "stance": "SD strongly advocates the issue's emphasis on limiting Article 23 application to last-resort scenarios, aligning perfectly with SD's commitment to safeguarding cohesion policy's stability in reducing regional inequalities.  \nSD approves enhanced parliamentary oversight mechanisms but proposes formalizing regional authority consultations in impact assessments to ensure territorial specificity under Article 174 TFEU.  \nSD applauds the call for institutional coordination between economic governance and cohesion objectives, effectively advancing SD's manifesto priority of solidarity-driven investment frameworks.  \nSD endorses the demand for 2017 Article 23 cost-efficiency reviews while suggesting explicit monitoring of unemployment impacts in peripheral regions like ultraperipheral areas.  \nSD strongly advocates the Adriatic-Ionian macro-region strategy as a model for territorial cohesion, urging replication of its multilevel governance approach in future ESI programming."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.0,
        "choice": 0,
        "stance": "GUE/NGL absolutely rejects Article 23 as an austerity-driven tool that subordinates cohesion policy to destructive macroeconomic conditionality.  \nGUE/NGL rejects the institutionalization of payment suspensions and reprogramming mechanisms that punish regions for central governments' fiscal decisions.  \nGUE/NGL condemns the undemocratic imposition of Article 23, which bypasses parliamentary oversight and entrenches Troika-style austerity logic in structural fund management.  \nGUE/NGL highlights how linking ESI Funds to European Semester recommendations disproportionately harms crisis-impacted regions through public investment cuts and service privatization pressures.  \nGUE/NGL demands complete removal of macroeconomic conditionality clauses, citing their incompatibility with territorial cohesion principles under Articles 174 and 349 TFEU."
      }
    ],
    "resolution": "The European Parliament raised concerns about linking the effectiveness of European Structural and Investment Funds (ESI Funds) to economic governance under Article 23 of the Common Provisions Regulation (CPR), emphasizing cohesion policy’s role in reducing regional disparities, fostering sustainable growth, and addressing crises. It highlighted that cohesion policy reprogrammed over 11% of its 2007-2012 budget to address urgent needs, with ESI Funds constituting over 80% of public investment in some Member States during that period. The resolution stressed Article 23 should only be used as a last resort to avoid undermining long-term investment stability, given the multiannual nature of ESI programmes versus the annual European Semester cycle. It called for cautious, transparent application of reprogramming or payment suspensions, ensuring proportionality, territorial specificity (per Articles 174 and 349 TFEU), and minimal administrative burden, while safeguarding employment, social cohesion, and thematic objectives like education and job creation. The Parliament urged the Commission to prioritize dialogue with Member States, conduct impact assessments on unemployment and regional development, and avoid penalizing regions reliant on ESI Funds. It criticized the lack of parliamentary oversight in the Guidelines, demanding formalized procedures for consultation and transparency, including early warnings for reprogramming and detailed reporting on suspended amounts. Additionally, it requested a 2017 review of Article 23’s application, focusing on cost-efficiency and alignment with partnership principles, and stressed the need for institutional coordination to balance economic governance with cohesion policy’s solidarity-driven objectives.",
    "total_score": 0.6557377049180327,
    "total_choice": 6,
    "party_num": 4,
    "id": 28,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.4,
      0.2,
      0.3,
      0.1
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "regional development",
    "title": "Future perspectives for technical assistance in cohesion policy: REPORT on future perspectives for Technical Assistance in Cohesion Policy",
    "background": "The EU's cohesion policy, governed by regulations including 1303/2013, faced persistent disparities in administrative capacity and fund implementation efficiency among member states, hindering regional development objectives. The Parliament will discuss enhancing technical assistance frameworks to strengthen institutional capabilities and address structural challenges in cohesion policy delivery for post-2020 programming.",
    "stances": [
      {
        "party_name": "ENF",
        "score": 0.10344827586206896,
        "choice": 1,
        "stance": "ENF rejects the mandatory use of financial instruments in cohesion policy, arguing it prioritizes financial intermediaries over genuine regional development needs.  \nThe issue totally challenges with ENF's insistence on national sovereignty in funding allocation decisions, particularly for states like Romania requiring grant-based support.  \nENF opposes the Commission’s centralized approach to technical assistance, viewing it as incompatible with subsidiarity principles and local administrative realities.  \nThe proposal overlooks critical disparities by imposing uniform financial mechanisms, contradicting ENF’s demand for flexible, state-tailored cohesion strategies.  \nENF condemns the issue’s implicit pressure to replace grants with complex financial tools, which would exacerbate rather than reduce regional inequalities."
      },
      {
        "party_name": "ALDE",
        "score": 0.9032258064516129,
        "choice": 9,
        "stance": "ALDE fundamentally endorses the issue’s integration of the European Investment Bank’s central role in cohesion policy, perfectly aligning with ALDE’s vision for blended finance models that strategically combine grants, loans, and private capital to address regional investment gaps.  \nALDE perfectly aligns with the issue’s emphasis on directing technical assistance to local authorities, reflecting ALDE’s unwavering commitment to decentralizing administrative capacity-building and ensuring visibility of cohesion policy’s benefits for citizens.  \nALDE fully supports the call for harmonizing financial instruments with technical assistance, recognizing this synergy as essential to maximizing ESI Funds’ impact and advancing ALDE’s priority of fostering innovation-driven territorial development.  \nALDE endorses the issue’s focus on simplifying funding procedures and enhancing beneficiary communication, which aligns perfectly with ALDE’s principles of transparent governance and empowering subnational actors in EU structural fund management.  \nALDE perfectly aligns with the issue’s demand for robust cross-border cooperation frameworks, underscoring ALDE’s dedication to multi-level governance solutions that strengthen macro-regional strategies and EU solidarity."
      },
      {
        "party_name": "SD",
        "score": 0.9142857142857143,
        "choice": 9,
        "stance": "SD completely sanctions the issue’s emphasis on prioritizing grants as the cornerstone of cohesion policy, perfectly aligning with S&D’s commitment to safeguarding vulnerable beneficiaries and public investments in social infrastructure, education, and sustainable energy.  \nSD perfectly aligns with the call to enhance technical assistance for local and regional authorities, particularly in deploying territorial tools like ITI and CLLD, ensuring underdeveloped regions gain equitable access to expertise for smart village initiatives and rural regeneration.  \nSD completely sanctions strengthening TAIEX REGIO PEER 2 PEER and Integrity Pacts to build administrative capacity, echoing Andrea Cozzolino’s emphasis on cultivating a modern European leadership class capable of maximizing ESI Funds’ transformative socioeconomic impact.  \nSD unequivocally supports integrating cohesion policy with macro-regional strategies and cross-border cooperation, mirroring Viorica Dăncilă’s advocacy for multiregional investment platforms that reduce disparities through coordinated public-private co-investments.  \nSD perfectly aligns with demands for rigorous ex-post evaluations and country-specific alignment, ensuring post-2020 frameworks institutionalize lessons from rural infrastructure gaps and unemployment hotspots as highlighted by Момчил Неков and Julie Ward."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.9130434782608695,
        "choice": 9,
        "stance": "GUE/NGL fundamentally accepts the issue's emphasis on cohesion policy as a long-term instrument for achieving equal living conditions across the Union, perfectly aligning with their commitment to solidarity and social equity.  \nGUE/NGL perfectly aligns with the call to prioritize grant-based structural funding over financial instruments, rejecting any dilution of cohesion policy into a subsidiary of the European Fund for Strategic Investments.  \nGUE/NGL fundamentally accepts the demand for amplified technical assistance to address regional disparities, particularly in cross-border education, culture, and research initiatives, as articulated in Martina Michels’ intervention.  \nGUE/NGL unequivocally supports the issue’s insistence on safeguarding cohesion funding for conflict-affected regions like Northern Ireland, echoing Martina Anderson’s urgent warning about Brexit-related risks.  \nGUE/NGL perfectly aligns with the issue’s critique of austerity constraints on local administrations, reinforcing Ángela Vallina’s argument about systemic divides between “first” and “second” tier regions in fund accessibility."
      }
    ],
    "resolution": "The European Parliament raised concerns and recommendations regarding technical assistance in cohesion policy, emphasizing its critical role in enhancing administrative capacity, effective implementation of European Structural and Investment Funds (ESI Funds), and addressing disparities across Member States. It noted that technical assistance resources at the Commission’s initiative were set at 0.35% of annual ERDF, ESF, and Cohesion Fund allocations, while Member States had access to €13.4 billion under ESI Funds for 2014-2020. The resolution highlighted the need to improve monitoring, evaluation, and transparency of technical assistance, urging the Commission to develop better result-oriented indicators and conduct a comprehensive study on its impact. It called for strengthening tools like the TAIEX REGIO PEER 2 PEER instrument, Integrity Pacts, and JASPERS, while ensuring coordination between the Structural Reform Support Programme (SRSP) and ESI Funds to avoid duplication. The Parliament stressed the importance of supporting local and regional authorities, particularly in implementing territorial tools like Integrated Territorial Investment (ITI) and Community-Led Local Development (CLLD), and addressing challenges in retaining skilled personnel. It advocated for enhanced technical assistance in macro-regional strategies, sustainable urban development, and cross-border cooperation, while urging Member States to simplify procedures, improve communication with beneficiaries, and ensure transparent use of funds. The resolution also emphasized the need for post-2020 cohesion policy to incorporate lessons learned, including ex-post evaluations and better alignment with country-specific recommendations, to maximize effectiveness and accountability.",
    "total_score": 0.8025936599423631,
    "total_choice": 8,
    "party_num": 4,
    "id": 29,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.4,
      0.1,
      0.2,
      0.3
    ],
    "veto_party_name": "ENF"
  },
  {
    "topic": "regional development",
    "title": "Increasing engagement of partners and visibility in the performance of European Structural and Investment Funds: REPORT on increasing engagement of partners and visibility in the performance of European Structural and Investment Funds",
    "background": "The European Structural and Investment Funds' partnership principle and visibility mechanisms, established under existing regulations, faced challenges in public awareness and stakeholder engagement, with 2015 surveys indicating limited citizen recognition of EU-funded projects. The Parliament will discuss strategies to enhance partner involvement and communication of ESI Funds' performance outcomes.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.7548076923076923,
        "choice": 7,
        "stance": "EPP strongly approves maintaining cohesion policy's post-2020 budget as vital for EU-wide economic convergence, aligning perfectly with their commitment to reducing disparities through structural funds.  \nThe issue effectively advances EPP's priority of countering Euroscepticism via mandatory digital visibility components and dedicated communication funding in technical assistance.  \nEPP approves procedural simplifications while advocating built-in flexibility mechanisms for regional authorities to adapt programs to local priorities during crises.  \nEPP proposes expanding the partnership principle to explicitly include SMEs and academic institutions in stakeholder engagement frameworks for holistic project design.  \nEPP highlights cohesion policy's irreplaceable role in infrastructure development through grants-based funding, rejecting financial vehicles that risk fragmenting territorial solidarity."
      },
      {
        "party_name": "EFDD",
        "score": 0.358974358974359,
        "choice": 3,
        "stance": "EFDD rejects the issue's communication budget increases as fundamentally inconsistent with EFDD's fiscal responsibility principles, citing James Carver's critique that \"taxpayers have found you out\" regarding ineffective visibility campaigns.  \nEFDD opposes the austerity-driven implementation framework, highlighting Laura Agea's condemnation of EU institutions prioritizing \"rigorous stability\" over earthquake victims' dignity as systemic policy failure.  \nEFDD conditionally advocates the FESR disaster axis but demands amendment of Article 4 to restore 100% EU co-financing, arguing the 95% cap and 5% allocation limit contradict urgent reconstruction needs in Italy's earthquake zones.  \nEFDD requests deletion of mandatory communication clauses in project applications, asserting they create bureaucratic burdens while failing to address delayed reconstruction timelines criticized by Laura Agea.  \nEFDD completely condemns the issue's institutional messaging strategy, arguing it overlooks grassroots distrust evidenced by rising Euroscepticism across member states as noted in Carver's Roman Empire analogy."
      },
      {
        "party_name": "ENF",
        "score": 0.0,
        "choice": 0,
        "stance": "ENF rejects the issue’s expansion of cohesion fund purposes to migrant integration, which absolutely challenges with ENF’s stance that funds must prioritize poverty reduction for existing EU citizens.  \nENF opposes the issue’s emphasis on centralized communication strategies, citing wasteful EU spending on projects like the Paul-Henri Spaak building as proof of systemic mismanagement.  \nENF condemns the proposal’s administrative complexity, arguing it overlooks critical aspects like fraud risks highlighted by OLAF’s €631 million findings in 2015.  \nENF disputes the issue’s reliance on GDP-based allocations, insisting rigid metrics ignore national sovereignty in fund distribution post-2020.  \nENF dismisses visibility campaigns as superficial, pointing to the EU’s failure to address accountability in cohesion spending as the root cause of public distrust."
      },
      {
        "party_name": "SD",
        "score": 0.7988505747126436,
        "choice": 7,
        "stance": "SD strongly agrees the issue's emphasis on cohesion policy as essential for reducing regional disparities, aligning with their manifesto commitment to EU-wide solidarity through structural investments.  \nSD entirely approves mandatory communication components in project applications, seeing this as critical to demonstrate ESF's 20% social inclusion allocation matching their anti-poverty priorities.  \nSD applauds the focus on localized digital campaigns and RegioStars awards, proposing to extend post-project communication timelines by 12 months to maximize visibility of long-term impacts.  \nSD strongly approves maintaining cohesion funding post-2020 with simplified procedures, particularly praising provisions for SME support and disaster response flexibility as seen in Italian and Azorean cases.  \nSD emphasizes the partnership principle's alignment with their grassroots governance model, urging binding stakeholder consultation requirements during programming phases to strengthen multi-level engagement."
      }
    ],
    "resolution": "The European Parliament raised concerns over declining public awareness and recognition of EU cohesion policy’s impact, noting that only 34% of citizens were aware of EU-funded projects improving their local areas, as highlighted in a 2015 Eurobarometer survey. It emphasized the need to enhance communication strategies to counter Euroscepticism and misinformation, stressing the importance of tangible results, simplified procedures, and citizen-friendly messaging. The resolution underscored cohesion policy’s role in reducing regional disparities, fostering growth, and supporting smart, sustainable, and inclusive investments through the European Structural and Investment Funds (ESI Funds), particularly the European Social Fund (ESF), which allocates 20% of its resources to social inclusion. It called for improved visibility via digital platforms, social media, and localized campaigns, while advocating for mandatory communication components in project applications and dedicated funding for communication within technical assistance. The Parliament highlighted the partnership principle and multi-level governance as vital for stakeholder engagement, urging better involvement of civil society, local authorities, and social partners. It recommended post-2020 reforms to streamline regulations, strengthen urban-rural cooperation, and ensure long-term evaluation of projects, including extended communication efforts post-project closure. The resolution also urged the Commission to analyze cohesion policy’s broader economic benefits, such as externalities in EU-15 countries from V4 investments, and to promote initiatives like the RegioStars awards to showcase successful projects. Finally, it stressed balancing administrative simplification with financial accountability and addressing gaps in media coverage to rebuild public trust in EU solidarity mechanisms.",
    "total_score": 0.6484149855907781,
    "total_choice": 6,
    "party_num": 4,
    "id": 30,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.3,
      0.1,
      0.1,
      0.5
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "regional development",
    "title": "New territorial development tools in cohesion policy 2014-2020: REPORT on new territorial development tools in cohesion policy 2014-2020: Integrated Territorial Investment (ITI) and Community-Led Local Development (CLLD)",
    "background": "The European Union's 2014-2020 Cohesion Policy introduced Integrated Territorial Investment (ITI) and Community-Led Local Development (CLLD) as tools for integrated territorial development, following prior initiatives like LEADER. The Parliament will discuss implementation challenges and effectiveness of these mechanisms in addressing regional disparities through multi-fund approaches and local governance structures.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9455445544554455,
        "choice": 9,
        "stance": "EPP fundamentally agrees the issue's emphasis on integrated territorial strategies that synergize agriculture, tourism, and environmental protection to combat unemployment and demographic decline in mountain regions.  \nEPP perfectly aligns with the issue's focus on streamlining administrative processes to accelerate cohesion fund absorption, ensuring job creation and SME support remain central to territorial development.  \nEPP fully supports the issue's call for enhanced technical assistance to strengthen local governance capacities, particularly in implementing multi-fund CLLD strategies that empower community-led decision-making.  \nEPP fundamentally agrees the issue's push for increased visibility of EU-funded projects through improved communication frameworks, ensuring citizens recognize cohesion policy's direct impact on regional competitiveness.  \nEPP perfectly aligns with the issue's approach to empowering local actors through strict adherence to partnership principles, guaranteeing balanced LAG governance and alignment with Europe 2020 smart specialization goals."
      },
      {
        "party_name": "ENF",
        "score": 0.03571428571428571,
        "choice": 0,
        "stance": "ENF rejects the issue's centralized EU territorial governance as fully rejecting with national sovereignty principles, mirroring Stuger's critique of EU disintegration.  \nENF opposes multi-fund integration mechanisms for creating ideological \"fourre-tout\" frameworks inconsistent with Alpine farmers' needs, per Loiseau's agricultural sovereignty arguments.  \nENF condemns cohesion funding redistribution as exacerbating local poverty, aligning with Stuger's challenge about wealth transfer from struggling regions to global projects.  \nENF disputes issue's alignment with Europe 2020 agendas, viewing them as drivers of destructive agricultural concentration criticized in Loiseau's mountain zone analysis.  \nENF declares the proposal's partnership principles irreconcilable with ENF's model of inter-state collaborations between sovereign entities, per Loiseau's federalism warnings."
      },
      {
        "party_name": "ALDE",
        "score": 0.9,
        "choice": 9,
        "stance": "ALDE fundamentally advocates the issue's emphasis on empowering local actors through Integrated Territorial Investment and Community-Led Local Development, perfectly aligning with ALDE's longstanding commitment to subsidiarity and bottom-up governance. This approach effectively advances ALDE's priority of enabling regions like mountainous areas to address unemployment and demographic challenges through direct control over development strategies.  \n\nALDE perfectly aligns with the call to simplify administrative processes and reduce gold-plating, as highlighted by successful LAG initiatives in Istria that demonstrate how streamlined fund access accelerates community-driven solutions while maintaining rigorous EU accountability standards.  \n\nALDE fully supports the issue's demand for mandatory earmarking of CLLD/ITI tools post-2020, recognizing their proven value in fostering multi-sector synergies between urban-rural areas and ensuring no single entity dominates Local Action Group decision-making – a principle already operationalized in ALDE-backed programs.  \n\nALDE endorses the requirement for enhanced technical assistance to under-resourced localities, mirroring our advocacy for capacity-building measures that enable effective implementation of smart specialization strategies and Europe 2020 objectives at municipal levels.  \n\nALDE perfectly aligns with the issue's insistence on performance-based funding and transparency reforms, crucial for maintaining public trust in cohesion policy instruments while allowing necessary experimentation with territorial development models as advocated in parliamentary debates."
      },
      {
        "party_name": "SD",
        "score": 0.9069767441860465,
        "choice": 9,
        "stance": "SD entirely agrees the issue's integration of CLLD and ITI as transformative tools for territorial cohesion, perfectly aligning with their commitment to grassroots empowerment and multi-level governance.  \nSD emphasizes the critical need to expand technical assistance programs for under-resourced localities, transforming administrative complexity into enhanced operational capacity for integrated investments.  \nSD strongly promotes mandatory earmarking of cohesion funds for CLLD/ITI post-2020, recognizing these instruments as indispensable for addressing demographic decline and youth unemployment in peripheral regions.  \nSD highlights the necessity of enforcing the 49% voting rights cap in LAGs through enhanced monitoring mechanisms, ensuring genuine bottom-up decision-making aligns with partnership principles.  \nSD advocates extending mountain region development strategies to island territories, proposing dedicated ITI frameworks that address unique geographic challenges through tailored multi-fund approaches."
      }
    ],
    "resolution": "The European Parliament raised the importance of enhancing territorial cohesion through integrated, place-based tools such as Community-led Local Development (CLLD) and Integrated Territorial Investment (ITI) under the 2014-2020 Cohesion Policy framework. It emphasized the role of these instruments in addressing regional disparities, demographic challenges, and unemployment—noting regions with unemployment rates up to 34.8%—by empowering local actors through bottom-up strategies, multi-fund approaches (combining ERDF, ESF, EAFRD, and EMFF), and fostering synergies between urban and rural areas. The resolution called for simplifying administrative processes, reducing gold-plating practices, and providing technical assistance to under-resourced localities to ensure equitable access to funding. It highlighted the need to align local strategies with EU objectives like the Europe 2020 agenda, smart specialization, and sustainable urban development, while urging Member States to prioritize youth employment, SME support, and social inclusion. Concerns were raised about inconsistent implementation, including \"box-ticking\" CLLD practices and limited multi-fund integration, with recommendations for stricter adherence to partnership principles, capacity-building for Local Action Groups (LAGs), and ensuring no single entity holds over 49% of voting rights in LAGs. The Parliament also stressed the importance of performance-based funding, transparency, and post-2020 reforms, requesting a Commission SWOT analysis of CLLD/ITI effectiveness and advocating for mandatory earmarking of these tools in future cohesion policy to strengthen territorial governance and economic resilience.",
    "total_score": 0.8105726872246696,
    "total_choice": 8,
    "party_num": 4,
    "id": 31,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.1,
      0.7,
      0.1,
      0.1
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "regional development",
    "title": "Promoting cohesion and development in the outermost regions of the EU: REPORT on promoting cohesion and development in the outermost regions of the EU: implementation of Article 349 of the TFEU",
    "background": "The EU's outermost regions face structural challenges including remoteness, insularity, economic dependence on limited sectors, and climate vulnerabilities, recognized under Article 349 TFEU mandating tailored measures. Previous EU strategies addressed these constraints through cohesion policies, agricultural programs like POSEI, and trade considerations. The Parliament will discuss implementing Article 349 to enhance region-specific policy adaptations.",
    "stances": [
      {
        "party_name": "EFDD",
        "score": 0.2894736842105263,
        "choice": 2,
        "stance": "EFDD rejects the issue's failure to explicitly prohibit extractive industries in marine zones, fully doubting with their environmental protection principles.  \nEFDD opposes the lack of binding measures against TTIP/CETA-style trade deals that threaten ORs' agricultural sectors and ecological stability.  \nThe proposal overlooks critical aspects such as dedicated funding mechanisms to combat marine waste pollution impacting coastal economies.  \nEFDD condemns the absence of enforceable safeguards against multinational corporations exploiting ORs' natural resources under the guise of \"blue growth\" initiatives.  \nThis framework remains inconsistent with EFDD's anti-corporate sovereignty stance by not barring investor-state dispute mechanisms in OR-related trade agreements."
      },
      {
        "party_name": "ALDE",
        "score": 0.8333333333333334,
        "choice": 8,
        "stance": "ALDE strongly promotes the issue’s emphasis on leveraging Article 349 to tailor EU policies, aligning perfectly with ALDE’s commitment to regional innovation and addressing structural challenges like remoteness and insularity.  \nALDE approves the expansion of the POSEI program and cohesion funding, recognizing their critical role in stabilizing agricultural sectors and advancing blue economy opportunities in outermost regions.  \nALDE underscores the geostrategic imperative to integrate outermost regions into Horizon 2020 and trans-European networks, effectively advancing their potential in renewable energy and maritime governance.  \nALDE proposes ensuring rigorous impact assessments for trade agreements to safeguard sensitive agricultural products, enhancing protections while maintaining alignment with single market principles.  \nALDE advocates maintaining long-term derogations for state aid under Articles 107(3)(a) and 349 TFEU, crucial for sustaining economic resilience in these regions."
      },
      {
        "party_name": "ECR",
        "score": 0.02857142857142857,
        "choice": 0,
        "stance": "ECR rejects the issue's narrow focus on outermost regions, which fundamentally rejects with their principle that all geographically disadvantaged areas—including post-communist regions and Mediterranean islands—deserve equal structural support.  \nECR opposes the failure to address crippling VAT increases on Aegean islands, directly contradicting the issue’s pledge for tax incentives and migration crisis mitigation in peripheral territories.  \nECR fundamentally disputes the lack of procedural reforms for EU fund accessibility, as highlighted by Croatia’s island depopulation crisis, rendering the issue incompatible with ECR’s demand for decentralized fiscal autonomy.  \nECR condemns the issue’s inadequate safeguards against free trade agreements, which leave traditional agricultural sectors in outermost regions vulnerable—a direct violation of ECR’s prioritization of market protectionism.  \nECR challenges the inconsistent policy coordination mechanisms, arguing they perpetuate legislative gaps that undermine cohesion—a core contradiction to ECR’s emphasis on subsidiarity and national-level sovereignty."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.72,
        "choice": 7,
        "stance": "GUE_NGL strongly endorses the issue’s emphasis on Article 349’s full implementation, aligning perfectly with their longstanding commitment to structural equity and differentiated policies for outermost regions’ unique vulnerabilities.  \nGUE_NGL approves the call for expanded POSEI funding and safeguards for local agricultural sectors, effectively advancing their priority of protecting small-scale producers from deregulated markets and trade agreement impacts.  \nGUE_NGL proposes enhancing maritime connectivity through a dedicated POSEI Transportes program to address insularity constraints, while maintaining full support for the issue’s blue economy and renewable energy priorities.  \nGUE_NGL highlights the necessity of integrating ORs’ geostrategic role into EU climate adaptation frameworks, ensuring frontline regions receive prioritized funding for biodiversity conservation and disaster resilience.  \nGUE_NGL strongly endorses maintaining permanent derogations for state aid under Article 107(3)(a), crucial for countering market concentration and securing ORs’ economic self-sufficiency."
      }
    ],
    "resolution": "The European Parliament raised concerns about the incomplete implementation of Article 349 TFEU, which grants special status to the EU’s outermost regions (ORs) due to structural challenges like remoteness, insularity, and economic dependence on limited products. It emphasized the need for tailored EU policies to address ORs’ unique constraints while leveraging their assets in renewable energy, blue growth, biodiversity, and sustainable tourism. The resolution highlighted the critical role of the POSEI agricultural program in supporting ORs’ farming sectors, urging its expansion to other policies and increased funding to mitigate market crises and trade agreement impacts, particularly for sensitive products like bananas, sugar, and milk. It called for enhanced cohesion policy, including €13 billion in structural funds (2014-2020), and stressed the importance of maintaining long-term derogations for state aid and tax regimes under Articles 107(3)(a) and 349 TFEU. The Parliament urged the Commission to develop an action plan with legislative initiatives, improve coordination across EU policies, and ensure ORs’ integration into trans-European networks and programs like Horizon 2020 and Erasmus+, while addressing connectivity gaps and high living costs. It also demanded rigorous impact assessments of trade agreements on ORs, activation of safeguard clauses, and stronger protections against competition from third-country products, particularly in agriculture. The resolution underscored ORs’ geostrategic importance, advocating for their role in maritime governance, climate research, and cross-border cooperation, and called for sustainable blue economy initiatives and marine conservation measures.",
    "total_score": 0.5773638968481375,
    "total_choice": 5,
    "party_num": 4,
    "id": 32,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.3,
      0.4,
      0.1,
      0.2
    ],
    "veto_party_name": "EFDD"
  },
  {
    "topic": "regional development",
    "title": "Specific measures for Greece: REPORT on the implementation of specific measures for Greece under Regulation 2015/1839",
    "background": "Greece experienced prolonged economic crisis with 26% GDP contraction (2007-2013), 27.5% unemployment peak, and liquidity constraints hindering public investment, compounded by migration pressures on islands. The Parliament will discuss EU cohesion policy implementation through Regulation 2015/1839 addressing financial instability and structural fund absorption challenges during programming periods.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9436619718309859,
        "choice": 9,
        "stance": "EPP firmly supports the exceptional liquidity measures under Regulation 2015/1839, which perfectly align with its commitment to solidarity-driven cohesion policy, as evidenced by Greece’s 100% absorption of 2007-2013 funds and the preservation of 63% of allocations for business recovery.  \nEPP perfectly aligns with the issue’s emphasis on qualitative post-crisis reforms, particularly the Structural Reform Support Programme, reflecting its priority to embed competitiveness and sustainability within cohesion frameworks.  \nEPP firmly supports the 100% EU co-financing rate for 2007-2013 projects, a decisive act of solidarity that directly advanced Greece’s infrastructure modernization and tax revenue growth, in line with EPP’s crisis-response principles.  \nEPP applauds the early release of retained payments and pre-financing mechanisms, which exemplify its manifesto pledge to deploy cohesion funds as the EU’s primary investment tool during systemic shocks.  \nEPP underscores the issue’s success in surpassing EU-average absorption rates (97% by 2016), a testament to its unwavering stance that cohesion policy must remain agile and visible in restoring economic stability."
      },
      {
        "party_name": "ENF",
        "score": 0.0,
        "choice": 0,
        "stance": "ENF firmly opposes the issue’s portrayal of EU aid success, citing Greece’s 50% GDP collapse and 40% youth unemployment as catastrophic outcomes of €500 billion in failed interventions.  \nENF rejects the claim that cohesion policy mitigated Greece’s crisis, arguing that debt restructuring and liquidity measures instead entrenched economic dependency and destroyed productive capacity.  \nThe issue’s emphasis on absorption rates conflicts with ENF’s principle that fiscal sovereignty must supersede EU-imposed financial mechanisms, which they view as destructive to national autonomy.  \nENF condemns the omission of accountability for policies that halved Greece’s economy, aligning with their stance against supranational fiscal overreach that exacerbates crises.  \nThe proposal overlooks ENF’s critique that EU aid structurally undermined Greece’s competitiveness, prioritizing bureaucratic compliance over sustainable growth."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.8653846153846154,
        "choice": 8,
        "stance": "GREEN_EFA strongly agrees the successful implementation of EU cohesion measures in Greece, which align perfectly with their commitment to solidarity and crisis response through targeted investment.  \nGREEN_EFA applauds the issue’s focus on preserving jobs and boosting tax revenues via ESI Funds, effectively advancing their priority of equitable economic recovery.  \nGREEN_EFA proposes enhancing future assessments to explicitly prioritize green infrastructure and renewable energy projects, ensuring alignment with climate neutrality goals.  \nGREEN_EFA approves the emphasis on transparency in project visibility, urging accelerated publication of reform outcomes to strengthen public trust in EU mechanisms.  \nGREEN_EFA highlights the issue’s validation of cohesion policy as a counter to austerity, consistent with their manifesto principles for socially just crisis management."
      },
      {
        "party_name": "SD",
        "score": 0.9144385026737968,
        "choice": 9,
        "stance": "SD firmly supports the issue’s 100% EU co-financing and liquidity provisions, perfectly aligning with their commitment to counter austerity through structural fund mobilization.  \nSD perfectly aligns with the emphasis on cohesion policy’s transformative role in Greece’s recovery, highlighting its success in preserving jobs and raising GDP as a model for EU solidarity.  \nSD fully supports the issue’s call for qualitative assessments of competitiveness and sustainability, reinforcing their advocacy for reforms via the Structural Reform Support Programme.  \nSD endorses the transparency mechanisms in project visibility and closure updates, aligning with their principles of accountable governance and anti-austerity investment.  \nSD applauds the 100% absorption rate for 2007-2013 funds as a testament to effective EU-Greece collaboration, mirroring their vision for cohesion policy as the Union’s primary social investment tool."
      }
    ],
    "resolution": "The European Parliament raised the critical role of EU cohesion policy in mitigating Greece’s severe economic crisis, noting that between 2007-2015, Greece received €15.8 billion from the ERDF and Cohesion Fund, representing 19% of its public capital expenditure. The resolution highlighted Greece’s 26% GDP decline (2007-2013), unemployment peaking at 27.5%, and persistent challenges from the migration crisis impacting tourism. It underscored Regulation (EU) 2015/1839, which provided tailored support, including a 100% EU co-financing rate for 2007-2013 projects, early release of 5% retained payments, and €2 billion in liquidity (2015-2016) via pre-financing for 2014-2020 programs. This enabled completion of 181 priority projects (€11.5 billion, 55% of 2007-2013 allocations), with 63% of payments aiding businesses and 37% supporting infrastructure. Greece achieved a 97% payment rate by March 2016 and a 100% absorption rate for 2007-2013 funds, surpassing the EU average of 96%. The measures boosted economic activity, preserved jobs, and increased tax revenues, with ESI Funds estimated to have raised Greece’s 2015 GDP by over 2%. However, the Parliament stressed the need for qualitative assessments beyond absorption rates, urging focus on competitiveness, sustainability, and reforms via the Structural Reform Support Programme. It cautioned against recurring reduced co-financing measures, emphasizing cohesion policy’s role as the primary investment tool, and called for transparency in project visibility and closure updates.",
    "total_score": 0.8008130081300813,
    "total_choice": 8,
    "party_num": 4,
    "id": 33,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.1,
      0.1,
      0.1,
      0.7
    ],
    "veto_party_name": "ENF"
  },
  {
    "topic": "regional development",
    "title": "Specific provisions for the European territorial cooperation goal (Interreg): REPORT on the proposal for a regulation of the European Parliament and of the Council on specific provisions for the European territorial cooperation goal (Interreg) supported by the European Regional Development Fund and external financing instruments",
    "background": "The European territorial cooperation program Interreg, operational since 1990, facilitates cross-border collaboration through EU funding. Ongoing challenges include administrative barriers, evolving geopolitical dynamics, and cohesion policy priorities, prompting a review of its regulatory framework. The Parliament will discuss proposed adjustments to Interreg’s structure, funding mechanisms, and operational scope for the 2021-2027 period.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.8046511627906977,
        "choice": 8,
        "stance": "EPP strongly approves the modernization of cross-border cooperation through Interreg's innovative projects, particularly endorsing the €1 billion allocation for scaling technologies like 3D printing, which aligns with their commitment to regional economic transformation.  \nEPP approves the expanded territorial cooperation framework linking Interreg with neighborhood policies, emphasizing its role in overcoming legal and administrative barriers while proposing to maintain current funding levels to ensure structural impact.  \nEPP applauds the simplified cost mechanisms and 85% co-financing rate as crucial for small beneficiaries, while suggesting a review of the n+2 implementation period to prevent unintended fund underutilization in border regions.  \nEPP highlights successful Interreg models like Spain-Portugal collaboration as evidence for protecting cohesion policy budgets, aligning with their priority to counter populism through tangible cross-border infrastructure projects.  \nEPP endorses enhanced institutional capacities for territorial groups, urging member states to empower local authorities in managing European funds to strengthen regional cooperation networks."
      },
      {
        "party_name": "EFDD",
        "score": 0.38095238095238093,
        "choice": 3,
        "stance": "EFDD slightly agrees the elevation of maritime cross-border programs to Axis 1 but demands amendments to Article 4 to explicitly exclude national co-financing contributions from deficit calculations, as the current text risks perpetuating fiscal rigidity.  \nEFDD argues the 80% EU co-financing rate remains insufficient for Mediterranean projects, failing to address asymmetrical burdens on southern regions’ budgets – inconsistent with their anti-austerity platform.  \nEFDD highlights that the issue’s cross-sectoral engagement mechanisms overlook mandatory consultation of local authorities in project design, contradicting their decentralization principles."
      },
      {
        "party_name": "ALDE",
        "score": 0.9393939393939394,
        "choice": 9,
        "stance": "ALDE firmly supports the €11 billion allocation for Interreg, perfectly aligning with their commitment to cross-border integration and territorial cohesion as cornerstones of European unity.  \nALDE perfectly aligns with the €1 billion interregional innovation initiative, recognizing its strategic value in consolidating Europe’s global competitiveness against major economies.  \nALDE fully supports the issue’s prioritization of European added value over geographic criteria, advancing their vision for pan-European collaboration in research and market-driven innovation.  \nALDE applauds the urgency for swift Council negotiations, reflecting their manifesto priority to operationalize Interreg by 2021 and accelerate borderless economic opportunities.  \nALDE endorses the issue’s cross-sectoral governance framework, which effectively mirrors their policy agenda for harmonized regional development and job creation."
      },
      {
        "party_name": "SD",
        "score": 0.9130434782608695,
        "choice": 9,
        "stance": "SD completely approves the allocation of over €11 billion for Interreg projects, perfectly aligning with SD's longstanding commitment to robust cross-border cooperation and equitable regional development.  \nSD applauds the issue's emphasis on Interreg as a transformative tool for peace-building, which effectively advances SD's priority of fostering European integration through grassroots territorial collaboration.  \nSD highlights the strategic value of European Groupings of Territorial Cooperation (EGTCs), recognizing their proven capacity to operationalize SD's vision for institutionalized cross-border governance frameworks.  \nSD emphasizes the issue's alignment with SD's manifesto goals by prioritizing tangible quality-of-life improvements for citizens through concrete transnational projects.  \nSD fully supports maintaining legislative transparency through mandatory Commission reconsultation, ensuring procedural continuity that mirrors SD's institutional accountability principles."
      }
    ],
    "resolution": "The European Parliament raised its position at first reading on the Commission’s proposal (COM(2018)0374), informed by the Committee on Regional Development’s report and opinions from the Committees on Foreign Affairs, Development, Budgetary Control, and Culture and Education (A8-0470/2018). It called on the Commission to resubmit the proposal to Parliament if it significantly amends or replaces its initial text, ensuring legislative transparency and procedural continuity. The Parliament also instructed its President to formally transmit its adopted position to the Council, the Commission, and national parliaments, emphasizing the need for coordinated interinstitutional engagement to advance the legislative process under relevant Treaty provisions. The resolution integrated input from the European Economic and Social Committee and the Committee of the Regions, reflecting a cross-sectoral approach to regional development and policy alignment.",
    "total_score": 0.7741496598639456,
    "total_choice": 7,
    "party_num": 4,
    "id": 34,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.1,
      0.1,
      0.1,
      0.7
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "regional development",
    "title": "Structural Reform Support Programme: financial envelope and general objective: REPORT on the proposal for a regulation of the European Parliament and of the Council amending Regulation (EU) 2017/825 to increase the financial envelope of the Structural Reform Support Programme and adapt its general objective",
    "background": "The Structural Reform Support Programme, established in 2017 to assist EU member states in implementing reforms, faced increased demand exceeding its initial budget, prompting a 2017 Commission proposal to enhance resources. The Parliament will discuss amendments to the programme’s regulation concerning budgetary increases and expanded objectives, including preparatory measures for euro adoption.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.8584905660377359,
        "choice": 8,
        "stance": "EPP strongly promotes the increased financial envelope as essential for addressing structural challenges, aligning perfectly with their commitment to cohesion and effective EU fund implementation.  \nEPP proposes enhancing reform design by ensuring country-specific solutions that reduce bureaucratic barriers while maintaining developmental priorities.  \nEPP approves the new monitoring framework for fund effectiveness, reflecting their longstanding focus on transparent, results-driven cohesion policy.  \nEPP endorses prioritizing non-Eurozone states to accelerate convergence, exemplified by Croatia’s successful utilization of 17 reform projects.  \nEPP emphasizes aligning future expansions with the next Multiannual Financial Framework to balance scalability and program integrity."
      },
      {
        "party_name": "ENF",
        "score": 0.0,
        "choice": 0,
        "stance": "ENF totally doubts the issue’s failure to implement direct EU oversight mechanisms for cohesion funds transferred to member states like Bulgaria.  \nENF rejects the proposal’s assumption that recipient governments can reliably audit expenditures, contradicting their stance against fiscal irresponsibility in cross-border transfers.  \nThe proposal overlooks critical aspects such as Dutch taxpayer protections, directly conflicting with ENF’s anti-redistribution principles.  \nENF highlights the structural contradiction between Articles 175/197(2) objectives and unverified fund allocation to administrations with documented governance deficiencies.  \nThis approach fails to address ENF’s core demand for national veto powers over EU expenditure of domestically raised tax revenues."
      },
      {
        "party_name": "SD",
        "score": 0.8297872340425532,
        "choice": 8,
        "stance": "SD strongly promotes the issue’s integration of social responsibility into structural reforms, ensuring alignment with SD’s commitment to protecting citizens’ rights and sustainable economic growth under Articles 175 and 197(2) TFEU.  \nSD strongly advocates maintaining the voluntary nature of the Structural Reform Support Programme to respect member state autonomy through the principle of subsidiarity.  \nSD proposes enhancing coordination mechanisms between the programme and existing EU structural funds to maximize policy coherence and territorial development impact.  \nSD emphasizes the necessity of safeguarding public health systems and labor protections within reform agendas to prevent market-driven erosion of social standards.  \nSD applauds the cross-sectoral committee approach as vital for addressing economic disparities through combined social and economic investments."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.02040816326530612,
        "choice": 0,
        "stance": "GUE_NGL rejects the proposal's core premise of diverting cohesion policy funds towards structural reforms that enforce austerity policies harming workers and public welfare systems.  \nGUE_NGL entirely conflicts the program's alignment with privatization agendas and labor market precarization disguised as \"competitiveness measures\" in Articles 2-4.  \nGUE_NGL condemns the Council's removal of anti-tax evasion provisions and poverty reduction targets as proof the issue prioritizes capital accumulation over wealth redistribution.  \nGUE_NGL declares the financial envelope increase incompatible with their principles, citing systemic failures to address territorial disparities through public investment rather than market-driven reforms.  \nGUE_NGL demands full rejection of this neoliberal framework, asserting it violates Treaty obligations under Article 174 to reduce regional inequalities through democratic, socially just cohesion policies."
      }
    ],
    "resolution": "The European Parliament raised its position on the Commission’s 2017 proposal (COM(2017)0825) concerning cohesion policy and structural reforms, emphasizing alignment with Treaty objectives under Articles 175 and 197(2) to strengthen economic, social, and territorial cohesion. It endorsed measures to enhance administrative capacity and effective implementation of EU funds, particularly in member states facing structural challenges. The resolution integrated input from multiple committees, including Regional Development, Budgets, Economic and Monetary Affairs, and Employment and Social Affairs, reflecting a cross-sectoral approach to fostering sustainable growth and reducing disparities. Parliament urged the Commission to resubmit the proposal for further scrutiny if substantial amendments were made, ensuring continued parliamentary oversight. It also mandated the transmission of its adopted position to the Council, Commission, and national parliaments to reinforce transparency and institutional cooperation.",
    "total_score": 0.6603260869565217,
    "total_choice": 6,
    "party_num": 4,
    "id": 35,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.1,
      0.4,
      0.4,
      0.1
    ],
    "veto_party_name": "GUE_NGL"
  },
  {
    "topic": "regional development",
    "title": "The European Union Solidarity Fund: an assessment: REPORT on the European Union Solidarity Fund: an assessment",
    "background": "The European Union Solidarity Fund, established in 2002 following severe Central European floods, provided €3.8 billion for over 70 disasters across 24 states by 2016. Revisions in 2014 aimed to streamline procedures amid rising disaster frequency linked to climate change. The Parliament will discuss the Fund’s operational efficiency, eligibility criteria, and coordination with structural funds.",
    "stances": [
      {
        "party_name": "EFDD",
        "score": 0.5263157894736842,
        "choice": 5,
        "stance": "EFDD supports with suggestions the increased advance payments to 15% but urges explicit exclusion of reconstruction investments from stability pact deficit calculations.  \nEFDD advises amending eligibility criteria to include cumulative disaster damages across multiple events in the same region annually.  \nEFDD endorses accelerated fund processing deadlines while expressing concern that current budget rigidity undermines post-disaster rebuilding efforts.  \nEFDD calls for binding provisions to align EUSF disbursements with ecosystem-based reconstruction, reflecting climate adaptation priorities.  \nEFDD stresses the need to communicate fund accessibility more clearly to affected communities, as delayed awareness compounds disaster impacts.  "
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.8,
        "choice": 8,
        "stance": "GREEN_EFA strongly endorses the issue's emphasis on climate change adaptation and disaster prevention through ecosystem-based approaches, aligning perfectly with their commitment to sustainable crisis management.  \nGREEN_EFA applauds the push for enhanced transparency via public implementation reports and a European Court of Auditors review, which directly advances their priorities for accountable EU financial instruments.  \nGREEN_EFA endorses the proposed integration of non-GDP indicators like the Human Development Index, recognizing this as critical for equitable solidarity across regions with varying economic capacities.  \nGREEN_EFA proposes expanding the issue’s disaster exemption provisions to uniformly cover all natural hazard types, preventing selective fiscal loopholes while maintaining strict Stability Pact compliance.  \nGREEN_EFA approves the call to streamline cross-border applications and assess indirect damages, urging swift adoption to strengthen collective resilience without compromising fiscal responsibility frameworks."
      },
      {
        "party_name": "ALDE",
        "score": 0.9322033898305084,
        "choice": 9,
        "stance": "ALDE firmly accepts the issue’s emphasis on maintaining the 2014 EUSF reforms as a robust framework for rapid disaster response, perfectly aligning with ALDE’s commitment to streamlined EU mechanisms.  \nALDE perfectly aligns with calls to prioritize climate adaptation and prevention, reflecting their long-standing advocacy for science-based risk management and ecosystem resilience.  \nALDE emphasizes the necessity of allowing current procedural improvements—such as advance payments and synergies with ESIF—to demonstrate full efficacy before further revisions, ensuring stability for beneficiaries.  \nALDE strongly promotes maintaining strict adherence to the Stability and Growth Pact’s deficit rules, viewing fiscal discipline as complementary to sustainable reconstruction efforts under the EUSF.  \nALDE applauds the issue’s focus on transparency and accountability, particularly public access to implementation reports, which aligns with their manifesto priorities for EU institutional integrity."
      },
      {
        "party_name": "ECR",
        "score": 0.6764705882352942,
        "choice": 6,
        "stance": "ECR supports the issue’s emphasis on accelerating fund disbursement and urges further simplification of cross-border applications to address delays in crisis response.  \nECR advises increasing advance payments beyond 15% for regions with recurring disasters, citing the prolonged recovery challenges in Croatia and Central Italy.  \nECR highlights the need to integrate direct logistical aid during active disasters, aligning with calls for ecosystem-based risk management strategies.  \nECR stresses that persistent bureaucratic delays undermine solidarity, proposing stricter enforcement of the Commission’s six-week response deadline.  \nECR recommends prioritizing indirect damage assessments in eligibility criteria, particularly for agricultural economies as seen in Amatrice."
      }
    ],
    "resolution": "The European Parliament raised key points regarding the European Union Solidarity Fund (EUSF), emphasizing its role as a critical instrument for emergency and recovery operations following major natural disasters, having mobilized €3.8 billion across 24 beneficiary states and accession countries for over 70 disasters since 2002, including floods, earthquakes, and droughts. The 2014 reform streamlined procedures, introducing advance payments of up to 10% (capped at €30 million) of anticipated aid, extending application deadlines to 12 weeks post-disaster and project implementation to 18 months, and setting a six-week Commission response timeframe. The revised regulation clarified eligibility criteria for regional disasters, maintaining a threshold of 1.5% of regional GDP (1% for outermost regions), and emphasized synergies with EU Structural and Investment Funds (ESIF) for prevention and sustainable reconstruction. Parliament highlighted persistent delays in fund disbursement despite reforms, urging further administrative improvements, accelerated closure of legacy cases, and enhanced transparency through public access to implementation reports and a special European Court of Auditors review. It called for future revisions to increase advance payments to 15%, reduce processing deadlines to four weeks, and integrate non-GDP indicators like the Human Development Index. Climate change adaptation and disaster prevention were underscored, with demands for stricter risk management strategies and alignment of EUSF support with ecosystem-based approaches. The resolution also stressed the need for efficient public procurement, clearer monitoring criteria, and better communication of EUSF assistance to demonstrate EU solidarity, while addressing underutilized annual allocations (capped at €500 million) and advocating for simplified cross-border applications and consideration of indirect damages in eligibility assessments.",
    "total_score": 0.8107714701601164,
    "total_choice": 8,
    "party_num": 4,
    "id": 36,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.7,
      0.1,
      0.1,
      0.1
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "regional development",
    "title": "Urban dimension of EU policies: REPORT on the urban dimension of EU policies",
    "background": "By 2014, 72% of the EU population resided in urban areas, projected to reach 80% by 2050, amid challenges including economic disparities, environmental pressures, and governance complexities. Existing EU frameworks like the Leipzig Charter and Europe 2020 strategy addressed urban sustainability but lacked coordinated cross-sectoral integration. The Parliament will discuss enhancing the urban dimension across EU policy areas.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9166666666666666,
        "choice": 9,
        "stance": "EPP firmly endorses the allocation of 5% ERDF to integrated urban development, perfectly aligning with their commitment to territorial cohesion and smart investment.  \nEPP perfectly aligns with the issue's demand for multi-level governance, emphasizing cities' role as innovation hubs as highlighted in the Europe 2020 strategy.  \nEPP firmly endorses enhanced coordination of smart city initiatives with transport and environmental policies, advancing their vision for holistic urban ecosystems.  \nEPP perfectly supports the call for territorial impact assessments, mirroring their insistence on cross-border cooperation to overcome regional disparities.  \nEPP firmly endorses the Urban Audit expansion, recognizing it as critical to data-driven policymaking that reflects EPP’s evidence-based governance principles."
      },
      {
        "party_name": "EFDD",
        "score": 0.02564102564102564,
        "choice": 0,
        "stance": "EFDD completely disapproves the centralization of urban policy planning under EU authority, rejecting the premise that economic growth is better driven by EU Commissioners than local entrepreneurs and taxpayers.  \nEFDD rejects the mandated 5% ERDF allocation for integrated urban development as wasteful central planning that contradicts their principle of leaving resources in citizens' hands.  \nEFDD opposes the creation of an EU urban coordinator and summits, viewing this as bureaucratic layering that distances decision-making from communities like the West Midlands fighting against imposed regional authorities.  \nEFDD condemns the issue's failure to address concrete urban regeneration needs, particularly the neglect of historic city centers in favor of peripheral construction projects that create social ghettos.  \nEFDD highlights the issue's inconsistency with localism through its silence on Southern Italy's chronic mismanagement of cohesion funds, proving EU programming cannot substitute municipal competence."
      },
      {
        "party_name": "ENF",
        "score": 0.0,
        "choice": 0,
        "stance": "ENF opposes fundamentally the EU Urban Agenda as unconstitutional centralization exceeding treaty-based competencies of the Union.  \nENF rejects the 5% ERDF allocation for urban development, viewing it as fiscal overreach that bypasses national sovereignty in territorial planning.  \nENF condemns the proposed EU urban coordinator and summits, arguing they institutionalize supranational interference in local governance traditions.  \nENF highlights cohesion policy failures evidenced by widening regional disparities, contradicting the issue’s claims of fostering convergence.  \nENF asserts the issue’s \"participative citizenship\" model erodes rural and mid-sized communities, violating subsidiarity principles."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.9534883720930233,
        "choice": 9,
        "stance": "GREEN_EFA fundamentally sanctions the issue’s integrated approach to urban policy, perfectly aligning with their vision of cities as laboratories for ecological transition and social justice. They emphasize the critical need to operationalize multi-level governance through immediate establishment of the EU urban coordinator role.  \n\nGREEN_EFA perfectly aligns with demands for increased ERDF allocations to sustainable urban development, proposing strengthened criteria to prioritize projects combating energy poverty and spatial segregation as demonstrated in Central Europe.  \n\nGREEN_EFA applauds the issue’s focus on territorial impact assessments while urging explicit integration of gender-responsive budgeting tools to address care infrastructure gaps in cities.  \n\nGREEN_EFA endorses the call for cohesion policy reforms, advocating accelerated implementation of partnership principles to prevent exclusionary investments like Hungary’s segregated water infrastructure projects.  \n\nGREEN_EFA supports enhanced Urban Audit mechanisms but proposes complementary anti-fraud frameworks with real-time transparency portals for cohesion spending, directly advancing the issue’s accountability goals."
      }
    ],
    "resolution": "The European Parliament raised the need for an integrated European Urban Agenda to address the challenges and opportunities of urbanization, noting that 72% of the EU population resides in urban areas, projected to reach 80% globally by 2050. It emphasized cities as economic engines and hubs for innovation, social inclusion, and sustainability, while highlighting disparities such as aging populations, youth unemployment, environmental degradation, and infrastructure pressures. The resolution called for enhanced coordination of EU policies impacting urban areas, including cohesion funds, with at least 5% of the European Regional Development Fund (ERDF) allocated to integrated sustainable urban development through tools like Integrated Territorial Investments (ITIs) and Community-Led Local Development (CLLD). It urged territorial impact assessments for EU legislation, improved data collection via the Urban Audit, and multi-level governance involving cities in policymaking, including a proposed EU urban coordinator and regular urban summits. The Parliament stressed alignment with the Europe 2020 strategy, smart growth, and international frameworks like the UN’s Habitat III agenda, while advocating for cross-sectoral synergies between funding programs, reduced regulatory burdens, and pilot projects to test integrated solutions for challenges such as energy efficiency, mobility, and social exclusion.",
    "total_score": 0.7359050445103857,
    "total_choice": 7,
    "party_num": 4,
    "id": 37,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.4,
      0.3,
      0.1,
      0.2
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "regional development",
    "title": "The impact of EU cohesion policy on Northern Ireland: REPORT on the impact of EU cohesion policy on Northern Ireland",
    "background": "EU cohesion policy programs, including PEACE and Interreg, have funded cross-community reconciliation and economic development in Northern Ireland since the 1998 Good Friday Agreement, with Brexit raising questions about post-2020 funding continuity. The Parliament will discuss the policy’s role in peacebuilding and regional stability amid UK-EU withdrawal negotiations.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9436619718309859,
        "choice": 9,
        "stance": "EPP totally promotes the issue's emphasis on EU cohesion policy as vital for sustaining peace and economic growth in Northern Ireland, aligning perfectly with EPP's commitment to cross-border cooperation and reconciliation.  \nEPP perfectly aligns with the call to maintain Northern Ireland's participation in EU programs post-Brexit, recognizing their irreplaceable role in upholding the Good Friday Agreement and preventing societal divisions.  \nEPP strongly approves the proposed extension of PEACE+ and Interreg initiatives under the 2021-2027 MFF, highlighting their proven success in fostering shared spaces and trust between communities.  \nEPP applauds the issue's focus on youth access to Erasmus+ exchanges, which directly advances EPP's priority of fostering European identity and intercultural understanding among future generations.  \nEPP totally promotes replicating Northern Ireland's reconciliation model in other conflict regions, demonstrating the EU's unique capacity to transform historical divisions through targeted cohesion instruments."
      },
      {
        "party_name": "ALDE",
        "score": 0.9264705882352942,
        "choice": 9,
        "stance": "ALDE firmly supports the uninterrupted continuation of PEACE and Interreg programmes, emphasizing their irreplaceable role in sustaining the Good Friday Agreement’s peace architecture through EU-funded cross-community trust-building.  \nALDE perfectly aligns with the issue’s demand to replicate Northern Ireland’s reconciliation model in other conflict-affected regions such as the Balkans, advocating for structured EU peacebuilding frameworks to address historical divisions.  \nALDE underscores the critical importance of maintaining full EU funding visibility in Northern Ireland, ensuring communities directly associate cohesion policy with European solidarity and shared democratic values.  \nALDE champions the expansion of PEACE-inspired initiatives to post-conflict zones like the Basque Country, leveraging the programme’s proven capacity to transform societal fractures into collaborative governance structures.  \nALDE unequivocally supports embedding Northern Ireland’s post-Brexit access to Erasmus+ and Interreg within future EU-UK agreements, safeguarding youth mobility as a pillar of lasting cross-border understanding."
      },
      {
        "party_name": "SD",
        "score": 0.9090909090909091,
        "choice": 9,
        "stance": "SD completely agrees the issue’s emphasis on sustaining EU-funded peacebuilding programs, which perfectly aligns with SD’s commitment to cross-border reconciliation and the indivisible integrity of the Good Friday Agreement.  \nSD perfectly aligns with the call to maintain Northern Ireland’s access to EU instruments like Erasmus+, reflecting SD’s decades-long advocacy for youth engagement in peace processes.  \nSD completely agrees the warning against post-2020 funding discontinuation, as this directly advances SD’s priority of preventing Brexit-induced economic destabilization in vulnerable regions.  \nSD perfectly aligns with the issue’s recognition of EU cohesion policy as irreplaceable, echoing SD’s condemnation of ideological austerity undermining shared prosperity.  \nSD completely agrees replicating Northern Ireland’s reconciliation model globally, a testament to SD’s vision of EU solidarity as a blueprint for conflict issue."
      },
      {
        "party_name": "ECR",
        "score": 0.3333333333333333,
        "choice": 3,
        "stance": "ECR partially accepts the recognition of EU funds’ socioeconomic contributions but fundamentally rejects with the issue’s assertion that peace process stability depends on continued EU financing.  \nECR requests revisions to remove implications that terrorism could resurge without EU funds, deeming this incompatible with principled opposition to legitimizing violent actors.  \nThe issue overlooks critical aspects of post-Brexit governance by failing to specify accountability mechanisms for Northern Ireland’s participation in EU programs absent UK institutional representation.  \nECR challenges the structural reliance on EU frameworks for cross-border cooperation, advocating instead for localized authority models consistent with devolution principles.  \nThe proposal’s narrative disproportionately attributes reconciliation progress to EU interventions, requiring amendments to acknowledge grassroots leadership in peacebuilding."
      }
    ],
    "resolution": "The European Parliament raised the significant impact of EU cohesion policy on Northern Ireland, particularly through instruments like the PEACE Programme and Interreg V-A, which have supported peace, cross-community reconciliation, and economic development since 1995. Over €1.5 billion has been allocated to these initiatives, with €1 billion dedicated to the current financing period (including €230 million for PEACE IV and €240 million for Interreg V-A), fostering economic stability, shared spaces, and trust-building between communities. The resolution highlighted that 85% of PEACE and Interreg funding originates from the EU, stressing the risk to cross-border cooperation and peacebuilding if EU support ends post-2020. It urged continued participation of Northern Ireland in EU programs post-Brexit, emphasizing their role in sustaining the Good Friday Agreement and addressing societal divisions. The Parliament welcomed the UK’s openness to explore successor programs and the Commission’s proposal to extend these initiatives in the 2021-2027 MFF, while advocating for maintained funding levels, visibility of EU contributions, and replication of Northern Ireland’s reconciliation model in other conflict regions. It also underscored the importance of youth access to EU exchanges like Erasmus+ and called for innovative solutions to ensure ongoing support for peace and economic cohesion.",
    "total_score": 0.7655826558265583,
    "total_choice": 7,
    "party_num": 4,
    "id": 38,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.2,
      0.2,
      0.2,
      0.4
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "regional development",
    "title": "The right funding mix for Europe’s regions: balancing financial instruments and grants in EU cohesion policy: REPORT on the right funding mix for Europe’s regions: balancing financial instruments and grants in EU cohesion policy",
    "background": "The mid-term review of the 2014-2020 EU Cohesion Policy programming period and Multiannual Financial Framework revision prompted examination of funding mechanisms, following increased use of financial instruments post-2008 crisis alongside traditional grants. The Parliament will discuss optimizing the balance between financial instruments and grants in regional development strategies.",
    "stances": [
      {
        "party_name": "EFDD",
        "score": 0.05128205128205128,
        "choice": 0,
        "stance": "EFDD rejects the issue's promotion of financial instruments as dangerously opaque mechanisms that prioritize banking interests over SME viability, directly conflicting with EFDD's anti-financialization principles.  \nEFDD totally rejects the characterization of \"EU funding\" as a legitimate concept, asserting this misrepresents taxpayer money extracted from member states without democratic consent.  \nEFDD condemns the proposed technical assistance budget expansions (€13.4 billion) as perpetuating historical mismanagement patterns, contravening EFDD's demands for radical fiscal transparency.  \nEFDD disputes the issue's assumption that EIB collaboration strengthens cohesion policy, highlighting systemic risks of centralized financial governance incompatible with subsidiarity.  \nEFDD warns the FI/grant balance framework ignores Brexit's fiscal destabilization effects, reflecting EU institutional overreach that EFDD categorically rejects."
      },
      {
        "party_name": "ENF",
        "score": 0.0,
        "choice": 0,
        "stance": "ENF rejects the mandatory imposition of financial instruments as completely opposeing with national sovereignty in cohesion policy decisions.  \nENF opposes the issue’s shift toward financial instruments, which overlooks critical aspects like Romania’s reliance on grants for regional development.  \nENF condemns centralized FI mandates as inconsistent with subsidiarity principles, prioritizing financial intermediaries over local needs.  \nENF opposes the Commission’s FI-driven approach, which undermines cohesion goals by displacing grants essential for small farms and SMEs.  \nENF demands unconditional grant autonomy for member states, rejecting one-size-fits-all FI quotas that exacerbate regional disparities."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.8297872340425532,
        "choice": 8,
        "stance": "GREEN_EFA strongly approves the issue's emphasis on preventing financial instruments from exacerbating regional inequalities, aligning perfectly with their commitment to territorial justice and equitable access to cohesion resources.  \nGREEN_EFA endorses the call for enhanced technical assistance but proposes amending implementation protocols to mandate direct allocation of 25% of such funds to municipal and community-level actors, addressing gaps in local capacity building.  \nGREEN_EFA applauds the focus on synergies between ESI Funds and Horizon 2020 as effectively advancing their vision of integrating smart specialization strategies with green transition priorities in lagging regions.  \nGREEN_EFA approves the issue’s warning against substituting grants with financial instruments in agriculture, reinforcing their longstanding defense of small-scale sustainable farming systems.  \nGREEN_EFA highlights the need to operationalize transparency measures through real-time public dashboards tracking FI disbursements by region, ensuring accountability in cohesion spending."
      },
      {
        "party_name": "SD",
        "score": 0.92,
        "choice": 9,
        "stance": "SD totally agrees the issue’s prioritization of grants as the cornerstone of cohesion policy, perfectly aligning with S&D’s commitment to equitable regional development and support for small beneficiaries like rural SMEs and public infrastructure projects.  \nSD perfectly aligns with the call to enhance technical assistance for local authorities, emphasizing its role in building institutional capacity and fostering a new generation of European leadership capable of maximizing cohesion policy’s transformative potential.  \nSD totally agrees maintaining a social pillar within cohesion policy, ensuring financial instruments reinforce investments in education, sustainable energy, and innovation to combat unemployment and regional disparities.  \nSD perfectly aligns with the issue’s rejection of one-size-fits-all approaches, advocating for positive discrimination measures to channel tailored support to underdeveloped regions with high unemployment or depopulation challenges.  \nSD totally agrees safeguarding cohesion policy from dilution by migration or security agendas, emphasizing its irreplaceable role in reducing economic imbalances and upholding solidarity as a core EU value."
      }
    ],
    "resolution": "The European Parliament raised concerns and outlined key points regarding the use of financial instruments (FIs) and grants in EU Cohesion Policy, emphasizing their roles in addressing regional disparities and achieving Europe 2020 objectives. It noted that ESI Funds investments totaled EUR 347.6 billion (2007-2013) and EUR 454 billion (2014-2020), rising to EUR 637 billion with national co-financing. FI allocations under ERDF, CF, and ESF nearly doubled from EUR 11.7 billion (2007-2013) to EUR 20.9 billion (2014-2020), representing 6% of cohesion policy funds. The Cohesion Fund’s allocation increased to EUR 75 billion (2014-2020), supporting regions housing 34% of the EU population. While grants remain vital for non-revenue projects (e.g., public infrastructure, social services), FIs offer leverage and revolving benefits but face challenges like administrative complexity, delayed implementation, and lower-than-expected private capital mobilization. The Parliament highlighted divergent FI performance across Member States, citing issues from the 2007-2013 period, such as low disbursement rates and high management costs. It urged simplification of state aid rules, better synergies between ESI Funds and instruments like EFSI and Horizon 2020, and enhanced technical assistance for local authorities. The resolution stressed maintaining a balanced mix of grants and FIs tailored to regional needs, avoiding one-size-fits-all approaches, and ensuring FIs complement rather than replace grants, particularly in agriculture and rural development, where grants remain critical for small farms and rural SMEs. It called for improved transparency, harmonized reporting, and measures to address implementation delays, warning against allowing migration, security, or political developments to undermine cohesion goals. The EIB’s role was acknowledged, with EUR 147 billion lent for cohesion (2007-2013), and further collaboration was urged to optimize FI use while safeguarding democratic oversight and regional cohesion priorities.",
    "total_score": 0.6844380403458213,
    "total_choice": 6,
    "party_num": 4,
    "id": 39,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.3,
      0.1,
      0.1,
      0.5
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "regional development",
    "title": "The role of EU regions and cities in implementing the COP 21 Paris Agreement on climate change: REPORT on the role of EU regions and cities in implementing the COP 21 Paris Agreement on climate change",
    "background": "The EU's ratification of the 2015 Paris Agreement, its urban climate vulnerability (72.5% population in cities contributing 60-80% energy consumption/CO₂ emissions), and existing frameworks like SDG 11 and the Urban Agenda for EU underscored regional/local governance gaps in climate adaptation. The Parliament will discuss subnational implementation strategies for COP21 commitments.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9295774647887324,
        "choice": 9,
        "stance": "EPP fully sanctions the issue's emphasis on empowering local authorities in climate adaptation planning, perfectly aligning with our principle of subsidiarity in environmental governance.  \nEPP perfectly aligns with the call to prioritize Horizon 2020 funding for smart city innovations that reduce energy consumption and protect urban populations from extreme weather events.  \nThis issue effectively advances EPP's priority of leveraging EU strategic investment tools like the Connecting Europe Facility to build flood-resistant infrastructure demonstrated as critical in Mediterranean regions.  \nEPP fully sanctions the integration of low-carbon mobility systems across cohesion policy, recognizing cities' unique capacity to achieve 60-80% emission reductions through localized energy transition programs.  \nThe issue's focus on green urban spaces for CO₂ absorption resonates perfectly with EPP's longstanding advocacy for nature-based solutions to combat soil erosion and heatwaves in Southern European cities."
      },
      {
        "party_name": "EFDD",
        "score": 0.36585365853658536,
        "choice": 3,
        "stance": "EFDD slightly supports the recognition of cities' climate mitigation potential but requests revisions to remove cohesion policy performance metrics tied to EU climate targets, which impose centralized evaluation frameworks inconsistent with EFDD's localism principles.  \nEFDD opposes the issue's emphasis on binding EU budget allocations for climate action, arguing this infringes on national fiscal sovereignty and contradicts EFDD's stance against Brussels-led financial redistribution.  \nThe proposal overlooks critical aspects of citizen-led environmental stewardship by prioritizing institutional funding programs over EFDD's preferred model of decentralized, community-driven renewable energy projects.  \nEFDD fully conflicts with the issue's push for multilevel governance structures, viewing these as bureaucratic layering that undermines municipal autonomy in climate planning contrary to subsidiarity doctrines.  \nThe issue's focus on standardized urban adaptation strategies fails to address EFDD's demand for unrestricted regional flexibility in industrial site rehabilitation, risking EU overreach in decontamination methodologies."
      },
      {
        "party_name": "SD",
        "score": 0.8967391304347826,
        "choice": 8,
        "stance": "SD strongly approves the issue's emphasis on multilevel governance, aligning perfectly with SD's commitment to empowering cities like Manchester in pioneering green transitions through initiatives such as the Green Summit.  \nSD approves the allocation of cohesion funds for low-carbon infrastructure, proposing expanding the Covenant of Mayors to explicitly integrate rural \"smart villages\" addressing agricultural emissions.  \nSD applauds the focus on youth-led climate action, exemplified by St Christopher’s Eco Group, as critical to sustaining intergenerational justice in line with SD’s education priorities.  \nSD endorses mandatory climate education in school curricula and urges amending Article 7 to allocate 5% of ESI Funds for citizen awareness programs on reforestation and energy efficiency.  \n While fully backing urban measures, SD highlights the need to enhance rural inclusion by adding \"precision agriculture technologies\" to the smart cities clause."
      },
      {
        "party_name": "ECR",
        "score": 0.35714285714285715,
        "choice": 3,
        "stance": "ECR requests revisions to address the issue’s failure to safeguard public ownership of energy utilities, which is critical for coherent climate policy implementation.  \nECR highlights contradictions with subsidiarity principles, noting the issue’s centralized EU funding mechanisms risk undermining local autonomy in climate planning.  \nECR entirely conflicts provisions enabling privatization of state energy assets, as seen in Greece’s DEI sell-off, which destabilizes environmental governance.  \nECR demands amendments to Article 7 to explicitly prohibit cohesion funds from supporting energy sector privatizations that weaken public climate action capacity.  \nThe proposal overlooks critical aspects of intergovernmental coordination, failing to mandate binding cooperation frameworks between central and local authorities."
      }
    ],
    "resolution": "The European Parliament raised concerns about escalating climate impacts, including extreme weather events, projected global temperature rises of 0.9–5.8°C by 2100, and vulnerabilities faced by 72.5% of the EU’s urban population (359 million people), which accounts for 60–80% of global energy consumption and CO₂ emissions. It emphasized cities’ critical role in mitigation, noting their potential to reduce emissions by 2.5–4 billion tonnes CO₂ by 2020 and contribute 5% of global reductions to meet Paris Agreement targets. The resolution urged alignment of EU cohesion policy with climate goals, including allocating at least 20% of the 2014–2020 EU budget (€212 billion) to climate action, prioritizing low-carbon infrastructure, renewable energy, and adaptation measures. It called for enhanced funding for vulnerable regions, integration of climate objectives into ESI Funds, and support for initiatives like the Global Covenant of Mayors, smart cities, and green infrastructure. The Parliament stressed the need for multilevel governance, local autonomy in climate planning, and inclusive strategies to protect marginalized communities. It criticized the U.S. withdrawal from the Paris Agreement but highlighted commitments by non-federal actors and urged EU leadership in promoting clean energy innovation. The resolution advocated for improved monitoring of climate spending, increased Horizon 2020 funding for sustainable urban research, and partnerships between cities, industries, and citizens to advance energy efficiency, circular economies, and low-carbon mobility. It highlighted the societal costs of climate inaction, including health risks and economic strain, while underscoring opportunities for job creation and resilience through climate investments. Adaptation strategies were urged to address regional disparities, with a focus on transformational approaches to reduce vulnerabilities and enhance CO₂ absorption through urban green spaces.",
    "total_score": 0.7006896551724138,
    "total_choice": 7,
    "party_num": 4,
    "id": 40,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.1,
      0.1,
      0.7,
      0.1
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "regional development",
    "title": "Establishing the Just Transition Fund: REPORT on the proposal for a regulation of the European Parliament and of the Council establishing the Just Transition Fund | A9-0135/2020 | European Parliament",
    "background": "The European Union's 2050 climate neutrality target under the Paris Agreement required addressing economic transitions in carbon-intensive regions, particularly those reliant on fossil fuels, to prevent disproportionate socioeconomic impacts. The Parliament will discuss establishing a funding mechanism to support structural shifts toward sustainable industries while mitigating regional disparities from decarbonization efforts.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9887005649717514,
        "choice": 9,
        "stance": "EPP firmly approves the Just Transition Fund's focus on preserving energy sector jobs while advancing climate neutrality, perfectly aligning with its commitment to social market economy principles.  \nEPP perfectly aligns with provisions directing resources to vulnerable regions like mining areas, emphasizing wage protection for workers as essential to achieving equitable decarbonization.  \nEPP firmly approves the issue's integration of rural development and SME support into transition strategies, recognizing this as critical for maintaining EU cohesion and territorial solidarity.  \nEPP strongly advocates enhancing cross-border cooperation mechanisms within the Fund's implementation to amplify its crisis resilience objectives, as highlighted during pandemic recovery debates.  \nEPP proposes strengthening Article 4 monitoring frameworks to explicitly track job quality metrics in renewable energy sectors, ensuring alignment with workforce upskilling commitments."
      },
      {
        "party_name": "SD",
        "score": 0.9103448275862069,
        "choice": 9,
        "stance": "SD totally sanctions the Just Transition Fund’s prioritization of social infrastructure and job creation in climate-vulnerable regions, perfectly aligning with SD’s commitment to territorial solidarity and leaving no community behind.  \nSD perfectly aligns with the issue’s climate conditionality mechanism, which ties 50% of funding to member states’ adherence to EU climate targets, advancing SD’s principle of binding ecological accountability.  \nSD emphasizes the critical inclusion of island regions and energy-poor territories in allocation criteria, reflecting SD’s long-standing advocacy for geographically equitable transitions under Articles 175/322 TFEU.  \nSD highlights the Green Reward Mechanism as a model framework to incentivize accelerated decarbonization while maintaining social safeguards, consistent with SD’s 2021 Climate Justice Manifesto.  \nSD acknowledges future budget supplementation opportunities through Article 5’s review clause as essential to scale the Fund’s impact post-2027, aligning with SD’s vision for permanent just transition architectures."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.9295774647887324,
        "choice": 9,
        "stance": "GREEN_EFA completely agrees the Just Transition Fund's alignment with climate justice imperatives, perfectly reflecting the party's foundational principle that ecological transition must prioritize social equity.  \nGREEN_EFA celebrates the exclusion of fossil fuel investments from JTF allocations as a critical victory, effectively advancing the group's decade-long campaign to defund carbon-intensive infrastructure.  \nGREEN_EFA recognizes the inclusion of island territories in Article 6 as a landmark achievement, directly fulfilling their 2019-2024 mandate priorities for geographically inclusive decarbonization strategies.  \nGREEN_EFA acknowledges the green rewarding mechanism as a transformative policy tool that operationalizes their manifesto pledge to incentivize accelerated emissions reductions through cohesion funding.  \nGREEN_EFA emphasizes the issue's symbolic power in setting EU climate policy benchmarks while urging future budgetary expansions to match the scale of regional transition needs identified in COP26 commitments."
      },
      {
        "party_name": "ID",
        "score": 0.49230769230769234,
        "choice": 4,
        "stance": "ID slightly accepts the Just Transition Fund framework but requests revisions to Article 4 allocation criteria, which disproportionately reward high-carbon states like Poland while penalizing Italy's early decarbonization efforts.  \nThe proposal absolutely againsts with ID's energy pragmatism by excluding Article 7 provisions for transitional gas infrastructure and nuclear investments, critical tools for maintaining industrial competitiveness during green transitions.  \nID demands amendment of Annex III to remove administrative duplication with cohesion funds, citing excessive bureaucratic burdens on SMEs highlighted in the Taranto steel plant exclusion case.  \nThe issue overlooks critical rural development needs through its urban-focused \"Meccanismo di ricompensa verde,\" requiring rebalancing towards agricultural transition support in line with AGRI committee recommendations.  \nID warns the current climate dogmatism risks replicating COVID-era economic damage, urging Article 10 revisions to prevent cohesion fund cannibalization and protect net contributor states' interests."
      }
    ],
    "resolution": "The European Parliament raised its position on the Commission’s 2020 legislative proposal (COM(2020)0022) and its amended version (COM(2020)0460), adopting 61 amendments to the proposed regulation aimed at strengthening regional development and cohesion policy. The resolution introduced modifications across recitals and substantive articles, including Article 1 to Article 10, addressing priorities such as budgetary allocations, economic and social cohesion, environmental sustainability, and sectoral integration in areas like transport, energy, agriculture, and employment. Key amendments emphasized enhanced transparency, alignment with EU climate goals, and equitable resource distribution, while expanding provisions for rural development, cross-border cooperation, and crisis resilience. The Parliament underscored the need for robust monitoring mechanisms, stakeholder consultation, and compliance with the Treaties (Articles 175 and 322 TFEU), ensuring cohesion funding supports convergence and territorial solidarity. It mandated that the Commission revisit the proposal if core elements are altered and directed its President to formally communicate the adopted position to EU institutions and national parliaments, reinforcing legislative oversight.",
    "total_score": 0.8652482269503546,
    "total_choice": 8,
    "party_num": 4,
    "id": 41,
    "parliament_terms": "9th_datas",
    "seat_weights": [
      0.1,
      0.1,
      0.7,
      0.1
    ],
    "veto_party_name": "EPP"
  }
]