[
  {
    "topic": "development",
    "title": "Budget support to developing countries: REPORT The future of EU budget support to developing countries",
    "background": "The EU’s use of budget support to developing countries, established under the Lisbon Treaty (2009) and linked to UN Millennium Declaration goals, has faced scrutiny over governance standards, corruption risks, and aid effectiveness. The Parliament will discuss optimizing this instrument’s role in poverty reduction while addressing accountability challenges.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.8969465648854962,
        "choice": 8,
        "stance": "EPP strongly sanctions the conditional budget support framework emphasizing governance and anti-corruption measures, aligning perfectly with their commitment to transparent, accountable aid delivery.  \nEPP approves the integration of civil society and parliamentary oversight in development strategies, ensuring local ownership and reinforcing democratic processes as prioritized in the issue.  \nEPP endorses results-based incentives and predictable disbursements, recognizing their critical role in advancing poverty reduction and sustainable growth in line with EU development goals.  \nEPP proposes enhancing real-time monitoring mechanisms within risk management frameworks to preempt irregularities, thereby strengthening safeguards for EU taxpayer funds without opposing the issue’s core principles.  \nEPP emphasizes the necessity of independent evaluation systems and tailored indicators, fully supporting the issue’s rejection of a one-size-fits-all approach to maximize context-specific aid effectiveness."
      },
      {
        "party_name": "EFD",
        "score": 0.6129032258064516,
        "choice": 6,
        "stance": "EFD supports the issue’s conditional approach to budget support, particularly its focus on governance accountability and anti-corruption safeguards as prerequisites for aid effectiveness.  \nEFD advises strengthening pre-assessment mechanisms to rigorously evaluate recipient countries’ financial management systems before disbursing funds, ensuring alignment with their emphasis on responsible stewardship.  \nEFD endorses the emphasis on civil society involvement in monitoring processes, urging explicit inclusion of local watchdog organizations to enhance transparency.  \nEFD concurs with the rejection of a “one-size-fits-all” framework, advocating for deeper contextual analysis of domestic tax policies to avoid undermining fiscal autonomy.  \nEFD highlights the need for accelerated implementation of risk management tools to address fraud concerns, proposing quarterly audits as a supplementary safeguard."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.9272727272727272,
        "choice": 9,
        "stance": "GREEN_EFA entirely approves the issue’s emphasis on civil society and parliamentary oversight in budget support, perfectly aligning with their commitment to participatory governance and accountability.  \nGREEN_EFA perfectly aligns with the call for long-term engagement in sectors like education and health, recognizing this as essential to sustainable development as outlined in their 2023 climate-justice manifesto.  \nGREEN_EFA entirely approves the rejection of a \"one-size-fits-all\" approach, emphasizing their principle of context-specific solutions that respect recipient countries’ ownership.  \nGREEN_EFA applauds the issue’s multidimensional poverty reduction focus, which mirrors their advocacy for integrating gender, environmental, and social justice into all development frameworks.  \nGREEN_EFA entirely approves the insistence on anti-corruption safeguards, reflecting their longstanding demand for transparency in EU aid to protect public funds and legitimacy."
      },
      {
        "party_name": "ALDE",
        "score": 0.9047619047619048,
        "choice": 9,
        "stance": "ALDE completely accepts the issue’s transparency mandates, proposing monthly publicized online updates on aid outcomes to operationalize Article 12’s public register clause and empower citizen oversight.  \nALDE perfectly aligns with governance conditionality requirements, advocating intensified parliamentary scrutiny of fund flows to preempt arms trade risks while upholding anti-corruption frameworks in Section 4(b).  \nALDE unequivocally supports civil society inclusion in monitoring mechanisms, urging granular fraud audits to concretize Resolution Paragraph 9’s accountability provisions.  \nALDE champions the issue’s rejection of uniform approaches, emphasizing context-specific disbursement criteria to align with ALDE’s localization principles in MDG advancement.  \nALDE affirms the 0.7% GDP target as non-negotiable, demanding accelerated compliance timelines to realize poverty reduction imperatives under the Lisbon Treaty."
      },
      {
        "party_name": "SD",
        "score": 0.8709677419354839,
        "choice": 8,
        "stance": "SD strongly approves the issue’s prioritization of poverty reduction through sectoral budget support, aligning perfectly with S&D’s commitment to advancing health and education access as foundational development pillars.  \n\nSD approves the integration of gender perspectives into budget support conditionality, effectively advancing the issue’s multidimensional approach to addressing systemic inequalities.  \n\nSD highlights the necessity of involving national parliaments and local authorities in budget support oversight, reinforcing the issue’s emphasis on ownership and participatory governance frameworks.  \n\nSD proposes enhancing dynamic admissibility criteria to ensure poverty reduction indicators evolve with contextual needs, a minor refinement to strengthen the issue’s results-based methodology.  \n\nSD applauds the focus on strengthening public financial management systems through budget support, which aligns with S&D’s longstanding advocacy for institutional capacity-building to combat corruption."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.5294117647058824,
        "choice": 5,
        "stance": "GUE_NGL supports the emphasis on poverty reduction as a primary objective but advises incorporating explicit critiques of structural adjustment programs imposed by international financial institutions to address systemic inequalities.  \n\nGUE_NGL endorses conditional governance requirements while suggesting enhanced debt relief mechanisms be integrated into budget support frameworks to rectify historical injustices in North-South relations.  \n\nGUE_NGL expresses concern over the issue’s insufficient attention to dismantling trade dependencies, urging policy coherence that prioritizes sovereign economic strategies over extractive partnerships.  \n\nGUE_NGL advises strengthening civil society oversight provisions by mandating recipient-state parliamentary approval for all EU-funded governance indicators to ensure genuine local ownership.  \n\nGUE_NGL acknowledges progress in anti-corruption safeguards but cautions that aid predictability must not circumvent domestic resource mobilization through binding commitments to progressive taxation reforms."
      }
    ],
    "resolution": "The European Parliament raised the importance of enhancing the effectiveness of budget support as a tool for delivering development aid, emphasizing poverty reduction as the EU’s primary objective under the Lisbon Treaty, with a multidimensional approach addressing economic, social, gender, environmental, and governance challenges. It stressed that budget support must be conditional on transparent governance, anti-corruption measures, and accountability mechanisms, including civil society and parliamentary involvement in designing, monitoring, and evaluating development strategies to ensure ownership by recipient countries. The resolution highlighted the need for results-based incentives, predictable disbursements, and adherence to human rights and governance standards, while cautioning that budget support should not undermine domestic resource mobilization, such as taxation, to reduce aid dependency. It called for EU-level independent evaluation systems, a public register for transparency in agreements and indicators, and policy coherence across EU trade, climate, agriculture, and security policies to align with development goals. The Parliament urged compliance with the 0.7% GDP target for development aid, criticized insufficient data in the Commission’s consultation process, and advocated for improved coordination among EU institutions and member states to avoid overlaps and strengthen impact. It also emphasized the role of sectoral budget support in advancing Millennium Development Goals, the need for risk management frameworks, and the importance of addressing fraud and corruption to safeguard aid legitimacy, while rejecting a \"one-size-fits-all\" approach in favor of tailored indicators and local context considerations.",
    "total_score": 0.8342391304347826,
    "total_choice": 8,
    "party_num": 6,
    "id": 0,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.1,
      0.4,
      0.1,
      0.1,
      0.1,
      0.2
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "development",
    "title": "Establishing a financing instrument for development cooperation: REPORT on the proposal for a regulation of the European Parliament and of the Council establishing a financing instrument for development cooperation",
    "background": "The EU's existing external financing instruments required reform to address evolving global challenges, enhance strategic partnerships, and ensure coherence in development cooperation. Geopolitical shifts, differentiated approaches to partner countries, and alignment with EU priorities necessitated updated mechanisms. The Parliament will discuss establishing a new financing framework for development cooperation and external action for 2014-2020.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9448529411764706,
        "choice": 9,
        "stance": "EPP totally sanctions the enhanced flexibility and crisis response capabilities of the stability instrument, perfectly aligning with EPP's commitment to coherent EU external action.  \nEPP perfectly aligns with the issue's prioritization of child mortality reduction through development cooperation, affirming its manifesto focus on tangible humanitarian outcomes.  \nEPP totally sanctions the dedicated funding for election observation missions and civil society support, which advances EPP's democratic governance priorities as outlined in Article 209(1).  \nEPP perfectly aligns with the issue's strategic focus on Latin American partnerships, recognizing this as critical to institutional cooperation under the Treaty framework.  \nEPP totally sanctions the integration of cybersecurity provisions for cross-border threats, reflecting EPP's longstanding emphasis on security-development synergies in external instruments."
      },
      {
        "party_name": "EFD",
        "score": 0.41935483870967744,
        "choice": 4,
        "stance": "EFD conditionally promotes the financing instrument's framework but requests revisions to Article 294 provisions enabling parallel EU/national implementation structures, which contradict subsidiarity principles.  \nEFD completely disapproves the issue's expansion of EU diplomatic networks, demanding amendment of Clause 7(b) to cap embassy expenditures at 50% of equivalent national mission costs.  \nThe proposal overlooks critical cost-control mechanisms, requiring insertion of salary alignment rules ensuring no EU official receives remuneration exceeding heads of government in member states.  \nEFD rejects the budgetary assumptions underlying Annex II, citing incompatibility with their manifesto commitment to reduce EU operational spending by 30% before 2025.  \nThis instrument's lack of binding efficiency audits conflicts with EFD's core principle that all development funds must undergo quarterly national parliamentary scrutiny."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.9137931034482759,
        "choice": 9,
        "stance": "GREEN_EFA totally agrees the issue’s integration of democracy, rule of law, and human rights as central pillars of development cooperation, perfectly aligning with their foundational commitment to transformative governance reforms.  \nGREEN_EFA applauds the inclusion of precise indicators and the \"more for more\" principle, which effectively advance accountability and incentivize democratic progress in partner countries.  \nGREEN_EFA highlights the issue’s recognition of civil society’s indispensable role in policy design and evaluation, reflecting their longstanding advocacy for participatory development frameworks.  \nGREEN_EFA underscores the necessity of future budgetary expansions to address funding gaps, framing this as a critical enhancement opportunity to maximize the instrument’s impact on poverty eradication.  \nGREEN_EFA perfectly aligns with the issue’s emphasis on parliamentary oversight and institutional coherence, reinforcing their mandate to uphold transparency and Treaty obligations."
      },
      {
        "party_name": "ALDE",
        "score": 0.8674698795180723,
        "choice": 8,
        "stance": "ALDE strongly sanctions the enhanced visibility and citizen-focused implementation of EU development aid, aligning with the issue's emphasis on making assistance tangible for beneficiaries in accession countries.  \nALDE proposes strengthening monitoring mechanisms to ensure funding flexibility directly benefits civil society and human rights defenders, enhancing the issue's accountability framework.  \nALDE applauds the partnership instrument’s role in advancing Europe 2020 Strategy goals globally, effectively matching ALDE’s priorities for market access and EU visibility.  \nALDE endorses the issue’s focus on policy coherence while recommending explicit emphasis on complementarity with national development programs to maximize collective impact.  \nALDE approves the prioritization of judiciary reforms (Chapters 23-24) as critical to democratic governance, reflecting ALDE’s longstanding commitment to rule-of-law conditionality."
      },
      {
        "party_name": "SD",
        "score": 0.9230769230769231,
        "choice": 9,
        "stance": "SD completely supports the issue's emphasis on parliamentary oversight and transparency in development financing, perfectly aligning with S&D's commitment to democratic accountability in EU external action.  \nSD perfectly aligns with the issue's integration of human rights conditionality, particularly welcoming the new protection mechanisms for defenders as articulated in the debate's focus on risk-taking humanitarian interventions.  \nSD fully supports the reinforced gender equality provisions and poverty eradication targeting, mirroring the debate's insistence on directing aid to \"the most needy\" through social service benchmarks.  \nSD endorses the issue's budgetary coherence mechanisms as effectively advancing S&D's vision of crisis-responsive development cooperation under constrained financial conditions.  \nSD perfectly aligns with the issue's rejection of geopolitical confrontation strategies, upholding the debate's call for partnership-based approaches to neighborhood policy and Black Sea cooperation."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.42857142857142855,
        "choice": 4,
        "stance": "GUE_NGL partly accepts the issue’s framework but demands binding amendments to Articles 3-5 to replace non-binding \"strategic dialogue\" pledges with enforceable parliamentary oversight mechanisms.  \nGUE_NGL completely disputes the subordination of development cooperation to EU security interests, urging deletion of clauses allowing EAD-led interventions prioritizing geostrategic objectives over social justice.  \nGUE_NGL rejects the issue’s implicit endorsement of economic deregulation conditionality, proposing revised wording in Annex II to prohibit imposing privatization mandates on partner states.  \nGUE_NGL highlights contradictions in territorial application, insisting the text explicitly exclude funding for projects in occupied Palestinian territories until occupation ends, per international law.  \nGUE_NGL requests revisions to Annex I to mandate annual public audits of Stability Instrument expenditures, addressing transparency gaps that perpetuate militarized interventions."
      }
    ],
    "resolution": "The European Parliament raised its adoption of a position at first reading on the Commission’s 2011 proposal (COM(2011)0840), endorsing Parliament’s own statement and a joint statement with the Council and Commission to ensure alignment on implementation. It acknowledged annexed Commission statements while emphasizing the need for transparency, urging the Commission to resubmit the proposal if substantial amendments or replacements arise, thereby safeguarding parliamentary oversight. The resolution stressed forwarding the adopted position to the Council, Commission, and national parliaments, reinforcing institutional cooperation and adherence to procedural obligations under the Treaty on the Functioning of the European Union, particularly Articles 209(1) and 294. It highlighted commitments to development policy coherence, gender equality, and budgetary accountability, reflecting inputs from relevant parliamentary committees, though specific numerical targets or funding allocations were not detailed in the resolution text.",
    "total_score": 0.8363874345549738,
    "total_choice": 8,
    "party_num": 6,
    "id": 1,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.4,
      0.2,
      0.1,
      0.1,
      0.1,
      0.1
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "development",
    "title": "Motions for resolutions - Prospects for the Doha Development Agenda following the Seventh WTO Ministerial Conference: JOINT MOTION FOR A RESOLUTION on the prospects for the Doha Development Agenda (DDA) following the Seventh WTO Ministerial Conference",
    "background": "The Doha Development Agenda, launched in 2001 to address trade imbalances and integrate developing countries, faced prolonged negotiations stalled since 2008 amid global economic crisis impacts on trade. The Seventh WTO Ministerial Conference (2009) reviewed progress without formal DDA negotiations. The Parliament will discuss the DDA's prospects and the EU's role in advancing multilateral trade governance.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.816793893129771,
        "choice": 8,
        "stance": "EPP strongly agrees the issue’s emphasis on concluding the Doha Round with an ambitious, balanced outcome, aligning with their commitment to equitable globalization and crisis resilience through WTO-led multilateralism.  \nEPP fully accepts strict adherence to EU agricultural mandates, including robust geographical indications protection, as vital for safeguarding European interests while advancing fair global trade rules.  \nEPP applauds the focus on integrating developing countries into the global trading system, particularly through duty-free, quota-free access for LDCs, mirroring their longstanding advocacy for development-centered trade policies.  \nEPP proposes enhancing climate integration in WTO reforms by linking trade concessions to verifiable CO₂ reduction commitments, ensuring environmental sustainability complements market access goals.   \nEPP strongly agrees institutional cooperation between the WTO and UN bodies like the ILO, emphasizing this synergy as critical to advancing decent labor standards alongside trade liberalization."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.0,
        "choice": 0,
        "stance": "GREEN_EFA rejects the issue's insistence on concluding the Doha Round, firmly disputeing with their position that \"the WTO needs to work on a reform\" rather than perpetuating a \"dead\" negotiation framework.  \nGREEN_EFA opposes the issue's endorsement of liberalization policies, which they argue are \"partly responsible for the economic and financial crisis\" and contradict their demand for prioritizing food sovereignty over market access.  \nThe proposal overlooks critical aspects such as the \"negative net effect for most developing countries,\" directly opposing GREEN_EFA's assessment that the Doha agenda \"destabilises markets\" instead of delivering equitable benefits.  \nGREEN_EFA condemns the issue's failure to abandon agricultural liberalization mandates, which they deem incompatible with their call to halt \"industrialised states' rationalisation pressures\" harming small-scale producers.  \nThis firmly disputes with GREEN_EFA's insistence on terminating \"twenty year liberalisation policy\" paradigms, demanding instead binding climate and labor rules rather than \"wait[ing] until the crisis is over.\""
      },
      {
        "party_name": "ALDE",
        "score": 0.8571428571428571,
        "choice": 8,
        "stance": "ALDE strongly upholds the urgent conclusion of the Doha Round as critical to global economic recovery, aligning with ALDE's leadership in advancing multilateral trade frameworks that integrate developing nations through equitable market access.  \nALDE approves the issue's emphasis on EU bridging roles between major economies and developing countries, effectively advancing ALDE's priority of fostering consensus-driven solutions in WTO negotiations.  \nALDE endorses strict abolition of agricultural export subsidies and enhanced Aid for Trade mechanisms, which align perfectly with ALDE's commitments to dismantling trade distortions affecting LDC competitiveness.  \nALDE proposes strengthening parliamentary oversight provisions by amending the interinstitutional agreement to mandate real-time negotiation updates, ensuring full transparency under Lisbon Treaty principles without delaying ratification processes.  \nALDE applauds the issue's rejection of bilateral agreement fragmentation, strongly upholding its call to maintain Doha's centrality in addressing climate and labor standards through institutional WTO reforms."
      },
      {
        "party_name": "SD",
        "score": 0.0913978494623656,
        "choice": 0,
        "stance": "SD entirely conflicts the issue's market access priorities as contradicting S&D's demand for development-centered trade reform.  \nSD rejects the services liberalization framework for failing to exempt public services from WTO rules as critical for social rights.  \nThe proposal conflicts with SD's agricultural sovereignty principles by inadequately protecting developing countries' special products and safeguard mechanisms.  \nSD condemns the issue's approach to NAMA tariff cuts as disregarding developing nations' right to policy space for industrial development.  \nThe text overlooks SD's core demand to prioritize subsistence agriculture over export-oriented trade rules worsening food insecurity."
      },
      {
        "party_name": "ECR",
        "score": 0.8333333333333334,
        "choice": 8,
        "stance": "ECR strongly accepts the issue's emphasis on avoiding protectionism and integrating least developed countries into global trade, aligning perfectly with their commitment to market-driven economic growth and multilateral cooperation.  \nECR approves the balanced approach to concluding the Doha Round, particularly the call for EU leadership in mediating full participation of developing nations while maintaining special treatment provisions.  \nECR endorses the issue's recognition of bilateral and regional trade agreements as complementary tools, reinforcing their longstanding advocacy for pragmatic trade expansion beyond multilateral frameworks.  \nECR proposes enhancing transparency in implementing agricultural mandates to ensure CAP reforms do not inadvertently restrict market access opportunities for non-EU partners.  \nECR applauds the focus on WTO institutional reforms addressing climate change and food security, which aligns with their agenda of modernizing trade governance while preserving national regulatory autonomy."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.0,
        "choice": 0,
        "stance": "GUE/NGL rejects the issue's endorsement of concluding the Doha Round as it perpetuates a failed neoliberal framework that exacerbates global inequality and environmental destruction.  \nGUE/NGL opposes fundamentally the promotion of services liberalization, which undermines sovereign control over public goods like healthcare and education as highlighted in Ilda Figueiredo's critique.  \nThis proposal conflicts irreconcilably with GUE/NGL's demand for regulated trade systems prioritizing food sovereignty over corporate interests, as articulated in Jacky Hénin's condemnation of WTO-led crises.  \nThe issue's anti-protectionist stance directly contradicts GUE/NGL's call for socially just trade barriers to prevent wage suppression and ecological dumping.  \nGUE/NGL condemns the issue's omission of concrete measures against tax havens and financial speculation, which Figueiredo identified as root causes of systemic poverty."
      }
    ],
    "resolution": "The European Parliament raised its commitment to the WTO-led multilateral trading system as essential for equitable globalization and crisis resilience, emphasizing the Doha Development Agenda’s (DDA) role in integrating developing countries, particularly LDCs, through fair trade rules and special treatment. It urged concluding the Doha Round with a balanced, ambitious outcome to spur global economic recovery, stressing the need for developed and emerging economies to offer 100% duty-free, quota-free access for LDCs (mirroring the EU’s Everything but Arms initiative) and enhance Aid for Trade. The resolution called for strict adherence to EU agricultural mandates, including CAP reforms and geographical indications protection, while advocating substantial non-agricultural market access (NAMA) cuts with differential treatment for developing nations and services liberalization that respects public policy goals. It highlighted WTO institutional reforms to address climate change, food security, and labor standards, alongside strengthened cooperation with UN bodies like FAO and ILO. The Parliament demanded greater democratic scrutiny of EU trade policy under the Lisbon Treaty, including parliamentary involvement in negotiations and updates to interinstitutional agreements to ensure transparency. It also endorsed bilateral/regional trade agreements as complementary to multilateral frameworks and stressed the WTO’s role in curbing protectionism during economic crises.",
    "total_score": 0.5027173913043478,
    "total_choice": 5,
    "party_num": 6,
    "id": 2,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.1,
      0.1,
      0.1,
      0.1,
      0.4,
      0.2
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "development",
    "title": "Progress towards the achievement of the Millennium Development Goals: mid-term review in preparation of the UN high-level meeting in September 2010: REPORT on progress towards the achievement of the Millennium Development Goals: mid-term review in preparation of the UN high-level meeting in September 2010",
    "background": "In 2000, UN member states adopted the Millennium Development Goals targeting poverty reduction and sustainable development by 2015. By 2010, mid-term assessments highlighted uneven progress amid global economic instability and climate challenges. The Parliament will discuss progress toward achieving the Millennium Development Goals ahead of the 2010 UN high-level review.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.13740458015267176,
        "choice": 1,
        "stance": "EPP firmly conflicts the issue's promotion of abortion access in paragraph 42, conflicting with their core principles of protecting human dignity and life from conception.  \nEPP rejects the proposed Tobin tax in paragraph 8 as economically unworkable and inconsistent with effective development financing mechanisms.  \nEPP opposes debt cancellation demands in paragraph 13, arguing this undermines partner countries' accountability for sustainable development processes.  \nEPP disputes the call to eliminate agricultural export subsidies in paragraph 22, citing existential risks to European farmers during economic instability.  \nEPP challenges the 0.7% GNI aid target framework as insufficiently focused on corruption prevention and private-sector growth strategies."
      },
      {
        "party_name": "EFD",
        "score": 0.03225806451612903,
        "choice": 0,
        "stance": "EFD rejects the issue's call for increased financial commitments as fundamentally incompatible with their stance against EU-driven austerity and economic overreach.  \nEFD opposes the 0.7% GNI target for development aid, asserting it disregards the fiscal realities of indebted EU member states and their need for stringent spending cuts.  \nThe proposal's emphasis on EU policy coherence conflicts with EFD's demand to dismantle EU trade barriers and regulations that \"strangl[e] businesses\" across Europe.  \nEFD condemns the issue's failure to address core structural issues like abolishing the euro and enabling national currencies, which they deem essential for economic recovery.  \nThis initiative overlooks EFD's paramount objective of British EU withdrawal, which they argue would liberate resources for direct bilateral trade with developing nations."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.9090909090909091,
        "choice": 9,
        "stance": "GREEN_EFA completely upholds the issue’s urgent reaffirmation of MDG commitments, perfectly aligning with their foundational principle that poverty eradication requires systemic economic justice beyond aid quotas.  \nGREEN_EFA perfectly aligns with the issue’s emphasis on policy coherence, proposing strengthened integration of fair trade mechanisms to address root causes of poverty through equitable market access for African producers.  \nGREEN_EFA highlights the issue’s alignment with their demand to combat corporate tax evasion as critical to achieving MDG 8, urging enhanced transparency in EU financial policies affecting developing nations.  \nGREEN_EFA underscores the necessity of conditioning CAP and fisheries reforms on sustainability criteria to end EU practices undermining agricultural and marine resources in the Global South.  \nGREEN_EFA applauds the call for gender-responsive development frameworks, emphasizing that maternal health targets cannot be met without explicit guarantees of reproductive rights and women’s autonomy."
      },
      {
        "party_name": "SD",
        "score": 0.8978494623655914,
        "choice": 8,
        "stance": "SD strongly agrees the issue's emphasis on targeting aid to vulnerable groups, aligning perfectly with SD's longstanding commitment to prioritizing women, children, and people with disabilities in development frameworks.  \nSD approves the call for binding mechanisms to achieve the 0.7% GNI target, proposing enhanced accountability measures for underperforming states like Italy and Germany to ensure moral obligations are met.  \nSD emphasizes the urgent need to address climate change as an enhancement opportunity, advocating for dedicated funding streams to help developing nations adapt without diverting existing MDG resources.  \nSD endorses the report's balanced market mechanisms and legislative tools, urging accelerated implementation of financial transaction taxes to generate predictable development financing amid crisis-driven shortfalls.  \nSD highlights the necessity to treat aid effectiveness as a core EU external policy priority, recommending stricter monitoring of fund allocation to prevent regression in hunger and poverty indicators post-crisis."
      },
      {
        "party_name": "ECR",
        "score": 0.14814814814814814,
        "choice": 1,
        "stance": "ECR rejects the issue's poverty eradication framework for neglecting property rights formalization as a catalyst for economic empowerment.  \nThis fully condemns with ECR's position that market-driven stakeholdership trumps aid dependency in development strategies.  \nThe proposal overlooks critical aspects such as legal recognition of informal businesses, which ECR deems essential to unlock nine trillion dollars in dormant capital.  \nECR opposes the singular focus on aid quantity targets as inconsistent with their advocacy for systemic reforms enabling asset ownership in informal economies.  \nThe issue's maternal health and education priorities are deemed insufficient without parallel mechanisms to capitalize slum properties and micro-enterprises."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.7647058823529411,
        "choice": 7,
        "stance": "GUE_NGL strongly sanctions the issue's urgent call for EU member states to meet the 0.7% GNI development aid target by 2015, aligning perfectly with the party's longstanding commitment to eradicate extreme poverty and address the EUR 20 billion funding deficit highlighted in the report.  \nGUE_NGL strongly sanctions integrating MDG achievement as a non-negotiable requirement in all EU external agreements, effectively advancing the principle that no treaties should be ratified unless they demonstrably prioritize poverty reduction and social development.  \nGUE_NGL proposes redirecting funds within Economic Partnership Agreements from trade-related allocations to directly finance primary education and maternal health programs, ensuring these partnerships fully support rather than undermine Millennium Development Goals.  \nGUE_NGL strongly sanctions maintaining the issue's stringent demands against postponement of MDG targets, particularly emphasizing accelerated action in sub-Saharan Africa where poverty rates have risen despite global crises.  \nGUE_NGL approves the emphasis on policy coherence across EU development frameworks, urging strict accountability mechanisms to prevent diluted commitments under austerity pretexts."
      }
    ],
    "resolution": "The European Parliament raised the urgent need to uphold the commitments made under the 2000 Millennium Development Goals (MDGs), emphasizing the moral imperative to eradicate extreme poverty, achieve universal primary education, promote gender equality, reduce child and maternal mortality, combat HIV/AIDS and other diseases, ensure environmental sustainability, and foster global partnerships for development. It called for increased financial resources, policy coherence, and accountability mechanisms, urging EU member states to meet their target of allocating 0.7% of gross national income to official development assistance by 2015, while addressing inequalities, enhancing aid effectiveness, and integrating the MDGs into broader EU external action and development cooperation frameworks.",
    "total_score": 0.4796195652173913,
    "total_choice": 4,
    "party_num": 6,
    "id": 3,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.1,
      0.4,
      0.2,
      0.1,
      0.1,
      0.1
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "development",
    "title": "Cohesion Policy and Research and Innovation Strategies for smart specialisation (RIS3): REPORT on Cohesion Policy and Research and Innovation Strategies for Smart Specialisation (RIS3)",
    "background": "The EU’s cohesion policy frameworks, aligned with Europe 2020 goals, mandated member states to develop 2014-2020 Research and Innovation Strategies for Smart Specialisation (RIS3) to optimize regional competitiveness through targeted investments, requiring alignment with structural funds and addressing disparities in innovation capacity. The Parliament will discuss RIS3 implementation within cohesion policy to enhance innovation-driven regional development.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9068627450980392,
        "choice": 9,
        "stance": "EPP completely approves the issue's emphasis on territorial cooperation as the quintessence of EU values, aligning perfectly with EPP's longstanding commitment to fostering cross-border trust, institutional partnerships, and transboundary infrastructure to address peripheral disparities.  \nEPP perfectly aligns with the prioritization of SMEs and start-ups, recognizing their role as the backbone of innovation and job creation, and applauds the call to double Horizon 2020 support for regional entrepreneurial ecosystems in line with EPP's 2023 economic resilience agenda.  \nEPP completely approves the Alpine macro-regional strategy's balanced approach to sustainable tourism, transport connectivity, and economic vitality, which advances EPP's priority of harmonizing environmental stewardship with generational livelihood security in geographically sensitive areas.  \nEPP unequivocally supports maintaining cohesion policy post-2020 funding levels and synergies between ESI Funds, Horizon 2020, and EFSI, reflecting EPP's manifesto pledge to eliminate innovation gaps through granular, asset-based regional development.  \nEPP proposes strengthening multi-stakeholder governance frameworks to enhance administrative capacities and quadruple-helix collaboration, ensuring RIS3 strategies avoid bureaucratic fragmentation while preserving focus on sectoral innovation and SME competitiveness."
      },
      {
        "party_name": "EFDD",
        "score": 0.3684210526315789,
        "choice": 3,
        "stance": "EFDD rejects the cohesion policy’s reliance on centralized funding redistribution, entirely condemning with EFDD’s position that market-driven competition—not taxpayer-funded subsidies—should drive SME growth.  \nThe proposal overlooks critical aspects such as deregulation, opposing EFDD’s demand to eliminate bureaucratic burdens on SMEs instead of redistributing EU funds.  \nEFDD opposes RIS3’s top-down governance as inconsistent with EFDD’s principles, arguing it perpetuates cronyism rather than fostering genuine competition.  \nThe issue fails to address EFDD’s call to abolish cohesion policy entirely, prioritizing market freedom over state-managed innovation strategies.  \nEFDD condemns the misuse of ESI Funds for interregional cooperation, viewing it as wasteful centralization incompatible with subsidiarity and fiscal responsibility."
      },
      {
        "party_name": "ENF",
        "score": 0.3103448275862069,
        "choice": 3,
        "stance": "ENF rejects the allocation of ESI Funds to regions with systemic corruption, citing Moldova as evidence that current safeguards fail to protect taxpayer interests.  \nENF opposes EU macro-regional strategies like the Alpine Convention integration, arguing they undermine national sovereignty and local governance frameworks protected by the 1991 treaty.  \nENF partially approves RIS3's regional empowerment goals but demands constitutional guarantees against centralizing reforms like Italy's, which contradict subsidiarity principles.  \nENF criticizes the issue's biodiversity approach as neglecting alpine cultural landscapes, insisting agricultural producers—not EU directives—should lead ecosystem management.  \nENF fundamentally disputes innovation funding mechanisms that prioritize bureaucratic compliance over SME needs for tax stability, reduced regulations, and anti-dumping protections."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.8222222222222222,
        "choice": 8,
        "stance": "GREEN_EFA strongly accepts the issue's emphasis on multi-stakeholder governance and SME prioritization, which aligns with their commitment to decentralized, participatory decision-making.  \nGREEN_EFA proposes enhancing infrastructure investment criteria to prioritize upgrades of underutilized existing assets over new megaprojects, citing cost-efficiency and sustainability benefits demonstrated in Alpine transport cases.  \nGREEN_EFA applauds the focus on regional granularity and energy transition alignment as effectively advancing their vision of place-based ecological modernization embedded in local productive ecosystems.  \nGREEN_EFA urges stricter interregional cooperation requirements to prevent innovation disparities, advocating binding thresholds for knowledge-sharing between advanced and lagging regions in ESI Fund allocations.  \nGREEN_EFA emphasizes the need to maintain grant-based support mechanisms in RIS3 implementation to avoid marginalizing social innovation initiatives that prioritize community impact over financial returns."
      },
      {
        "party_name": "ALDE",
        "score": 0.8833333333333333,
        "choice": 8,
        "stance": "ALDE strongly accepts the issue’s prioritization of SMEs as central to EU growth, aligning perfectly with ALDE’s longstanding commitment to fostering entrepreneurship and simplifying Structural Fund procedures to bridge operational gaps between regional administrations and business needs.  \nALDE approves the emphasis on region-specific innovation strategies rooted in local assets, strongly advocating against replication of external models and urging granular, entrepreneurial discovery processes to maximize competitiveness.  \nALDE highlights the need to enhance financial support for regional partners implementing RIS3, proposing stricter allocation oversight to ensure ESI Funds directly empower local stakeholders in cross-sectoral innovation.  \nALDE applauds the issue’s alignment with multi-stakeholder governance and quadruple-helix collaboration, noting the Basque Country’s success as a model for integrating regional strengths into EU-wide competitiveness.  \nALDE emphasizes the critical role of interregional cooperation and synergies between ESI Funds and Horizon 2020, urging accelerated scaling of pilot projects like Eastern Macedonia and Thrace to reduce innovation disparities."
      },
      {
        "party_name": "SD",
        "score": 0.8448275862068966,
        "choice": 8,
        "stance": "SD strongly endorses the issue's emphasis on SME prioritization and cross-sectoral innovation, aligning perfectly with SD's commitment to equitable regional development through entrepreneurial empowerment.  \nSD approves the call for enhanced ESI Fund-Horizon 2020 synergies, proposing simplified joint application procedures to reduce administrative burdens for SMEs as a technical refinement.  \nSD highlights the need to operationalize the issue's governance principles by expanding the S3 platform’s mentorship programs for lagging regions, particularly in rural digital infrastructure.  \nSD emphasizes that the quadruple-helix collaboration model effectively advances SD’s vision of participatory policymaking, though suggests explicit inclusion of youth entrepreneurship networks in RIS3 monitoring frameworks.  \nSD welcomes the focus on low-tech/social innovation as critical to territorial cohesion, urging accelerated ITI implementation to address payment delays criticized by SME stakeholders."
      }
    ],
    "resolution": "The European Parliament raised the importance of Research and Innovation Strategies for Smart Specialisation (RIS3) as central tools for achieving Europe 2020 goals, emphasizing their role in fostering economic, social, and territorial cohesion through knowledge-based growth, job creation, and innovation. It highlighted the need for RIS3 to be rooted in regional strengths, entrepreneurial discovery processes, and multi-stakeholder governance to avoid generic priorities and ensure alignment with local assets, while addressing innovation gaps between and within regions. The resolution stressed the underutilized potential of interregional cooperation, noting that 15% of EU Structural and Investment Funds (ESI Funds) could be allocated for such collaboration, and called for enhanced synergies between ESI Funds, Horizon 2020, and the European Fund for Strategic Investments (EFSI) to maximize impact. It urged regions to prioritize support for SMEs, start-ups, and cross-sectoral innovation, including social and low-tech innovation, while improving monitoring mechanisms and data collection to track progress. The Parliament criticized insufficient administrative capacities and top-down approaches in some Member States, advocating for stronger regional involvement and adherence to partnership principles. It welcomed pilot projects like the one in Eastern Macedonia and Thrace, scaled to eight Member States until 2017, and called for a 2017 review of RIS3 to refine strategies, boost granularity, and align future cohesion policies. The resolution also emphasized the role of smart cities, energy transitions, and quadruple-helix collaboration (public, private, academic, civil society) in driving innovation, while urging the Commission to strengthen the S3 platform’s support for lagging regions and disseminate lessons learned to improve post-2020 strategies.",
    "total_score": 0.7718023255813954,
    "total_choice": 7,
    "party_num": 6,
    "id": 4,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.1,
      0.1,
      0.1,
      0.1,
      0.1,
      0.5
    ],
    "veto_party_name": "ALDE"
  },
  {
    "topic": "development",
    "title": "EU Trust Fund for Africa: the implications for development and humanitarian aid: REPORT on the EU Trust Fund for Africa: the implications for development and humanitarian aid",
    "background": "The EU established the Trust Fund for Africa in 2015 to address migration root causes in fragile regions, pooling EU and member state resources alongside existing development instruments. The Parliament will discuss the fund’s alignment with development goals and humanitarian principles, focusing on resource allocation and institutional coordination.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9411764705882353,
        "choice": 9,
        "stance": "EPP entirely supports the issue's emphasis on linking EUTF implementation to long-term development objectives, perfectly aligning with EPP's commitment to sustainable governance and poverty reduction in partner countries.  \nEPP perfectly aligns with the demand for increased member state contributions to the EUTF, reinforcing EPP's principle of shared responsibility in addressing migration root causes through robust ODA-compliant investments.  \nEPP entirely supports the call to integrate crisis response mechanisms into the MFF while preserving budget unity, mirroring EPP's 2023 agenda for flexible yet accountable EU financial architectures.  \nEPP proposes strengthening parliamentary oversight provisions to enhance transparency in fund allocation, ensuring democratic scrutiny aligns with EPP's governance priorities without opposing the issue's core framework.  \nEPP entirely supports the issue’s conflict-sensitive approach, which directly advances EPP’s human rights agenda by conditioning aid on beneficiary governments’ adherence to rule-of-law principles."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.9555555555555556,
        "choice": 9,
        "stance": "GREEN_EFA absolutely approves the issue’s unequivocal rejection of diverting development funds toward migration control, which perfectly aligns with their mandate to prioritize poverty reduction, education, and gender equality over securitized agendas.  \nGREEN_EFA applauds the demand for strict adherence to ODA criteria, as this safeguards development assistance from being weaponized against displaced populations—a core tenet of their human rights framework.  \nGREEN_EFA celebrates the emphasis on conflict-sensitive approaches and civil society inclusion, recognizing these as essential to addressing root causes of instability in line with their advocacy for participatory, locally led solutions.  \nGREEN_EFA strongly agrees the issue’s condemnation of cooperation with human rights-violating governments, mirroring their uncompromising stance on ethical governance and accountability in EU external action.  \nGREEN_EFA affirms the call to integrate SDGs into all EUTF projects, particularly health and youth empowerment, which aligns perfectly with their 2030 Agenda implementation strategy for equitable, sustainable development."
      },
      {
        "party_name": "ALDE",
        "score": 0.9333333333333333,
        "choice": 9,
        "stance": "ALDE entirely endorses the issue's insistence on maintaining ODA criteria to prioritize poverty reduction and gender equality, aligning perfectly with ALDE's commitment to rights-based development frameworks.  \nALDE perfectly aligns with the demand for civil society inclusion in EUTF project cycles, recognizing this as essential to uphold democratic accountability in EU external action.  \nALDE proposes strengthening parliamentary oversight mechanisms to enhance transparency, ensuring the European Parliament's budgetary authority directly informs EUTF strategic decisions.  \nALDE emphatically supports the issue's condemnation of diverting funds from established instruments like the EDF, affirming that sustainable development requires predictable financing beyond emergency mechanisms.  \nALDE highlights the imperative to integrate youth empowerment programs across all EUTF initiatives, directly advancing SDG targets on education and inclusive growth as central to migration root-cause strategies."
      },
      {
        "party_name": "SD",
        "score": 0.9482758620689655,
        "choice": 9,
        "stance": "SD entirely sanctions the issue’s insistence on prioritizing poverty reduction and human rights over migration control, perfectly aligning with SD’s commitment to ethical development aid rooted in solidarity.  \nSD perfectly aligns with the demand for democratic oversight of the EUTF, emphasizing Parliament’s role in scrutinizing projects to prevent harmful border securitization and uphold asylum rights.  \nSD entirely sanctions the condemnation of diverting funds from long-term development instruments, reinforcing SD’s principle that crisis mechanisms must not undermine sustainable growth or SDG alignment.  \nSD strongly promotes the issue’s rejection of cooperation with repressive regimes, reflecting SD’s unwavering stance that aid must never empower authoritarian governments violating human rights.  \nSD perfectly aligns with calls to integrate the EDF into the EU budget, viewing this as essential to ensure predictable funding and end reliance on voluntary member state contributions."
      },
      {
        "party_name": "ECR",
        "score": 0.058823529411764705,
        "choice": 0,
        "stance": "ECR rejects the issue's prohibition on migration control linkages, insisting development aid must secure border management commitments from recipient nations.  \nECR opposes mandating LGBTI and reproductive rights provisions as cultural imperialism that undermines African societal values and effective partnership.  \nECR completely rejects with the issue’s dismissal of migration deterrence incentives, arguing taxpayers rightfully demand tangible returns on assistance spending.  \nECR condemns the prioritization of gender equality frameworks over locally led growth models, claiming this exacerbates donor-recipient power imbalances.  \nECR highlights that the issue’s human rights conditionality ignores corruption risks, advocating instead for direct infrastructure investments without political strings."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.0,
        "choice": 0,
        "stance": "GUE/NGL totally conflicts the EUTF's redirection of development funds into border militarization, directly contradicting their anti-neocolonial principles of self-determined African development.  \nGUE/NGL rejects the instrumentalization of aid to empower authoritarian regimes like Sudan's, violating core human rights commitments in the issue's own safeguards.  \nGUE/NGL condemns the fund's structural incoherence in prioritizing EU migration containment over SDG-aligned investments in health and education as explicitly warned in Article 7.  \nGUE/NGL denounces the issue's failure to address root causes created by EU extractivist trade policies and military interventions that drive forced migration.  \nGUE/NGL demands complete defunding of migration control components to restore ODA purity, requiring deletion of all clauses permitting cooperation with border forces."
      }
    ],
    "resolution": "The European Parliament raised concerns about the EU Trust Fund for Africa (EUTF), established in 2015 with a €1.8 billion EU contribution to address root causes of migration and instability in 23 African countries, emphasizing development, resilience, and migration management. It criticized inadequate Member State contributions (€81.71 million by April 2016, just 4.5% of the EU’s pledge) and warned against diverting funds from existing instruments like the European Development Fund (EDF), Development Cooperation Instrument (DCI), and European Neighbourhood Instrument (ENI), risking long-term development goals. The resolution stressed that EUTF funds must adhere to Official Development Assistance (ODA) criteria, focusing on poverty reduction, human rights, gender equality, and conflict-sensitive approaches, while condemning misuse for migration control. It called for transparency, accountability, and civil society involvement in project design, implementation, and evaluation, and highlighted risks of diverting aid from least developed countries (LDCs). Parliament urged revising the 2014-2020 Multiannual Financial Framework (MFF) to integrate crisis mechanisms, restore budget unity, and ensure democratic oversight, demanding regular reporting and alignment with Sustainable Development Goals (SDGs), particularly on peace, education, health, and gender equality. Concerns included coherence with EU external policies, migration cooperation under the Valletta Summit, and safeguarding humanitarian principles, while opposing cooperation with governments violating human rights. The resolution emphasized the need for holistic solutions balancing security, development, and migration challenges, ensuring funds prioritize local needs, youth empowerment, and sustainable growth.",
    "total_score": 0.6962209302325582,
    "total_choice": 6,
    "party_num": 6,
    "id": 5,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.2,
      0.1,
      0.1,
      0.1,
      0.2,
      0.3
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "development",
    "title": "Addressing shrinking civil society space in developing countries: REPORT on addressing shrinking civil society space in developing countries",
    "background": "Growing legal restrictions, funding limitations, and attacks on activists in developing countries, alongside the EU's commitments to human rights and sustainable development, have highlighted threats to civil society's operational autonomy. The Parliament will discuss the EU's role in addressing shrinking civic space and supporting civil society organizations' capacity to operate freely in development contexts.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.7914691943127962,
        "choice": 7,
        "stance": "EPP strongly accepts integrating civil society space protection into EU foreign policy priorities, aligning perfectly with EPP’s commitment to advancing democracy and human rights through development partnerships.  \nEPP approves the issue’s emphasis on EU funding instruments like the EIDHR, which effectively advances EPP’s priority of empowering grassroots organizations to drive sustainable development.  \nEPP highlights the critical need for structured tripartite dialogues between governments, CSOs, and the private sector, as proposed in the issue, to address systemic repression collaboratively.  \nEPP proposes enhancing the \"Shrinking Space Monitoring and Early Warning\" mechanism by explicitly including accessibility criteria for marginalized groups in funding guidelines.  \nEPP applauds the focus on binding corporate human rights due diligence, which aligns with EPP’s 2023 manifesto commitments to ethical global trade practices."
      },
      {
        "party_name": "EFDD",
        "score": 0.4,
        "choice": 4,
        "stance": "EFDD partly sanctions the issue's goals but requests revisions to Article 12's supranational coordination mechanisms, which risk undermining organic civil society growth through excessive harmonization.  \nEFDD proposes amending \"tripartite dialogues\" provisions to prioritize direct funding channels for grassroots NGOs over government-mediated frameworks.  \nEFDD opposes the issue's implicit endorsement of top-down EU Delegation oversight as inconsistent with subsidiarity principles central to EFDD's anti-centralization platform.  \nEFDD demands stricter limitations on binding corporate due diligence clauses (Section 9) to prevent regulatory overreach that could deter private sector partnerships with local CSOs."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.8723404255319149,
        "choice": 8,
        "stance": "GREEN_EFA strongly promotes the issue’s call to systematically address repression against civil society through political dialogue, aligning perfectly with their commitment to global human rights and participatory democracy.  \nGREEN_EFA applauds the proposed monitoring mechanism and annual high-risk country lists as critical tools to advance their priority of protecting civic freedoms in conflict zones and authoritarian contexts.  \nGREEN_EFA proposes explicitly naming partnerships with governments like Egypt and Ethiopia in trade agreement clauses to prevent human rights compromises, enhancing the issue’s accountability framework.  \nGREEN_EFA strongly endorses the focus on safeguarding marginalized groups and HRDs, reflecting their decades-long advocacy for intersectional protections in development policies.  \nGREEN_EFA approves integrating binding corporate due diligence into EU strategies, ensuring coherence with their demands for ethical global supply chains and environmental justice."
      },
      {
        "party_name": "SD",
        "score": 0.9395604395604396,
        "choice": 9,
        "stance": "SD entirely advocates the issue’s recognition of civil society as a democratic cornerstone, perfectly aligning with SD’s commitment to societal empowerment through integrated education and capacity-building initiatives.  \nSD perfectly aligns with the demand for expanded EU funding via instruments like EIDHR, effectively advancing SD’s priority of protecting human rights defenders in conflict zones as outlined in the 2030 Agenda.  \nSD entirely advocates the call to simplify CSO funding access through EU Delegations, mirroring SD’s longstanding advocacy for removing bureaucratic barriers to civic participation and grassroots development.  \nSD perfectly aligns with the establishment of early warning systems and binding corporate due diligence, which directly advance SD’s manifesto pledge for accountable, transparent governance structures globally.  \nSD entirely advocates the issue’s emphasis on tripartite dialogues and gender-sensitive approaches, underscoring SD’s dedication to inclusive policy coherence across all development frameworks."
      },
      {
        "party_name": "ECR",
        "score": 0.25,
        "choice": 2,
        "stance": "ECR firmly challenges the issue's blanket funding increases through instruments like EIDHR, citing systemic mismanagement evidenced by \"party-like\" misuse of EU development funds by certain NGOs.  \nThe proposal conflicts with ECR's principle of fiscal accountability by failing to mandate real-time audits of CSO expenditures in refugee programs as highlighted in the debate.  \nECR rejects binding corporate human rights due diligence clauses, arguing they disproportionately burden EU businesses operating in developing nations without addressing corrupt local governance.  \nThe issue overlooks critical oversight mechanisms for church and trade union-led initiatives, which ECR considers vital partners in sustainable development per Cotonou Agreement priorities.  \nECR demands deletion of tripartite dialogue provisions, asserting they legitimize authoritarian regimes' repression tactics rather than addressing root causes through direct civil society empowerment."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.20408163265306123,
        "choice": 2,
        "stance": "GUE_NGL rejects the issue’s emphasis on religion or faith-based movements, absolutely challengeing with their commitment to secular and independent civil societies.  \nGUE_NGL opposes the proposal for failing to prioritize binding legal obligations on corporations as a non-negotiable condition for human rights accountability.  \nThe proposal overlooks critical aspects such as policy coherence by permitting corporate impunity, contradicting GUE_NGL’s demands for stringent human rights due diligence frameworks.  \nGUE_NGL condemns the issue’s implicit legitimization of faith-based actors in civic spaces, which undermines pluralism and secular governance principles."
      }
    ],
    "resolution": "The European Parliament raised deep concerns over the global trend of shrinking civil society space, marked by restrictive laws, stigmatization, harassment, and violence against civil society organizations (CSOs) and human rights defenders (HRDs), particularly in developing countries and conflict zones. It emphasized the vital role of independent, diverse civil society in promoting democracy, human rights, sustainable development, and accountability, aligning with the 2030 Agenda and SDGs 16 and 17. The resolution called for enhanced EU support through increased funding, including the European Instrument for Democracy and Human Rights (EIDHR) and the 2014-2020 DCI Multiannual Indicative Programme, to strengthen CSOs’ capacity, ensure safe environments, and address gender-based repression. It urged the EU to lead by example, uphold fundamental freedoms internally, and integrate human rights into trade agreements, development policies, and security strategies, while opposing counter-terrorism measures that unduly restrict civic space. The Parliament advocated for a coordinated EU response, including a \"Shrinking Space Monitoring and Early Warning\" mechanism, annual lists of high-risk countries, and systematic engagement with multilateral bodies to hold governments accountable. It highlighted the need to protect marginalized groups, women, youth, and HRDs, and demanded binding corporate human rights due diligence. Additionally, the resolution stressed the importance of EU Delegations in supporting local CSOs, simplifying funding access, and promoting tripartite dialogues between governments, civil society, and the EU to address root causes of repression and ensure policy coherence.",
    "total_score": 0.6829608938547486,
    "total_choice": 6,
    "party_num": 6,
    "id": 6,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.1,
      0.1,
      0.4,
      0.2,
      0.1,
      0.1
    ],
    "veto_party_name": "EFDD"
  },
  {
    "topic": "development",
    "title": "2015 Report on policy coherence for development: REPORT on the EU 2015 Report on Policy Coherence for Development",
    "background": "The EU's legal obligation under Article 208 TFEU to align policies with development goals, combined with the 2030 Agenda's universal SDGs and persistent global poverty, highlighted systemic challenges in coordinating trade, migration, climate, and fiscal policies affecting developing countries. The Parliament will discuss policy coherence for development implementation and institutional mechanisms.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9154228855721394,
        "choice": 9,
        "stance": "EPP absolutely promotes the issue’s integration of Policy Coherence for Development (PCD) across all EU policies, perfectly aligning with their commitment to systemic SDG implementation through trade liberalization, climate finance, and governance reforms.  \nEPP strongly approves the emphasis on combating illicit financial flows and tax evasion, proposing enhanced collaboration with third countries under frameworks like the Bangladesh Sustainability Compact to strengthen corporate accountability.  \nEPP applauds the prioritization of free trade as a driver of sustainable growth, reinforcing their manifesto pledge to leverage Aid for Trade mechanisms while ensuring development objectives are not undermined by migration control measures.  \nEPP perfectly aligns with the call for institutional reforms, including independent complaint mechanisms for affected communities and ex-post evaluations, urging accelerated parliamentary oversight to ensure vertical coherence between EU and national policies.  \nEPP endorses the issue’s climate action imperatives, particularly the alignment with the Paris Agreement, and advocates for stricter monitoring of biofuel policies to prevent member state deviations from sustainability goals."
      },
      {
        "party_name": "ENF",
        "score": 0.0,
        "choice": 0,
        "stance": "ENF rejects the issue's reliance on existing financial mechanisms, fully doubting with ENF's demand for a \"New Deal\" using central bank capital to create wealth in Europe and Africa instead of austerity-driven policies.  \nENF opposes diverting development aid for migration control, as the issue fails to prioritize debt relief and wealth creation strategies needed to address root causes of displacement, a core ENF principle.  \nThe proposal overlooks critical aspects such as systemic EU fraud and mismanagement, exemplified by Olaf's findings, which ENF argues invalidates trust in current ODA allocation frameworks.  \nENF fully doubts with the issue's trade alignment approach, insisting market-driven SDG integration perpetuates short-termism instead of long-term human capital investments as outlined in their Africa-Europe wealth creation plan.  \nThe issue's climate finance demands ignore ENF's call to redirect central bank resources from debt purchases to infrastructure, rejecting incremental reforms in favor of radical wealth redistribution."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.9545454545454546,
        "choice": 9,
        "stance": "GREEN_EFA fundamentally supports the issue's systemic integration of SDGs across EU policies, perfectly aligning with our commitment to transformative governance frameworks that address poverty, climate justice, and equitable resource distribution.  \nGREEN_EFA perfectly aligns with the issue’s prohibition against diverting ODA for migration control and insists this principle must categorically exclude military expenditures, demanding strict adherence to human rights conditionality in all security-sector partnerships.  \nGREEN_EFA applauds the emphasis on binding corporate accountability and tax justice, which directly advances our decades-long advocacy for dismantling extractive financial architectures harming Global South development.  \nGREEN_EFA underscores the urgency of implementing the oral amendment to escalate Commissioner disagreements to the Commission President, ensuring policy coherence reflects our ecological and social imperatives without exception.  \nGREEN_EFA reaffirms that the issue’s climate finance targets and gender mainstreaming through the EU Gender Action Plan mirror our vision for intersectional, planet-centered development solidarity."
      },
      {
        "party_name": "ALDE",
        "score": 0.8135593220338984,
        "choice": 8,
        "stance": "ALDE strongly sanctions the issue’s institutional coordination mechanisms and proposes enhancing decision-making by empowering the Commission President to arbitrate interdepartmental disputes, ensuring alignment with ALDE’s longstanding commitment to hierarchical accountability in policy coherence.  \nALDE applauds the focus on addressing migration root causes and safe routes, which aligns perfectly with ALDE’s priorities on human rights and sustainable development, and emphasizes the need for synergies between EU policies, member states, and regional actors to maximize impact.  \nALDE highlights the critical role of local and regional administrations, such as the Basque Country’s coherence framework, and urges their formal inclusion in EU development dialogues to strengthen multi-level governance and practical implementation.  \nALDE endorses the issue’s emphasis on combating tax evasion and illicit financial flows, which effectively advances ALDE’s manifesto goals of equitable fiscal systems and corporate accountability through binding frameworks.  \nALDE reaffirms the necessity of innovative financing mechanisms like the financial transaction tax, aligning with ALDE’s advocacy for meeting the 0.7% ODA target and scaling climate finance to support developing nations."
      },
      {
        "party_name": "SD",
        "score": 0.9408284023668639,
        "choice": 9,
        "stance": "SD entirely accepts the issue's emphasis on combating tax evasion and illicit financial flows, which perfectly aligns with SD's commitment to closing global tax loopholes that drain developing nations' resources.  \nSD perfectly aligns with the issue's integration of SDGs across EU trade policies, particularly its demand for binding sustainability frameworks like the Bangladesh Compact to ensure corporate accountability.  \nSD entirely accepts prioritizing climate finance and Paris Agreement implementation, recognizing this as critical to addressing ocean acidification and food security threats outlined in the issue.  \nSD strongly affirms the issue's call for mandatory migration policy coherence, particularly its focus on addressing displacement root causes through development rather than diverted aid.  \nSD perfectly supports institutionalizing SDG impact assessments across EU decision-making, seeing this as essential to operationalize the Lisbon Treaty's policy coherence mandate."
      },
      {
        "party_name": "ECR",
        "score": 0.045454545454545456,
        "choice": 0,
        "stance": "ECR rejects the issue's migration approach as fundamentally disapproveing with their push model prioritizing aid in origin regions over EU-bound routes.  \nECR opposes diverting development funds to address root causes of displacement, advocating instead for strict migration control to preserve ODA budgets.  \nThe proposal's focus on systemic inequality contradicts ECR's stance against EU interference in national tax systems and corporate regulation.  \nECR disputes climate finance obligations, viewing Paris Agreement implementation as incompatible with economic sovereignty of member states.  \nThe issue's gender equality mandates are deemed incompatible with ECR's opposition to supranational social policy frameworks."
      }
    ],
    "resolution": "The European Parliament raised concerns about enhancing Policy Coherence for Development (PCD) to achieve the 2030 Sustainable Development Agenda, emphasizing its critical role in addressing poverty, inequality, and global challenges. It highlighted the EU’s responsibility to integrate PCD across all policies, particularly in migration, where development objectives must address root causes of displacement, ensure safe migration routes, and avoid diverting development aid (ODA) for migration control. The resolution stressed trade and finance reforms, noting the EU provided €11.7 billion in Aid for Trade (2013), urging alignment of trade agreements with SDGs, combating tax evasion, illicit financial flows, and promoting corporate accountability through binding frameworks like the Bangladesh Sustainability Compact. It called for innovative financing (e.g., financial transaction tax) and reaffirmed the 0.7% GNP ODA target. Climate action demands included implementing the Paris Agreement, limiting warming to below 2°C, and boosting climate finance for developing countries. Gender equality was prioritized via the EU Gender Action Plan 2016-2020, while security policies were linked to development through crisis prevention and governance reforms. The resolution advocated stronger institutional coordination, impact assessments, ex-post evaluations, and an independent complaint mechanism for communities affected by EU policies. It urged systemic integration of SDGs into EU decision-making, emphasizing domestic resource mobilization, fair tax systems, and support for developing countries’ capacity-building in health, agriculture, and sustainable infrastructure.",
    "total_score": 0.7193500738552437,
    "total_choice": 7,
    "party_num": 6,
    "id": 7,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.1,
      0.1,
      0.1,
      0.2,
      0.4,
      0.1
    ],
    "veto_party_name": "ALDE"
  },
  {
    "topic": "development",
    "title": "Enhancing the competitiveness of SMEs: REPORT on implementation of the thematic objective ‘enhancing the competitiveness of SMEs’ – Article 9(3) of the Common Provisions Regulation",
    "background": "SMEs constitute 99% of EU businesses, employing over 100 million people, yet face challenges from post-2008 economic instability, austerity measures, and barriers like complex regulations, limited access to finance, and uneven regional development under the 2014-2020 Cohesion Policy framework. The Parliament will discuss optimizing EU structural funds to strengthen SME competitiveness and address systemic constraints.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9166666666666666,
        "choice": 9,
        "stance": "EPP totally sanctions the issue's emphasis on doubling SME funding to €140 billion for 2014-2020, perfectly aligning with EPP's commitment to economic growth through robust financial instruments like the SME Initiative.  \nEPP perfectly aligns with the call to leverage ESI Funds for green growth and digitalization, reinforcing EPP's priority of integrating climate goals with SME competitiveness as outlined in COP21 commitments.  \nEPP totally sanctions the issue's demand for streamlined public procurement and reduced bureaucracy, which directly advances EPP's manifesto pledge to create a business-friendly regulatory environment.  \nEPP strongly accepts the focus on cross-border territorial cooperation through Interreg programmes, proposing enhanced budget flexibility to maximize job creation in peripheral regions.  \nEPP applauds the issue’s alignment with smart specialization strategies, echoing EPP’s advocacy for innovation-driven regional development and academia-industry partnerships."
      },
      {
        "party_name": "EFDD",
        "score": 0.42105263157894735,
        "choice": 4,
        "stance": "EFDD slightly agrees the issue’s emphasis on SME job creation but demands removal of cohesion policy funding mechanisms, which they argue forcibly redistribute wealth generated by SMEs through taxation.  \nEFDD requests revisions to abolish all bureaucratic procedures tied to SME support, stating current administrative frameworks perpetuate state control rather than enabling market autonomy.  \nThe proposal completely opposes with EFDD’s rejection of EU subsidy dependency, as allocating €140 billion perpetuates cronyism by prioritizing institutional intermediaries over direct market competition.  \nEFDD highlights the issue’s inconsistency with their anti-centralization principles, noting smart specialization strategies impose EU-directed economic planning incompatible with decentralized entrepreneurial ecosystems.  \nThis overlooks critical EFDD concerns about oligopolistic market distortions, which their members identify as the root cause of SME stagnation unaddressed by funding increases."
      },
      {
        "party_name": "ENF",
        "score": 0.27586206896551724,
        "choice": 2,
        "stance": "ENF completely disapproves the issue's funding mechanisms for failing to implement strict anti-corruption safeguards, as highlighted by recurring misuse of EU funds in high-risk states like Moldova.  \nENF rejects the issue's macro-regional integration strategies for undermining local governance principles, contradicting ENF's commitment to subsidiarity exemplified by Alpine Convention frameworks.  \nENF opposes centralized EU coordination of SME policies as incompatible with regional autonomy, citing Italy's constitutional reforms that erode local decision-making powers.  \nENF condemns the issue's environmental priorities for neglecting alpine cultural landscapes and fair pricing for local producers, prioritizing abstract biodiversity goals over tangible economic realities.  \nENF dismisses bureaucratic reduction claims as insufficient, arguing the issue perpetuates ideological taxation frameworks rather than delivering stable fiscal environments demanded by SMEs."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.9555555555555556,
        "choice": 9,
        "stance": "GREEN_EFA fundamentally approves the issue's emphasis on sustainable infrastructure investment, perfectly aligning with their commitment to blocking ecologically harmful megaprojects like Lyon-Turin while advancing cost-effective rail optimization.  \nGREEN_EFA perfectly aligns with the issue's smart specialization goals through their demand for regional empowerment in RIS3 strategies and explicit metropolitan leadership in energy transition policies.  \nGREEN_EFA fully supports the prioritization of small-scale SME projects as articulated in the issue, reinforcing their insistence on deep integration with local productive ecosystems rather than state-centric approaches.  \nGREEN_EFA applauds the issue's circular economy focus as complementary to their proposed amendments for strict evaluation mechanisms preventing financial instrument misuse in cohesion programming.  \nGREEN_EFA perfectly aligns with the issue's climate commitments by demanding infrastructure reuse protocols that prevent redundant spending, exemplified through their analysis of Perpignan-Figueras' underutilization."
      },
      {
        "party_name": "ALDE",
        "score": 0.9,
        "choice": 9,
        "stance": "ALDE completely promotes the issue’s emphasis on streamlining Structural Fund procedures to bridge cultural gaps with SME operational realities, perfectly aligning with ALDE’s advocacy for harmonizing EU cohesion frameworks with business agility.  \nALDE perfectly aligns with the call for region-specific smart specialization strategies, applauding the focus on leveraging local strengths over replicating external models to drive innovation-led growth as outlined in ALDE’s regional competitiveness agenda.  \nALDE completely promotes the prioritization of financial instruments like the SME Initiative, recognizing their critical role in addressing funding disparities and advancing ALDE’s long-standing commitment to diversifying SME financing avenues.  \nALDE perfectly aligns with the issue’s demand for macro-regional strategy revisions, echoing ALDE’s push for dynamic governance models that empower cross-border synergies and sustainable development.  \nALDE completely promotes integrating green and digital transitions through ESI Funds, underscoring its alignment with ALDE’s vision for a competitive, climate-neutral EU economy anchored in SME-led innovation."
      },
      {
        "party_name": "SD",
        "score": 0.9425287356321839,
        "choice": 9,
        "stance": "SD absolutely agrees the issue's emphasis on SME-driven job creation through Cohesion Policy, perfectly aligning with S&D's commitment to equitable regional development and rural entrepreneurship programs.  \nSD perfectly supports the call for streamlined EU fund coordination to address crises like wildfires, reinforcing S&D's demand for rapid structural fund deployment in climate-vulnerable regions.  \nSD strongly affirms the issue's focus on merging Horizon 2020 with structural funds, effectively advancing S&D's innovation agenda for SME-led technological modernization.  \nSD completely agrees with equalizing SME access to state aid and payment compliance, mirroring S&D's legislative push against corporate discrimination in financial regulations.  \nSD unreservedly backs anti-corruption monitoring mechanisms through enhanced transparency requirements, aligning with S&D's manifesto pledge for accountable EU fund governance."
      }
    ],
    "resolution": "The European Parliament raised the critical role of SMEs, which constitute 99% of EU businesses and provide over 100 million jobs, in driving economic growth, innovation, and social cohesion. It emphasized the need to enhance support through Cohesion Policy, noting that €70 billion allocated to SMEs in 2007-2013 created 263,000 jobs, with funding doubling to €140 billion for 2014-2020. The resolution highlighted challenges such as administrative burdens, delayed payments, and limited access to finance, particularly for microenterprises and start-ups, and called for simplified procedures, reduced bureaucracy, and improved use of financial instruments like the SME Initiative. It urged leveraging ESI Funds to promote green growth, circular economy practices, and digitalization, while ensuring compliance with the Late Payment Directive to stabilize SME cash flows. The Parliament stressed the importance of smart specialization strategies, gender-inclusive entrepreneurship, and internationalization, noting only 13% of SMEs operate globally. It advocated for better coordination between EU funds (e.g., Horizon 2020, COSME) and regional strategies, increased post-2020 funding, and streamlined public procurement to support SMEs. Additionally, it called for monitoring implementation delays, enhancing transparency, and addressing disparities in underdeveloped regions, while emphasizing compliance with COP21 goals and integrating refugees through SME initiatives.",
    "total_score": 0.8386627906976745,
    "total_choice": 8,
    "party_num": 6,
    "id": 8,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.4,
      0.2,
      0.1,
      0.1,
      0.1,
      0.1
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "development",
    "title": "Digitalisation for development: reducing poverty through technology: REPORT on digitalisation for development: reducing poverty through technology",
    "background": "The EU's development policy frameworks, including the 2030 Agenda and European Consensus on Development, prioritized technology's role in sustainable growth, while persistent global digital divides, infrastructure gaps, and e-waste challenges hindered progress in low-income regions. The Parliament will discuss integrating digital technologies into development strategies to address poverty reduction and inequality.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.8785046728971962,
        "choice": 8,
        "stance": "EPP strongly accepts the integration of digital technologies into EU development strategies, aligning perfectly with EPP’s commitment to leveraging innovation for inclusive growth and SDG achievement.  \nEPP applauds the issue’s emphasis on bridging digital divides through infrastructure investment, mirroring EPP’s priority of equitable access to connectivity in developing regions.  \nEPP proposes enhancing data protection frameworks in digital trade provisions to address risks of personal data misuse, ensuring alignment with EU privacy standards.  \nEPP approves the focus on digital literacy and cybersecurity capacity-building, which effectively advances EPP’s manifesto goals for ethical technological transformation.  \nEPP emphasizes the critical need for partnerships with regional bodies like the African Union to harmonize regulatory frameworks, reflecting EPP’s cross-border cooperation principles."
      },
      {
        "party_name": "ENF",
        "score": 0.14705882352941177,
        "choice": 1,
        "stance": "ENF rejects the issue's emphasis on centralized EU digital infrastructure funding as incompatible with national sovereignty principles  \nENF opposes fundamentally the multilateral partnership mandates that undermine developing nations' autonomous policy frameworks  \nThe proposal overlooks critical aspects of energy sovereignty by inadequately addressing coal-powered data center expansion in digital infrastructure plans  \nENF condemns the issue's soft approach to Big Tech monopolies as contradictory to anti-globalist economic values  \nThis fundamentally doubts with ENF's position on cultural preservation by prioritizing standardized digital education over local pedagogical traditions"
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.21153846153846154,
        "choice": 2,
        "stance": "GREEN_EFA rejects the issue’s techno-optimist framework as totally againsting with ecological justice principles, citing inadequate binding measures to curb e-waste proliferation and CO2 emissions from digital expansion.  \nGREEN_EFA opposes the promotion of digital infrastructure reliant on conflict minerals like coltan, which perpetuates resource extraction cycles inconsistent with degrowth agendas.  \nGREEN_EFA condemns the issue’s failure to prioritize community-led analog solutions over corporate-driven digital systems that risk entrenching Big Tech monopolies in developing economies.  \nGREEN_EFA highlights the proposal’s dangerous oversight of biometric surveillance risks in e-governance projects, directly contradicting data sovereignty protections in their manifesto.  \nGREEN_EFA disputes the assumption that connectivity equates to progress, arguing the issue overlooks grassroots resistance to digitalization’s cultural homogenization effects in Global South communities."
      },
      {
        "party_name": "ALDE",
        "score": 0.8823529411764706,
        "choice": 8,
        "stance": "ALDE strongly accepts the integration of digital technologies into EU development policy, as this aligns perfectly with ALDE's longstanding commitment to innovation-driven poverty reduction and SDG acceleration.  \nALDE approves the issue’s emphasis on bridging identity and connectivity gaps through D4D strategies, effectively advancing our priority of inclusive digital transformation in partner nations.  \nALDE endorses the call for ethical digital trade frameworks that balance market openness with robust data privacy protections, reflecting our principles of competitive yet responsible globalization.  \nALDE commends the focus on agro-ecological digital tools and e-governance anti-corruption measures, proposing to strengthen Clause 9 by specifying metrics for women’s economic inclusion in tech sectors.  \nALDE suggests enhancing circular economy provisions through explicit public-private partnerships for e-waste innovation, aligning with our market-based environmental stewardship approach."
      },
      {
        "party_name": "SD",
        "score": 0.8823529411764706,
        "choice": 8,
        "stance": "SD strongly upholds the issue’s emphasis on digital literacy and ICT integration in education systems, aligning perfectly with SD’s commitment to equitable access to opportunities for marginalized communities.  \nSD approves the prioritization of funding for digital infrastructure under the MFF, which directly addresses connectivity gaps and mirrors SD’s longstanding focus on reducing regional disparities.  \nSD applauds the inclusion of e-governance tools to combat corruption and improve public service delivery, effectively advancing SD’s principles of transparency and citizen empowerment.  \nSD proposes enhancing targeted outreach programs for youth digital skills training to ensure inclusivity across all social backgrounds, particularly in rural and underserved areas.  \nSD endorses the issue’s support for women-led MSMEs through digital tools, strongly aligning with SD’s gender equality agenda and economic inclusion priorities."
      },
      {
        "party_name": "ECR",
        "score": 0.8260869565217391,
        "choice": 8,
        "stance": "ECR strongly upholds the issue’s emphasis on equitable digital infrastructure development, aligning with their longstanding commitment to sovereignty-focused growth that prioritizes local ownership of resources.  \nECR approves the focus on policy coherence to prevent technological monopolies, ensuring digital trade frameworks empower developing nations rather than reinforcing dependency on external actors.  \nECR proposes explicitly mandating participatory frameworks in the D4D strategy to guarantee developing countries define their own digital priorities, addressing concerns about externally imposed \"development\" pathways.  \nECR applauds the integration of cybersecurity capacity-building as critical to protecting national autonomy, consistent with their manifesto principles of secure technological self-determination.  \nECR endorses the emphasis on digital literacy for MSMEs as a mechanism to counter wealth concentration, provided implementation prioritizes grassroots entrepreneurship over corporate-led models."
      }
    ],
    "resolution": "The European Parliament raised the imperative of integrating digital technologies into EU development policy to achieve the Sustainable Development Goals (SDGs), emphasizing their role in education, gender equality, infrastructure, and inclusive growth. It highlighted the Digital4Development (D4D) strategy’s alignment with the 2030 Agenda, stressing the need to address digital divides, including disparities in internet access—noting that 1.1 billion people lack official identity documentation (78% in sub-Saharan Africa and Asia) and over half the global population remains offline, jeopardizing SDG 9’s target of universal internet access in least developed countries (LDCs) by 2020. The resolution called for increased funding under the 2021-2027 Multiannual Financial Framework (MFF) to bolster digital infrastructure, e-governance, and cybersecurity in developing countries, while addressing environmental risks like electronic waste (e-waste) and the 2-5% global CO2 emissions from digital technologies. It urged policy coherence to ensure digital trade aligns with sustainable development, including consumer protection, data privacy, and competition policies to counter monopolies by major tech firms. The Parliament emphasized digital literacy and skills training, integration of ICTs into education systems, and support for micro, small, and medium enterprises (MSMEs), particularly women-led businesses, to enhance economic inclusion. It advocated for ethical humanitarian innovation, risk assessments in digital projects, and partnerships with regional bodies like the African Union to advance connectivity and regulatory frameworks. Environmental sustainability measures included promoting circular economy practices, reducing reliance on conflict minerals like coltan, and supporting agro-ecological farming through digital tools. The resolution also underscored digital technology’s potential in health services, disaster response, birth registration, and combating corruption via e-governance, while cautioning against risks to privacy, labor markets, and democratic processes.",
    "total_score": 0.6779891304347826,
    "total_choice": 6,
    "party_num": 6,
    "id": 9,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.5,
      0.1,
      0.1,
      0.1,
      0.1,
      0.1
    ],
    "veto_party_name": "ALDE"
  },
  {
    "topic": "development",
    "title": "European Regional Development Fund and Cohesion Fund: REPORT on the proposal for a regulation of the European Parliament and of the Council on the European Regional Development Fund and on the Cohesion Fund",
    "background": "The European Commission proposed regulations for the 2021-2027 European Regional Development Fund and Cohesion Fund, key instruments for reducing regional disparities and supporting sustainable development, amid evaluations highlighting their role in post-austerity economic growth. The Parliament will discuss the funds’ budget allocation, thematic priorities, and mechanisms to address regional inequalities.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.7361111111111112,
        "choice": 7,
        "stance": "EPP strongly advocates the integration of smart villages and rural mobility initiatives, aligning perfectly with EPP's commitment to territorial cohesion and demographic revitalization.  \nEPP approves the allocation of 2.4 billion euros for rural areas under the ERDF, effectively advancing EPP's priority to counter depopulation through green innovation and digital empowerment.  \nEPP endorses the strengthened provisions for outermost regions' access to cohesion funding, which matches EPP's 2023 manifesto commitments on equitable regional development.  \nEPP proposes enhancing fund management clarity to prevent dilution of ERDF and Cohesion Fund objectives while maintaining simplification goals.  \nEPP emphasizes addressing demographic decline via family policies and targeted investments in Article 10 bis, urging alignment with national demographic strategies."
      },
      {
        "party_name": "EFDD",
        "score": 0.35714285714285715,
        "choice": 3,
        "stance": "EFDD conditionally endorses the cohesion policy framework but demands urgent revisions to Article 12 provisions allowing fossil fuel investments through cohesion funding exceptions.  \nEFDD firmly againsts the failure to exclude member-state co-financing from Stability Pact deficit calculations, contravening fiscal autonomy principles for regional authorities.  \nEFDD rejects the issue’s inconsistency with climate neutrality goals, noting continued fossil fuel subsidies directly undermine youth-led climate strike demands referenced in Recital 9.  \nEFDD requests amending Annex III to prohibit all ERDF/Cohesion Fund allocations for fossil infrastructure, aligning with EFDD’s 2024 manifesto banning carbon-intensive mobility projects.  \nEFDD highlights unresolved contradictions between Paragraph 23’s “greener Europe” objectives and permitted gas pipeline financing under transitional energy clauses."
      },
      {
        "party_name": "ENF",
        "score": 0.0,
        "choice": 0,
        "stance": "ENF fundamentally rejects the issue’s funding mechanisms as perpetuating wealth transfers from EU taxpayers to Eastern European elites  \nENF rejects the cohesion policy framework for failing to address systemic misuse exemplified by 90 million euro “plastic castle” subsidies in Romania/Bulgaria  \nThis proposal conflicts with ENF’s principle of fiscal responsibility by enabling advisory firms to drain public funds through complex subsidy schemes  \nThe issue’s social inclusion goals are undermined by allowing super-rich beneficiaries to exploit regional development budgets without oversight  \nENF demands immediate cessation of cohesion funding until audit mechanisms prevent middle-class tax money subsidizing wasteful prestige projects"
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.8269230769230769,
        "choice": 8,
        "stance": "GREEN_EFA strongly accepts the integration of sustainable mobility objectives into cohesion policy, aligning perfectly with their longstanding commitment to climate-neutral infrastructure and Paris Agreement targets.  \nGREEN_EFA approves the prioritization of the Just Transition Fund within \"a greener Europe,\" effectively advancing their vision for equitable decarbonization across all regions.  \nGREEN_EFA endorses the emphasis on multimodal connectivity as a driver of territorial cohesion, recognizing its critical role in reducing development disparities through integrated transport networks.  \nGREEN_EFA applauds the focus on improving access to public transport under \"a more social Europe,\" directly supporting their mandate for inclusive mobility solutions in underserved communities.  \nGREEN_EFA proposes amending Article 7 to explicitly exclude fossil fuel infrastructure investments, ensuring cohesion funding strictly adheres to EU climate law and circular economy principles."
      },
      {
        "party_name": "SD",
        "score": 0.8655913978494624,
        "choice": 8,
        "stance": "SD strongly endorses the integration of smart mobility objectives under \"a smarter Europe,\" particularly aligning with Green Deal priorities through sustainable transport financing and district heating efficiency enhancements.  \nSD applauds the focus on ultra-peripheral regions' needs, emphasizing that maintaining ERDF support for critical infrastructure like airports and waste management systems is vital for territorial cohesion and climate resilience.  \nSD proposes reinforcing Article 174 implementation to ensure insular and demographic-disadvantaged regions receive tailored funding, addressing concerns about national-level thematic concentration distorting local priorities.  \nSD emphasizes that macroeconomic conditionality clauses must not undermine administrative capacity-building, urging simplified procedures to accelerate project implementation in structurally weaker regions like Sicily.  \nSD highlights the issue’s role in demonstrating EU solidarity through cohesion policy, particularly in Brexit-affected regions dependent on ERDF investments for job creation and infrastructure modernization."
      },
      {
        "party_name": "ECR",
        "score": 0.352112676056338,
        "choice": 3,
        "stance": "ECR partly sanctions the smart mobility objectives under \"a smarter Europe\" but requests revisions to Article 9(2) to specify national discretion in project selection, arguing the current text imposes EU-centric criteria inconsistent with subsidiarity principles.  \nECR opposes the issue's centralized sustainability benchmarks in Annex III, citing unresolved contradictions with their manifesto commitment to reducing administrative layers that hinder fund accessibility for smaller regions.  \nECR fully disputes with the Green Deal alignment mechanisms in Section 5.1, noting the failure to address Croatia-specific capacity gaps in implementing climate-neutral transport systems as raised in their 2023 cohesion policy review.  \nECR requests amendments to Chapter 7 to exempt transitional economies from rigid multimodal connectivity targets, emphasizing current provisions disproportionately burden administratively weaker member states.  \nECR highlights that the public transport access requirements under \"a more social Europe\" overlook critical rural-urban disparities, demanding territorial impact assessments be added to Article 12(4)."
      }
    ],
    "resolution": "The European Parliament raised amendments to integrate specific objectives into the EU’s cohesion policy framework, focusing on enhancing smart, sustainable, and socially inclusive mobility. The resolution introduced five targeted objectives: promoting smart mobility and transport service quality under \"a smarter Europe\"; advancing sustainable mobility and financing the Just Transition Fund under \"a greener Europe\"; strengthening mobility as a driver of territorial cohesion under \"a more connected Europe\"; and improving access to public transport services under \"a more social Europe.\" It emphasized aligning funding with EU priorities such as the Green Deal, digital transition, and territorial cohesion, while urging the Commission to reassess the proposal if substantial changes occur. The Parliament also stressed the need for coherence across transport, environmental, and social policies, ensuring investments address regional disparities and support climate neutrality, equitable access, and multimodal connectivity.",
    "total_score": 0.6347708894878706,
    "total_choice": 6,
    "party_num": 6,
    "id": 10,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.1,
      0.1,
      0.2,
      0.1,
      0.1,
      0.4
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "development",
    "title": "European Territorial Cooperation - best practices and innovative measures: REPORT on European Territorial Cooperation - best practices and innovative measures",
    "background": "The European Union established European Territorial Cooperation (ETC) under cohesion policy to address cross-border disparities, supported by regulations like the 2014-2020 Common Provisions Regulation and funding frameworks. Persistent challenges in border regions, migration pressures, and evolving EU strategic priorities (Europe 2020, macro-regional strategies) necessitated program evaluations. The Parliament will discuss ETC’s effectiveness, best practices, and strategies to strengthen cross-border collaboration within cohesion policy.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.8333333333333334,
        "choice": 8,
        "stance": "EPP strongly sanctions the call for increased post-2020 ETC funding, aligning perfectly with EPP's longstanding commitment to reducing territorial disparities through robust cross-border infrastructure and labor mobility programs.  \nEPP applauds the issue’s emphasis on macro-regional strategies like the Alpine and Danube initiatives, which effectively advance EPP's priority of balancing environmental preservation with economic competitiveness in geographically unique areas.  \nEPP proposes enhancing legal harmonization across borders to address persistent administrative barriers, suggesting streamlined national frameworks to complement existing EGTC mechanisms.  \nEPP strongly sanctions leveraging ETC-EFSI synergies to amplify smart growth investments, particularly in digital infrastructure and SME innovation clusters within peripheral regions.  \nEPP approves the focus on institutional capacity-building through Interreg, urging accelerated adoption of standardized cross-border data systems to improve project monitoring and citizen engagement."
      },
      {
        "party_name": "EFDD",
        "score": 0.05263157894736842,
        "choice": 0,
        "stance": "EFDD rejects the issue's call for increased ETC funding as entirely conflicting with their opposition to EU-led redistribution, which they deem \"cronyism at taxpayers’ expense.\"  \nEFDD opposes institutional capacity-building measures, arguing they perpetuate bureaucratic bloat rather than addressing market distortions caused by \"cartels and oligopoly.\"  \nThe proposal overlooks critical aspects such as deregulation, with EFDD insisting SME growth requires eliminating \"steuerlichen und bürokratischen Ballast\" instead of cross-border subsidies.  \nEFDD condemns harmonized data initiatives as state-controlled interference inconsistent with their free-market principle that \"dominance does not just mean monopoly\" but EU overreach.  \nThis issue inverts EFDD priorities by prioritizing \"legal and administrative barriers\" removal over wholesale rejection of cohesion policy, which they demand to \"stoppen sie jetzt.\""
      },
      {
        "party_name": "ENF",
        "score": 0.3103448275862069,
        "choice": 3,
        "stance": "ENF slightly approves the environmental focus but requests revision of biodiversity measures that prioritize predator reintroduction over alpine cultural practices (Art. 9).  \nENF entirely challenges continued ETC funding to high-corruption jurisdictions, demanding amendment of Clause 6 to include anti-fraud suspension mechanisms.  \nThe proposal overlooks critical SME needs for tax stability and reduced bureaucracy, requiring explicit provisions in Section 3.2 on inclusive growth.  \nENF rejects macro-regional strategies that undermine national sovereignty, insisting on Article 12 revisions to prioritize Alpine Convention frameworks over EU institutional overreach.  \nThis conflicts with ENF's localism principles by insufficiently protecting regional powers against centralizing reforms like Italy's constitutional changes (Resolution para. 22)."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.8222222222222222,
        "choice": 8,
        "stance": "GREEN_EFA strongly upholds the issue’s emphasis on environmental measures and cross-border cohesion, aligning perfectly with their commitment to sustainable territorial development and climate action.  \nGREEN_EFA applauds the prioritization of renewable energy integration and pollution reduction in Alpine regions but proposes stricter pre-evaluation criteria for infrastructure projects to mandate the full utilization of existing capacities before approving new ones.  \nGREEN_EFA endorses the call for harmonized cross-border data and EGTCs as pivotal tools to overcome administrative barriers, reflecting their advocacy for decentralized, citizen-driven governance.  \nGREEN_EFA urges enhanced synergies between ETC and EU circular economy strategies, ensuring small-scale regional projects and SMEs receive prioritized funding to deepen territorial equity.  \nGREEN_EFA emphasizes the need for transparent financial accountability in public infrastructure investments, aligning with their manifesto demand to prevent fiscal waste and prioritize modal shifts like rail over costly megaprojects."
      },
      {
        "party_name": "ALDE",
        "score": 0.8833333333333333,
        "choice": 8,
        "stance": "ALDE strongly endorses the issue’s emphasis on cross-border innovation and smart growth, which aligns perfectly with ALDE’s longstanding commitment to leveraging regional strengths through smart specialization strategies.  \nALDE approves the call for increased ETC funding post-2020, effectively advancing ALDE’s priority of empowering SMEs as key drivers of economic cohesion and job creation across border regions.  \nALDE proposes enhancing the allocation for innovation-driven projects within environmental measures to better reflect SMEs’ transformative potential, while maintaining strong support for the 41% climate allocation.  \nALDE strongly endorses the push for simplified procedures and harmonized data systems, recognizing their critical role in overcoming administrative barriers faced by businesses in cross-border cooperation.  \nALDE applauds the focus on macro-regional strategies as perfectly aligning with their advocacy for multi-stakeholder governance models, urging accelerated implementation of the Adriatic-Ionian and Alpine macro-regions."
      },
      {
        "party_name": "SD",
        "score": 0.8620689655172413,
        "choice": 8,
        "stance": "SD strongly agrees the issue’s prioritization of SME competitiveness and equitable regional development, aligning with their commitment to reducing territorial disparities through entrepreneurship training for women and youth in rural areas.  \nSD endorses enhanced cross-border environmental and innovation funding, proposing explicit Horizon 2020-ETC synergies in smart specialization strategies to address Vaughan’s call for simplified dual-fund utilization.  \nSD applauds the focus on crisis-response mechanisms for outermost regions, urging accelerated EU solidarity protocols for disasters like Madeira’s wildfires while maintaining Rodrigues’ emphasis on avoiding punitive fund suspensions.  \nSD emphasizes strict anti-corruption safeguards through mandatory participation in the European Public Prosecutor’s Office framework, addressing Molnár’s concerns about cohesion fund misuse in structurally disadvantaged regions.  \nSD advises revising the European Strategic Investment Fund’s allocation criteria to include geographic equity parameters, preventing regional divergence as highlighted by Grapini’s analysis of current investment imbalances."
      }
    ],
    "resolution": "The European Parliament raised concerns about the European Territorial Cooperation (ETC) budget of €10.1 billion (2.8% of cohesion policy funding for 2014-2020), deeming it insufficient to address cross-border challenges despite its high added value. It emphasized ETC’s role in reducing disparities, fostering economic, social, and territorial cohesion, and addressing migration crises through cross-border collaboration. Key allocations included 41% of ETC’s ERDF budget for environmental measures, 27% for smart growth (research, innovation), 13% for inclusive growth (employment, education), and €790 million for institutional capacity-building. The resolution highlighted ETC’s contributions to macro-regional strategies, labor mobility, and integration of disadvantaged regions (e.g., outermost, rural, mountainous areas). It called for post-2020 reforms, including a larger ETC budget, simplified procedures, harmonized cross-border data, synergies with EU funds (e.g., Horizon 2020, EFSI), and enhanced use of financial instruments and tools like European Groupings of Territorial Cooperation (EGTCs). The Parliament urged better evaluation of ETC’s qualitative impacts, improved visibility, and multi-stakeholder dialogue to strengthen cross-border innovation, governance, and citizen engagement, particularly in border regions facing legal and administrative barriers.",
    "total_score": 0.7122093023255814,
    "total_choice": 7,
    "party_num": 6,
    "id": 11,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.2,
      0.3,
      0.2,
      0.1,
      0.1,
      0.1
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "development",
    "title": "Financing for development: REPORT on Financing for Development",
    "background": "Persistent global poverty, unmet climate finance commitments, and gaps in achieving the UN's Sustainable Development Goals (SDGs) prompted international focus on development financing, following the Monterrey (2002) and Doha (2008) conferences. The Parliament will discuss strategies to mobilize resources for sustainable development ahead of the 2015 Addis Ababa Financing for Development Conference.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.8916256157635468,
        "choice": 8,
        "stance": "EPP strongly promotes the issue's reaffirmation of the 0.7% GNI ODA target and climate finance commitments, aligning perfectly with EPP's longstanding commitment to maintaining EU leadership in global development through predictable funding streams.  \nEPP approves the emphasis on private sector engagement and domestic resource mobilization, particularly through SME support and fair tax systems, which effectively advances EPP's priority of creating self-sustaining economic ecosystems in developing nations.  \nEPP proposes enhancing the issue’s sectoral focus by explicitly prioritizing education and microenterprise development as catalytic investments, reflecting members’ emphasis on human capital and entrepreneurship as foundational to poverty reduction.  \nEPP strongly endorses innovative financing mechanisms like micro-solidarity contributions from corporate advertising revenues, noting this complements the issue’s call for diversified funding while addressing urgent humanitarian needs.  \nEPP applauds the integration of granular data monitoring and anti-corruption measures, which mirror EPP’s 2023 manifesto demands for accountability in ensuring aid reaches marginalized groups, including persons with disabilities and women."
      },
      {
        "party_name": "EFDD",
        "score": 0.38461538461538464,
        "choice": 3,
        "stance": "EFDD fully rejects with the issue's mandatory 0.7% GNI aid target, citing Nathan Gill's condemnation of diverting funds from domestic priorities like healthcare and infrastructure during fiscal crises.  \nThe proposal overlooks EFDD's principle that trade liberalization—not aid—drives development, demanding amendments to eliminate EU fishing quotas and tariff barriers stifling African economies.  \nEFDD rejects taxation for ODA as morally untenable, aligning with Gill's argument that voluntary charity—not state-enforced redistribution—should fund development assistance.  \nThe issue's climate finance mechanisms are inconsistent with EFDD's fiscal conservatism, opposing debt-funded commitments that \"put grandchildren into debt\" without guaranteed results.  \nEFDD conditionally agrees debt relief frameworks but insists on strict anti-corruption clauses, reflecting Corrao's critique of resource exploitation by EU states in developing nations."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.9545454545454546,
        "choice": 9,
        "stance": "GREEN_EFA completely endorses the issue’s unwavering 0.7% GNI ODA commitment, perfectly aligning with their demand for binding financial obligations to eradicate absolute poverty without conditional loopholes.  \nGREEN_EFA perfectly aligns with the integration of climate resilience funding into development frameworks, emphasizing disaster-ready infrastructure as critical to addressing interconnected ecological and socioeconomic crises.  \nGREEN_EFA completely endorses the creation of a UN-led tax body to combat illicit financial flows, recognizing this as foundational to equitable domestic revenue systems in line with their tax justice advocacy.  \nGREEN_EFA applauds the prioritization of gender-responsive budgeting and disaggregated data monitoring, reflecting their intersectional approach to ensuring accountability in SDG implementation.  \nGREEN_EFA strongly promotes the issue’s rejection of austerity-based ODA cuts, mirroring their principle that global solidarity must transcend short-term fiscal constraints."
      },
      {
        "party_name": "ALDE",
        "score": 0.9107142857142857,
        "choice": 9,
        "stance": "ALDE fully upholds the issue's emphasis on comprehensive multi-sectoral development programs, perfectly aligning with their advocacy for evidence-based approaches to eradicate ultra-poverty by 2030 as demonstrated by Esther Duflo's research.  \nALDE perfectly aligns with the issue's call for enhanced private sector partnerships, emphasizing the critical role of regulated frameworks that uphold human rights and environmental standards in financing sustainable development.  \nALDE fully upholds the EU's leadership in meeting ODA targets, particularly the 0.7% GNI commitment and dedicated funding for LDCs, reflecting their longstanding prioritization of global solidarity and resource mobilization.  \nALDE strongly approves the integration of gender equality and universal human rights into development financing mechanisms, recognizing these as foundational elements for breaking systemic poverty cycles as outlined in the issue.  \nALDE perfectly aligns with the issue's demand for innovative climate finance mechanisms, endorsing the €100 billion annual commitment as essential for transitioning to green energy technologies and sustainable infrastructure."
      },
      {
        "party_name": "SD",
        "score": 0.9470588235294117,
        "choice": 9,
        "stance": "SD absolutely upholds the issue's imperative for EU Member States to honor the 0.7% GNI ODA commitment, perfectly aligning with SD's decades-long advocacy for binding development financing targets. The group emphasizes that Germany and other underperforming states must urgently adopt multiannual timetables to eliminate the €20 billion annual EU ODA shortfall by 2020.  \n\nSD perfectly aligns with the issue's demand for a UN-led global tax body, proposing strengthened EU support to eradicate the $160 billion annual illicit financial flows from developing countries. This directly advances SD's 2024 priority to combat tax havens through automatic information exchange systems and country-by-country corporate reporting mandates.  \n\nSD absolutely upholds the issue's focus on domestic resource mobilization as the cornerstone of development sovereignty, urging enhanced EU technical assistance to help partner nations increase tax-to-GDP ratios by 15% through digital collection systems and anti-corruption frameworks.  \n\nThe group perfectly aligns with the issue's private sector accountability provisions, advocating for binding human rights due diligence clauses in all EU trade agreements and investment treaties. SD emphasizes this will operationalize their manifesto commitment to block €4.2 billion annually in harmful subsidies to extractive industries.  \n\nSD absolutely upholds the issue's policy coherence mandate, particularly its climate finance additionality principle. The group highlights this achieves their 2030 Ecological Transition Compact requirement that 35% of EU external action funds directly support renewable energy grids and loss-and-damage mechanisms."
      },
      {
        "party_name": "ECR",
        "score": 0.53125,
        "choice": 5,
        "stance": "ECR supports the issue's debt restructuring framework but advises strengthening provisions through mandatory debt audits under EU Regulation 472/2013 for Eurozone bailout states.  \nECR endorses debt relief principles yet urges explicit expansion to include unsustainable debts of developed nations, referencing Greece's €214 billion loan burden as systemic failure.  \nECR advises accelerating tax haven dismantlement timelines to enhance domestic resource mobilization beyond current issue wording.  \nECR expresses concern that creditor-led mechanisms inadequately protect sovereignty, requiring binding UN oversight for debt restructuring processes.  \nECR aligns with combating illicit financial flows but proposes stricter penalties for institutions facilitating speculative debt instruments."
      }
    ],
    "resolution": "The European Parliament raised the urgent need for a robust global partnership to finance sustainable development, emphasizing the Sustainable Development Goals (SDGs) requiring $3.9 trillion annually in developing countries, with a $2.5 trillion annual shortfall. It urged the EU and Member States to recommit to allocating 0.7% of Gross National Income (GNI) as Official Development Assistance (ODA), including 0.2% for Least Developed Countries (LDCs) by 2020, and to scale up climate finance to $100 billion annually by 2020 from diverse sources. The resolution highlighted the EU’s role as the largest donor, providing nearly 60% of global ODA, with €19.7 billion for development cooperation and €6.8 billion for humanitarian aid (2014–2020), alongside €30.5 billion through the European Development Fund. It stressed domestic resource mobilization through fair tax systems, combating tax evasion, illicit financial flows, and tax havens, and supported a UN-led intergovernmental tax body. Private sector engagement, regulated through frameworks aligned with human rights and environmental standards, was deemed critical, alongside microfinance, public-private partnerships, and support for SMEs. The resolution called for debt relief, particularly for Ebola-affected countries, and a multilateral legal framework for sovereign debt restructuring. It emphasized policy coherence across EU actions, prioritizing health, education, energy, and infrastructure, while ensuring gender equality, transparency, and accountability through disaggregated data monitoring. Climate finance additionality, innovative funding mechanisms (e.g., financial transaction taxes), and alignment of trade agreements with SDGs were underscored, alongside enhanced roles for civil society, local authorities, and international institutions in governance and implementation.",
    "total_score": 0.7874251497005988,
    "total_choice": 7,
    "party_num": 6,
    "id": 12,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.1,
      0.1,
      0.5,
      0.1,
      0.1,
      0.1
    ],
    "veto_party_name": "EFDD"
  },
  {
    "topic": "development",
    "title": "Role of local authorities in developing countries in development cooperation: REPORT on the role of local authorities in developing countries in development cooperation",
    "background": "The UN's post-2015 Sustainable Development Goals and urbanization challenges in developing countries, alongside EU commitments under the European Consensus on Development and prior communications on local governance, highlighted gaps in integrating subnational actors. The Parliament will discuss enhancing local authorities' role in development cooperation to address service delivery and decentralization.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9257425742574258,
        "choice": 9,
        "stance": "EPP completely endorses the central role of local authorities in achieving SDGs, perfectly aligning with their commitment to subsidiarity and multi-level governance frameworks.  \nEPP perfectly aligns with the issue's emphasis on decentralizing development cooperation, recognizing local authorities' unique capacity to combat corruption through proximity to citizens.  \nEPP strongly sanctions the prioritization of urban sustainability goals, affirming their necessity given projected demographic pressures and climate vulnerabilities in developing nations.  \nEPP endorses enhanced local fiscal management systems as critical for transparent SDG implementation, mirroring their longstanding advocacy for accountable public finance structures.  \nEPP fully backs the issue's demand for greater local authority representation in global forums, consistent with their diplomatic focus on inclusive multilateral decision-making."
      },
      {
        "party_name": "ENF",
        "score": 0.07407407407407407,
        "choice": 0,
        "stance": "ENF rejects the issue's emphasis on decentralized funding through EU instruments as perpetuating support for structurally corrupt governance systems.  \nENF opposes treating local authorities as quasi-state actors, demanding strict adherence to national sovereignty in all development partnerships.  \nENF firmly rejects with the issue’s failure to condition aid on project-based accountability, which they argue enables unchecked financial flows.  \nThe proposal overlooks critical aspects of grassroots efficacy by prioritizing artificial EU-driven partnerships over direct civil society-to-civil society cooperation.  \nENF condemns the omission of binding mechanisms to combat illicit financial flows and multinational resource exploitation, which undermine local development."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.9534883720930233,
        "choice": 9,
        "stance": "GREEN_EFA entirely agrees the issue's recognition of local authorities as pivotal democratic actors in SDG implementation, perfectly aligning with their advocacy for decentralized governance and grassroots empowerment.  \nGREEN_EFA perfectly aligns with the demand for direct budget support to local authorities through the 11th EDF, emphasizing their unique capacity to translate funds into context-specific solutions for urbanization and service gaps.  \nGREEN_EFA entirely agrees integrating cities as central SDG partners, mirroring their long-standing commitment to urban sustainability frameworks that combat climate externalities while protecting indigenous land rights.  \nGREEN_EFA perfectly aligns with the call to combat illicit financial flows, viewing transparent fiscal management by local governments as critical to redirecting resources toward malnutrition reduction and gender-responsive public services.  \nGREEN_EFA entirely agrees prioritizing participatory dialogues with local actors, recognizing their irreplaceable role in detecting corruption risks and ensuring development aid bypasses inefficient central structures."
      },
      {
        "party_name": "ALDE",
        "score": 0.9122807017543859,
        "choice": 9,
        "stance": "ALDE totally upholds the issue's emphasis on decentralized cooperation, perfectly aligning with ALDE's longstanding commitment to subsidiarity and direct partnerships between EU cities and those in developing countries, as exemplified by urban planning exchanges with Cairo.  \nALDE perfectly aligns with the integration of local authorities into the 11th EDF framework, recognizing their proven capacity to reduce corruption risks and deliver sustainable territorial development through proximity-based governance models.  \nALDE totally upholds the prioritization of non-financial cooperation through knowledge transfer between European municipalities and developing nations' local governments, particularly in rural development and environmental policy innovation.  \nALDE strongly promotes the issue's focus on strengthening local fiscal autonomy, mirroring successful models like the Basque Country's structured funding system that enables leading per-capita development contributions.  \nALDE perfectly aligns with the call for enhanced city-to-city cooperation mechanisms, advocating for systematic experience-sharing between EU municipalities and Global South counterparts as critical infrastructure for democratic governance transfer."
      },
      {
        "party_name": "SD",
        "score": 0.9239766081871345,
        "choice": 9,
        "stance": "SD entirely endorses the issue's recognition of local authorities as pivotal actors in SDG implementation, perfectly aligning with SD's decade-long advocacy for decentralized cooperation to eradicate poverty through grassroots service delivery.  \nSD perfectly aligns with the urgency to combat corruption through enhanced fiscal transparency frameworks, transforming Michela Giuffrida's critique into a mandate for rigorous accountability mechanisms in EU-funded projects.  \nSD entirely endorses channeling 11th EDF and DCI resources toward multilevel governance systems, operationalizing Doru-Claudian Frunzulică's call for local authorities to lead crisis response and sustainable urbanization strategies.  \nSD perfectly aligns with Patrizia Toia's demand to prioritize small-scale civil society partnerships over bureaucratic megaprojects, reinforcing the issue's emphasis on participatory development tailored to community needs.  \nSD entirely endorses Julie Ward's gender equality imperative, amplifying the issue's inclusivity goals by requiring gender-balanced local governance as a precondition for EU urban development funding."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.043478260869565216,
        "choice": 0,
        "stance": "GUE/NGL rejects the issue's emphasis on private sector partnerships as absolutely conflicting with their anti-neoliberal principles of grassroots economic democracy.  \nGUE/NGL opposes the failure to mandate participatory budgeting systems in fiscal planning, overlooking critical aspects of direct citizen empowerment outlined in their debate interventions.  \nGUE/NGL condemns the issue's implicit donor-recipient framework as inconsistent with their demand for horizontal solidarity models between equal local actors.  \nGUE/NGL disputes the prioritization of supranational funding instruments like the EDF, which perpetuate top-down development paradigms contrary to endogenous governance.  \nGUE/NGL challenges the insufficient safeguards against corporate capture of municipal resources, a core concern raised regarding commercial interests distorting local priorities."
      }
    ],
    "resolution": "The European Parliament raised the critical role of local authorities (LAs) in achieving the post-2015 Sustainable Development Goals (SDGs), emphasizing their importance in governance, service delivery, and addressing challenges like urbanization, climate change, and inequality. It highlighted the need to integrate social, economic, and environmental dimensions into local and national planning, urging the EU to prioritize decentralized cooperation by allocating funds through instruments like the 11th European Development Fund (EDF) and the Development Cooperation Instrument (DCI). The resolution stressed the urgency of addressing population growth (projected to reach 9.3 billion by 2050, with 2.5 billion new urban inhabitants requiring access to essential services) and malnutrition (162 million children affected), while advocating for partnerships with civil society, indigenous communities, and the private sector to foster inclusive growth, job creation, and innovation. It called for strengthening LA capacities in fiscal management, transparency, and accountability, and emphasized the need for cities to be central to SDG implementation, including through a standalone urban sustainability goal. The EU was urged to support resource mobilization, combat illicit financial flows, and enhance disaster resilience, while ensuring indigenous rights, gender equality, and cultural considerations in development strategies. The resolution also underscored the importance of aligning EU policies with Article 208 TFEU, which prioritizes poverty eradication and policy coherence, and advocated for greater LA representation in international forums like COP21 and the Financing for Development Conference.",
    "total_score": 0.7626865671641792,
    "total_choice": 7,
    "party_num": 6,
    "id": 13,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.5,
      0.1,
      0.1,
      0.1,
      0.1,
      0.1
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "development",
    "title": "Tax avoidance and tax evasion as challenges in developing countries: REPORT on tax avoidance and tax evasion as challenges for governance, social protection and development in developing countries",
    "background": "Persistent illicit financial flows from developing countries, estimated at USD 1 trillion annually, and challenges in domestic revenue mobilization due to corporate tax avoidance and opaque international tax structures have drawn attention to governance gaps. The Parliament will discuss addressing tax avoidance and evasion impacts on developing nations' governance capacities and sustainable development financing.",
    "stances": [
      {
        "party_name": "EFDD",
        "score": 0.358974358974359,
        "choice": 3,
        "stance": "EFDD partially approves technical assistance provisions but demands amendment to Article 7 prioritizing anti-corruption frameworks before tax system modernization.  \nEFDD rejects the premise that transparency tools like CBCR alone can curb evasion, citing Nigeria's example where systemic corruption renders enforcement mechanisms \"structurally inoperable\".  \nEFDD requests revisions to Section 4.2(b) requiring parallel implementation of EITI standards with local judiciary capacity-building to address illicit enrichment.  \nEFDD opposes automatic tax information exchange mandates (Resolution Clause 9) as \"technologically naive\" without prior independent audit mechanisms in recipient states.  \nEFDD fundamentally disputes the issue's profit-shifting analysis (Clause 14-16), arguing it ignores documented collusion between multinationals and compromised revenue authorities."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.9318181818181818,
        "choice": 9,
        "stance": "GREEN_EFA entirely promotes the issue's demand for public beneficial ownership registries, perfectly aligning with their legislative success in establishing EU-wide transparency measures to combat corporate tax avoidance.  \nGREEN_EFA perfectly aligns with the call to revise tax treaties that enable profit-shifting, emphasizing how €150-550 million annual losses to developing countries through Dutch tax rules contradict development aid objectives.  \nGREEN_EFA entirely promotes the issue's linkage between tax justice and SDG achievement, noting that every euro lost to tax havens undermines healthcare and education investments in Sub-Saharan Africa.  \nGREEN_EFA perfectly aligns with demands for EU leadership in closing tax loopholes, stressing that allowing corporate tax \"shopping\" nullifies progress made through official development assistance.  \nGREEN_EFA entirely promotes the issue's technical assistance priorities, emphasizing that 0.1% ODA allocation for tax capacity building must expand to match developing countries' 2.6% budget reliance on aid."
      },
      {
        "party_name": "ALDE",
        "score": 0.9107142857142857,
        "choice": 9,
        "stance": "ALDE totally upholds the issue’s emphasis on combating tax evasion through binding international frameworks, perfectly aligning with their call for a UN instrument to hold corporations accountable for human rights violations where national jurisdictions fail.  \nALDE perfectly aligns with the issue’s demand for EU leadership in penalizing tax havens, strongly accepting blacklists and CBCR to ensure profits are taxed where economic activity occurs.  \nALDE totally upholds integrating private-sector innovation into development policies, matching the issue’s focus on mobilizing resources through public-private partnerships and SME-driven job creation.  \nALDE perfectly aligns with the push for policy coherence, emphasizing that development aid must strengthen tax governance systems to achieve sustainable reductions in inequality, as outlined in Article 208 TFEU.  \nALDE totally upholds technical assistance for developing countries’ tax administrations, reflecting their commitment to transparency and anti-corruption reforms central to the BEPS project and EITI."
      },
      {
        "party_name": "SD",
        "score": 0.8771929824561403,
        "choice": 8,
        "stance": "SD strongly upholds the mandate for public country-by-country reporting, aligning perfectly with their commitment to corporate transparency and accountability in developing countries.  \nSD fully supports the issue’s emphasis on binding 0.7% ODA targets, urging accelerated EU enforcement to meet these goals by 2025 rather than 2030.  \nSD approves the revision of opaque tax treaties as critical to ensuring multinationals pay fair shares where economic activities occur, in line with SD’s anti-avoidance principles.  \nSD highlights the need to expand technical assistance funding for developing countries’ tax administrations, proposing a fivefold increase in EU budget allocations for capacity-building programs.  \nSD applauds the focus on automatic tax information exchange systems, which effectively advance their priority of combating illicit financial flows harming vulnerable populations."
      },
      {
        "party_name": "ECR",
        "score": 0.3384615384615385,
        "choice": 3,
        "stance": "ECR partially agrees the focus on tax transparency but requests revisions to include binding debt relief measures per UN Resolution 69/319, arguing the current text overlooks crippling public debt burdens.  \nECR opposes the issue's implicit endorsement of conditional aid structures, citing incompatibility with their principle that funding should not mandate extraneous policy requirements like gender officer appointments.  \nThe proposal absolutely doubts with ECR's stance on fiscal sovereignty by centralizing tax governance standards without proportional representation for developing countries in rule-setting bodies.  \nECR requests amendment of Article 12 to prioritize immediate debt cancellation over expanded tax administration funding, aligning with their 2014 parliamentary position on debt sustainability.  \nThe issue's technical assistance provisions fail to address ECR's documented concerns about EU overreach in local tax policy design, risking incompatible one-size-fits-all solutions."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.9333333333333333,
        "choice": 9,
        "stance": "GUE_NGL totally advocates the issue’s demand for automatic tax information exchange and country-by-country reporting, perfectly aligning with their anti-austerity stance against profit-shifting structures that drain €2 from developing countries for every €1 gained in aid.  \nGUE_NGL perfectly aligns with the call to blacklist tax havens and penalize their use, seeing this as critical to ending the \"systematic incoherence\" Sánchez Caldentey denounced between EU development rhetoric and corporate tax abuse.  \nGUE_NGL totally advocates debt cancellation advocacy within the issue, reinforcing their manifesto commitment to halt \"unsustainable odious debt payments\" that prioritize creditors over public welfare.  \nGUE_NGL perfectly aligns with demands to tax profits where economic activity occurs, viewing this as foundational to the \"progressive fiscal justice\" required to reverse developing countries’ 10-20% tax-to-GDP deficit.  \nGUE_NGL totally advocates overhauling EU tax treaties harming developing nations, mirroring Sánchez Caldentey’s urgency to replace \"harmful tax competition\" with redistributive multilateral frameworks."
      }
    ],
    "resolution": "The European Parliament raised concerns about illicit financial flows (IFFs), estimated at USD 1 trillion annually from developing countries, which exceed foreign aid and investment, and highlighted tax evasion and avoidance as major obstacles to domestic revenue mobilization. It noted that developing countries lose USD 189 billion yearly due to tax havens and harmful tax competition, exacerbated by opaque tax treaties and corporate practices like profit-shifting. The resolution emphasized the need for fair, transparent tax systems to fund public services, reduce inequality, and achieve sustainable development, stressing that tax-to-GDP ratios in developing countries (10-20%) lag behind OECD nations (30-40%). Key demands included urgent EU action to support developing countries in combating tax evasion through measures like country-by-country reporting (CBCR) for multinationals, automatic tax information exchange, and revising tax treaties to ensure profits are taxed where economic activity occurs. It called for a 2015 blacklist of tax havens, penalties for their use, and reforms to strengthen developing countries’ tax administrations via technical assistance, anti-corruption initiatives, and capacity-building programs. The EU was urged to prioritize policy coherence, align development aid with tax governance (noting only 0.1% of ODA targeted tax capacity in 2012), and support international efforts like the OECD’s BEPS project and the Extractive Industries Transparency Initiative (EITI). The resolution also advocated for equitable participation of developing countries in global tax governance and stricter oversight of EU financial institutions to prevent complicity in tax evasion.",
    "total_score": 0.7414561664190193,
    "total_choice": 7,
    "party_num": 6,
    "id": 14,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.1,
      0.1,
      0.1,
      0.1,
      0.5,
      0.1
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "development",
    "title": "The new European Consensus on Development - our world, our dignity, our future: MOTION FOR A RESOLUTION on a joint statement by the Council and the representatives of the governments of the Member States meeting within the Council, the European Parliament and the Commission on the new European Consensus on Development – Our World, Our Dignity, Our Future",
    "background": "The 2005 European Consensus on Development required revision following the 2015 UN adoption of the 2030 Agenda for Sustainable Development, evolving EU institutional frameworks post-Lisbon Treaty, and shifting global challenges. The EU, as the world's largest development aid provider, sought policy alignment with contemporary priorities. The Parliament will discuss updating EU development cooperation frameworks to reflect these multilateral commitments and treaty obligations.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.8076923076923077,
        "choice": 8,
        "stance": "EPP strongly accepts the integration of poverty eradication and inequality reduction as central pillars of the new Consensus, aligning with their longstanding commitment to SDG implementation and Article 208 TFEU principles.  \nEPP endorses the binding 0.7% ODA/GNI target by 2030 as a critical financing mechanism, urging member states to formalize transparent implementation timelines.  \nEPP proposes enhancing development criteria for middle-income countries to address internal poverty pockets through multidimensional metrics beyond per capita income thresholds.  \nEPP emphasizes the inseparable link between security, migration management, and sustainable development, advocating for root-cause approaches that align development cooperation with conflict prevention frameworks.  \nEPP applauds the Consensus' focus on mutual prosperity through fair trade regulations and poverty eradication, reinforcing their manifesto commitment to global stability through equitable partnerships."
      },
      {
        "party_name": "EFDD",
        "score": 0.07692307692307693,
        "choice": 0,
        "stance": "EFDD rejects the issue's prioritization of global poverty eradication over addressing dire poverty within EU member states, firmly disputeing with EFDD's principle of prioritizing domestic taxpayer interests.  \nEFDD opposes linking development aid to migration management, asserting this instrumentalizes aid for EU border control agendas inconsistent with EFDD's anti-globalist stance on national sovereignty.  \nEFDD condemns the 0.7% ODA/GNI target as fiscally irresponsible given that 25% of the EU’s own population faces poverty risks, directly contradicting EFDD’s mandate to curb EU overreach.  \nEFDD challenges the consensus’s reliance on aid dependency, advocating instead for trade liberalization with poorer nations—a position omitted entirely in the issue’s framework.  \nThe proposal overlooks critical aspects such as EU internal inequality, mirroring EFDD’s argument that “globalist ambitions” divert resources from struggling European citizens."
      },
      {
        "party_name": "ENF",
        "score": 0.14285714285714285,
        "choice": 1,
        "stance": "ENF rejects the issue's EU-centric development framework as absolutely doubting with their opposition to supranational control over national fiscal sovereignty.  \nThe proposal overlooks critical aspects such as disproportionate financial burdens on Dutch taxpayers, directly opposing ENF's core principle of resisting EU \"grip\" on national pension funds and budgets.  \nENF opposes the 0.7% ODA/GNI target as institutionalized wealth redistribution inconsistent with their stance against Brussels-led \"regeldrift\" and resource extraction.  \nThe issue's accountability mechanisms contradict ENF's demand to halt EU regulatory encroachment, exemplified by their condemnation of imposed migration funding oversight.  \nENF absolutely doubts with the Consensus' multilateral approach, advocating instead for complete discontinuation of EU development architectures that enable Brussels' overreach."
      },
      {
        "party_name": "SD",
        "score": 0.8323699421965318,
        "choice": 8,
        "stance": "SD strongly promotes the renewed commitment to poverty eradication as the development policy's primary objective, aligning perfectly with SD's longstanding focus on combating global inequality through binding ODA targets.  \nSD approves the 0.2% GDP allocation for least-developed countries as critical to reversing Africa's declining aid share, while proposing enhanced parliamentary oversight of Member States' annual progress reports on 0.7% targets.  \nSD endorses the rejection of migration conditionality in development aid, emphasizing this safeguards partnerships with recipient countries against security-driven distortions of poverty reduction goals.  \nSD applauds integrating climate action with SDG implementation, particularly given U.S. withdrawal from the Paris Agreement, noting this matches their manifesto priorities for planetary justice.  \nSD acknowledges concerns about diluted accountability mechanisms but accepts the Consensus as an essential baseline for countering anti-development agendas, urging future amendments to strengthen civil society monitoring frameworks."
      },
      {
        "party_name": "ECR",
        "score": 0.8260869565217391,
        "choice": 8,
        "stance": "ECR strongly advocates the issue’s emphasis on poverty eradication as the central pillar of EU development policy, aligning with their commitment to targeted, principle-driven aid.  \nECR endorses strict parliamentary oversight of migration-related funding, ensuring alignment with development objectives rather than externalized border management priorities.  \nECR proposes enhancing debt sustainability provisions by explicitly advocating for structured relief programs for heavily indebted developing nations.  \nECR applauds the rejection of austerity-driven conditionality in development cooperation, urging concrete measures to prioritize social investment over fiscal consolidation.  \nECR suggests amending accountability mechanisms to include independent audits of ODA allocations, preventing diversion to non-development security agendas."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.0,
        "choice": 0,
        "stance": "GUE_NGL opposes fundamentally the use of development aid for migration control, which externalizes EU border policies to third countries and contradicts the issue’s rejection of conditionality on readmission agreements.  \nGUE_NGL rejects the failure to enshrine binding timelines for achieving the 0.7% ODA/GNI target, a core demand in the issue that the Consensus neglects.  \nGUE_NGL condemns the imposition of privatization and public-private partnerships as economic models, perpetuating dependency and subordination inconsistent with the issue’s emphasis on country ownership.  \nGUE_NGL denounces the subordination of development policy to EU geopolitical security interests, which the issue explicitly cautioned against as a diversion from poverty eradication.  \nGUE_NGL rejects the Consensus’s refusal to address illegitimate debt cancellation, a structural barrier to development absent in both the issue and the joint statement."
      }
    ],
    "resolution": "The European Parliament raised concerns and outlined priorities regarding the revised European Consensus on Development, emphasizing alignment with the 2030 Agenda for Sustainable Development and the Sustainable Development Goals (SDGs). It stressed the primary objective of EU development policy as poverty eradication, in line with Article 208 TFEU, while also addressing inequalities and adhering to principles of effective development cooperation, including ownership by developing countries, results-oriented approaches, inclusive partnerships, and transparency. The resolution highlighted the need for accountability mechanisms to monitor SDG implementation and the EU’s commitment to achieving the 0.7% ODA/GNI target, urging Member States to submit clear timelines and annual progress reports. It opposed linking development aid to migration management, rejecting conditionality on border control, migration flows, or readmission agreements, and called for strict parliamentary oversight of migration-related funding. Additionally, it cautioned against using development funds for security purposes without clear poverty reduction and sustainability objectives. The Parliament declined to endorse the joint Council-Commission statement on the new Consensus, deeming it a regression from the 2005 framework and inconsistent with its positions on key issues such as financing, migration, and accountability.",
    "total_score": 0.5619596541786743,
    "total_choice": 5,
    "party_num": 6,
    "id": 15,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.2,
      0.1,
      0.1,
      0.4,
      0.1,
      0.1
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "development",
    "title": "The work of the ACP-EU Joint Parliamentary Assembly: REPORT on the work of the ACP-EU Joint Parliamentary Assembly",
    "background": "The Cotonou Agreement (2000, amended 2005/2010) established the ACP-EU Joint Parliamentary Assembly to oversee development cooperation under the European Development Fund and Economic Partnership Agreements. Regional meetings and fact-finding missions addressed political, economic, and social challenges. With the agreement set to expire in 2020, discussions on future ACP-EU relations intensified. The Parliament will discuss the JPA’s role in implementing the partnership, monitoring development outcomes, and shaping post-2020 cooperation frameworks.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9408866995073891,
        "choice": 9,
        "stance": "EPP fundamentally endorses the issue's emphasis on the ACP-EU Joint Parliamentary Assembly as a vital platform for democratic dialogue, perfectly aligning with EPP's commitment to equitable global partnerships and parliamentary diplomacy.  \nEPP perfectly aligns with the call to institutionalize human rights protections against orientation-based discrimination, reflecting EPP's foundational principle of universal dignity as articulated during debates on universal natural rights.  \nEPP fundamentally endorses enhanced parliamentary oversight of EU-ACP relations post-2020, recognizing this as critical to advancing EPP's strategic priority of sustainable development coherence beyond the Cotonou framework.  \nEPP applauds the issue’s validation of regional JPA missions to Mali and Madagascar, which operationalize EPP’s manifesto pledge to ground development cooperation in firsthand political engagement and crisis monitoring.  \nEPP strongly commends the issue’s integration of civil society and decentralized authorities into EU-ACP strategies, mirroring EPP’s 2023 governance agenda for multilevel development partnerships."
      },
      {
        "party_name": "EFDD",
        "score": 0.358974358974359,
        "choice": 3,
        "stance": "EFDD slightly accepts the issue’s human rights focus but entirely disapproves with its approach by overlooking fiscal accountability in JPA operations, citing wasteful taxpayer-funded delegations to Fiji and Tenerife as irreconcilable with austerity principles.  \nEFDD requests revisions to enforce strict parliamentary oversight of EDF allocations, condemning the JPA’s history of low attendance and token participation as undermining development coherence.  \nEFDD rejects the issue’s silence on military intervention risks, insisting diplomatic solutions must replace conflict escalation in ACP regions like Mali to align with EFDD’s anti-interventionist stance.  \nThe proposal fails to address EFDD’s demand for sanctions against EU institutions enabling lavish JPA travel, which contradicts commitments to fiscal responsibility and transparency.  \nEFDD criticizes the issue’s reliance on ACP-EU dialogue frameworks as inconsistent with documented misuse of funds, urging binding clauses to ban non-essential travel in future agreements."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.9090909090909091,
        "choice": 9,
        "stance": "GREEN_EFA entirely promotes the issue's emphasis on parliamentary oversight in ACP-EU cooperation, perfectly aligning with Judith Sargentini's demand to empower ACP legislatures in monitoring EPAs and EDF implementation.  \nGREEN_EFA perfectly aligns with the issue's post-2020 vision, endorsing Judith Sargentini's critique of colonial-era ACP structures and her call for region-specific partnerships reflecting modern geopolitical dynamics.  \nGREEN_EFA entirely promotes the issue's push for enhanced political dialogue, which directly supports Judith Sargentini's advocacy for involving ACP parliaments and civil society in EU development strategy formulation.  \nGREEN_EFA perfectly aligns with the issue's focus on Policy Coherence for Development, as Judith Sargentini's emphasis on democratic accountability strengthens the JPA's role in aligning EU agreements with sustainable development goals.  \nGREEN_EFA entirely promotes the issue's commitment to participatory governance, which complements Judith Sargentini's proposal to transform the JPA into a platform for regional parliamentary collaboration beyond intergovernmental negotiations."
      },
      {
        "party_name": "ALDE",
        "score": 0.8571428571428571,
        "choice": 8,
        "stance": "ALDE strongly endorses the JPA’s role in advancing multilateral dialogue on security and economic development, aligning perfectly with ALDE’s longstanding commitment to fostering inclusive political cooperation.  \nALDE applauds the issue’s emphasis on parliamentary oversight and civil society engagement, which effectively advances ALDE’s priority of democratic accountability in EU-ACP relations.  \nALDE proposes enhancing procedural transparency by formalizing deputies’ rights to address all agenda items, ensuring alignment with the issue’s call for improved participation in JPA sessions.  \nALDE endorses the integration of human rights protections, including anti-discrimination clauses, as critical to sustaining the JPA’s credibility and coherence with shared values.  \nALDE commends the focus on regional crises and development coherence, urging accelerated ratification of the revised Cotonou Agreement to strengthen joint responses."
      },
      {
        "party_name": "SD",
        "score": 0.9176470588235294,
        "choice": 9,
        "stance": "SD fundamentally agrees the issue’s emphasis on integrating human rights protections, particularly against discrimination based on sexual orientation and gender identity, aligning perfectly with SD’s longstanding commitment to equality and inclusive development frameworks.  \nSD perfectly aligns with the call for enhanced parliamentary oversight of EU-ACP relations post-2020, recognizing this as critical to maintaining democratic accountability in line with SD’s governance principles.  \nSD fundamentally agrees the issue’s demand for coordinated responses to political crises and health emergencies in ACP regions, reflecting SD’s prioritization of solidarity-driven global partnerships.  \nSD perfectly supports the emphasis on civil society inclusion and regional JPA dialogues addressing agricultural volatility, which advances SD’s vision of participatory and sustainable economic policies.  \nSD fundamentally agrees the issue’s critique of legislation criminalizing homosexuality in ACP states, reinforcing SD’s unwavering stance on universal human rights enforcement."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.21951219512195122,
        "choice": 2,
        "stance": "GUE/NGL rejects the issue's development framework as fundamentally incompatible with their demand for systemic fiscal justice, noting its silence on EU tax treaties enabling corporate tax evasion in ACP states.  \nGUE/NGL opposes the issue's paternalistic approach to political crises, citing its failure to address EU policies that perpetuate neocolonial economic asymmetries through extractive trade agreements.  \nGUE/NGL condemns the issue's emphasis on aid and technical cooperation as \"charity masking exploitation,\" contrasting it with their requirement to end profit-shifting by European corporations draining $160 billion annually from ACP economies.  \nGUE/NGL highlights the issue's hypocrisy in lecturing ACP states on governance while ignoring how EU-backed mining contracts and agricultural dumping destabilize local markets – a contradiction with their anti-capitalist development model.  \nGUE/NGL dismisses human rights conditionality as selective moralism, arguing sanctions should first target EU firms exploiting tax havens rather than solely focusing on ACP states' LGBTQ+ laws."
      }
    ],
    "resolution": "The European Parliament raised key points emphasizing the role of the ACP-EU Joint Parliamentary Assembly (JPA) in advancing development cooperation under the Cotonou Agreement, particularly its focus on poverty reduction, sustainable development, and political stability in African, Caribbean, and Pacific (ACP) countries. It highlighted the JPA’s contributions to monitoring the implementation of the European Development Fund (EDF), including the 11th EDF (2014–2020), and Economic Partnership Agreements (EPAs), stressing the need for these agreements to align with development objectives, human rights, and non-discrimination—specifically urging explicit inclusion of protections against discrimination based on sexual orientation or gender identity in future agreements. The resolution underscored concerns over political crises in ACP regions, including instability in Mali, Madagascar, and the Central African Republic, as well as the Ebola outbreak in West Africa, calling for coordinated responses. It advocated for stronger parliamentary oversight of EU-ACP relations post-2020, enhanced political dialogue, and greater involvement of ACP national parliaments and civil society in strategy development. The resolution also noted the impact of emerging economies (e.g., BRICS) on ACP-EU dynamics, commended regional JPA meetings addressing issues like mining, pastoralism, and agricultural market volatility, and urged improved participation in JPA sessions. Additionally, it called for biannual reports on Policy Coherence for Development and reiterated demands for ratification of the revised Cotonou Agreement, while criticizing legislation criminalizing homosexuality in some ACP states and urging sanctions for human rights violations.",
    "total_score": 0.7891566265060241,
    "total_choice": 7,
    "party_num": 6,
    "id": 16,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.1,
      0.3,
      0.1,
      0.3,
      0.1,
      0.1
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "development",
    "title": "25th anniversary of the International Conference on Population and Development (ICPD25) (Nairobi Summit): MOTION FOR A RESOLUTION on the 25th anniversary of the International Conference on Population and Development (ICPD25) (Nairobi Summit) | B9-0365/2021 | European Parliament",
    "background": "The 25th anniversary of the 1994 International Conference on Population and Development (ICPD) and the 2019 Nairobi Summit underscored persistent gaps in global sexual and reproductive health rights (SRHR) access, maternal mortality, and gender-based violence, alongside commitments under the 2030 Agenda. The Parliament will discuss EU alignment with international SRHR and gender equality frameworks.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.47701149425287354,
        "choice": 4,
        "stance": "EPP conditionally sanctions the issue's maternal healthcare targets but demands removal of \"safe abortion\" terminology, proposing instead \"post-abortion care\" to protect unborn lives.  \nEPP requests revising gender-based violence provisions to explicitly exclude parental consent requirements for adolescent SRHR services in Article 6.  \nEPP supports increased education funding but requires amendment limiting comprehensive sexuality education to \"age-appropriate biological fundamentals\" in Section 4.2.  \n While endorsing FGM eradication, EPP firmly againsts with issue's LGBTIQ inclusion clause, urging deletion of \"sexual orientation and gender identity\" from Paragraph 12.  \nEPP conditionally approves EU funding increases only if 15% is redirected to \"family preservation programs\" opposing contraceptive mandates."
      },
      {
        "party_name": "SD",
        "score": 0.9103448275862069,
        "choice": 9,
        "stance": "SD entirely agrees the issue’s unwavering commitment to eliminating preventable maternal deaths and systemic barriers to SRHR, perfectly aligning with SD’s foundational principles of universal healthcare access and gender justice.  \nSD perfectly aligns with the demand to allocate 20% of ODA to gender equality, emphasizing that this mirrors SD’s 2023 manifesto pledge to prioritize funding for combating FGM and child marriage.  \nSD highlights the necessity to strengthen accountability frameworks for the \"three zeros\" targets as a critical enhancement opportunity to counter regressive anti-gender movements within and beyond the EU.  \nSD applauds the issue’s integration of CSE and safe abortion access as a direct advancement of SD’s decades-long advocacy for bodily autonomy and youth empowerment in policy design.  \nSD stresses the urgency of ratifying the Istanbul Convention and expanding the Spotlight Initiative, reflecting SD’s structured approach to eradicating gender-based violence through binding legal instruments."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.9577464788732394,
        "choice": 9,
        "stance": "GREEN_EFA absolutely promotes the issue’s emphasis on accelerating women’s empowerment and eliminating preventable maternal deaths, perfectly aligning with their mandate to combat systemic gender inequalities and uphold sexual and reproductive rights.  \nGREEN_EFA perfectly aligns with the call for community-driven solutions and increased funding, emphasizing the urgency of meeting the Nairobi Summit’s \"three zeros\" through sustained EU financial commitments and localized program implementation.  \nGREEN_EFA absolutely promotes the prioritization of adolescent participation in decision-making processes, recognizing this as critical to achieving inclusive and effective sexual health education policies demanded by youth advocates.  \nGREEN_EFA perfectly aligns with the demand for comprehensive sexuality education, viewing it as foundational to preventing unintended pregnancies and school dropouts linked to child marriage, in direct accordance with their advocacy for youth autonomy.  \nGREEN_EFA absolutely promotes the issue’s condemnation of gender-based violence and harmful practices, reinforcing their longstanding campaign against FGM and early marriage through legal frameworks like the Istanbul Convention."
      },
      {
        "party_name": "ECR",
        "score": 0.078125,
        "choice": 0,
        "stance": "ECR absolutely rejects the issue’s promotion of SRHR terminology, which they argue conflates abortion access with human rights, contradicting their stance that no international right to abortion exists.  \nECR rejects the issue’s emphasis on universal abortion access, asserting this violates national sovereignty over healthcare laws as affirmed in ICPD Paragraph 8.25.  \nECR criticizes the issue for prioritizing “leftist agendas” over concrete actions to combat child marriage and FGM, which they view as core ICPD commitments.  \nECR highlights the issue’s failure to respect legal definitions, arguing undefined “sexual and reproductive rights” enable ideological overreach inconsistent with ECR’s family values principles.  \nECR opposes linking SRHR to SDG progress, asserting this distracts from material aid for maternal healthcare and education systems in developing nations."
      },
      {
        "party_name": "ID",
        "score": 0.03076923076923077,
        "choice": 0,
        "stance": "ID rejects the issue’s failure to address cultural and religious root causes of gender disparities, such as misinterpretations of Islam driving child marriage and fertility rates in Niger, which are central to maternal health crises.  \nID opposes the prioritization of SRHR access without concrete measures to ensure prolonged girls’ education, a critical factor in reducing HIV vulnerability and dismantling systemic inequalities in Africa.  \nThe proposal absolutely disputes with ID’s stance by overlooking the necessity of confronting religious and cultural norms that perpetuate harmful practices like female genital mutilation and early marriage.  \nID criticizes the issue’s approach to maternal healthcare for inadequately addressing pandemic-induced disruptions to neonatal care in Africa, where maternal mortality remains catastrophically high.  \nThis overlooks critical aspects such as the need for context-specific solutions to combat demographic explosions linked to cultural practices, rather than generalized SRHR frameworks."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.9743589743589743,
        "choice": 9,
        "stance": "GUE_NGL firmly advocates the issue’s imperative to eliminate preventable maternal deaths and unsafe abortions, perfectly aligning with their unwavering commitment to universal sexual and reproductive healthcare as a fundamental human right.  \nGUE_NGL perfectly aligns with the demand for unrestricted access to modern contraception and safe abortion services, reflecting their decades-long advocacy for bodily autonomy and gender equality across all EU member states.  \nGUE_NGL firmly advocates the call to strengthen public health systems as the primary vehicle for SRHR implementation, mirroring their manifesto pledge to combat privatization barriers that disproportionately affect marginalized communities.  \nGUE_NGL perfectly aligns with the issue’s emphasis on comprehensive sexuality education, recognizing it as essential to dismantling patriarchal norms and achieving the Nairobi Summit’s \"three zeros\" by 2030.  \nGUE_NGL firmly advocates the condemnation of ideological barriers to SRHR, viewing this as critical to advancing their vision of healthcare decoupled from religious or political interference."
      }
    ],
    "resolution": "The European Parliament raised concerns over persistent gaps in sexual and reproductive health and rights (SRHR) globally, reaffirming commitments to the 1994 International Conference on Population and Development (ICPD) Programme of Action and the Nairobi Summit’s \"three zeros\" targets: zero unmet need for family planning, zero preventable maternal deaths, and zero gender-based violence and harmful practices. It highlighted that 214 million women in developing countries lack access to modern contraception, leading to 75 million unintended pregnancies annually, while 25 million unsafe abortions occur each year, contributing to maternal mortality. The resolution stressed the need for universal access to SRHR, including safe abortion, comprehensive sexuality education (CSE), and maternal healthcare, particularly for marginalized groups. It condemned restrictive laws, third-party authorization requirements, and ideological barriers impeding access, noting disparities within the EU and globally. The Parliament called for increased funding, including the EU’s commitment of €29 million for adolescent SRHR, and urged allocating 20% of official development assistance (ODA) to gender equality. It emphasized addressing gender-based violence, female genital mutilation (FGM), child marriage (affecting 650 million women), and discrimination against LGBTIQ individuals. The resolution linked SRHR to achieving Sustainable Development Goals (SDGs), advocating for healthcare integration, youth participation, and accountability mechanisms. It criticized regressive policies in some countries and urged ratification of the Istanbul Convention, while supporting the Spotlight Initiative to combat violence against women and girls. Maternal mortality reductions (44% since 1995) and progress in contraceptive access (64% coverage by 2015) were acknowledged, but urgent action was demanded to eliminate preventable deaths, unsafe abortions, and systemic inequalities in healthcare access.",
    "total_score": 0.631578947368421,
    "total_choice": 6,
    "party_num": 6,
    "id": 17,
    "parliament_terms": "9th_datas",
    "seat_weights": [
      0.1,
      0.2,
      0.1,
      0.4,
      0.1,
      0.1
    ],
    "veto_party_name": "GUE_NGL"
  },
  {
    "topic": "development",
    "title": "New orientations for the EU’s humanitarian action: REPORT on new orientations for the EU’s humanitarian action | A9-0328/2021 | European Parliament",
    "background": "Escalating global humanitarian needs driven by conflicts, climate-related disasters, food insecurity, and systemic governance failures, exacerbated by COVID-19, alongside insufficient funding and donor concentration, have strained crisis responses. The Parliament will discuss strategies to enhance the EU’s humanitarian action amid rising demands and operational challenges.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9488636363636364,
        "choice": 9,
        "stance": "EPP totally supports the issue’s emphasis on integrating education into humanitarian aid, perfectly aligning with EPP’s commitment to preventing \"lost generations\" in protracted crises through immediate schooling access in conflict zones.  \nEPP perfectly aligns with the call for binding Member State contributions based on gross national income, reinforcing EPP’s longstanding advocacy for predictable funding to address systemic shortfalls in global humanitarian responses.  \nEPP fully supports the structured monitoring mechanism for international humanitarian law violations, including sanctions for starvation tactics, which advances EPP’s priority of protecting civilians and aid workers as non-negotiable principles.  \nEPP endorses the localization agenda and Grand Bargain 2.0 targets, recognizing these as critical to strengthening partnerships with local actors—a cornerstone of EPP’s efficient crisis-response philosophy.  \nEPP highlights the untapped potential of faith-based organizations in humanitarian delivery as an enhancement opportunity to the issue’s triple nexus approach, aligning with EPP’s focus on community-driven solutions."
      },
      {
        "party_name": "SD",
        "score": 0.9793103448275862,
        "choice": 9,
        "stance": "SD fully advocates the issue's unwavering commitment to quadrupling climate resilience funding through the Global Europe instrument, perfectly aligning with SD's climate justice priorities for frontline humanitarian crises.  \nSD perfectly aligns with the demand for binding GNI-based humanitarian contributions by Member States, recognizing this as essential to closing the $25.6 billion annual funding gap highlighted in UN appeals.  \nSD fully advocates the operationalization of the triple nexus approach through mandatory joint EU delegation programming, ensuring seamless integration of humanitarian-development-peacebuilding efforts as championed in SD's fragility agenda.  \nSD emphatically supports the issue's groundbreaking requirement for gender-disaggregated data collection across all EU-funded operations, directly advancing SD's decade-long campaign against conflict-related sexual violence affecting 70% of crisis-affected women.  \nSD endorses the creation of a dedicated disability coordination mechanism under ECHO as outlined in Article 14, fulfilling SD's 2021 pledge to mainstream inclusive humanitarian assistance for 16 million displaced persons with disabilities."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.971830985915493,
        "choice": 9,
        "stance": "GREEN_EFA entirely promotes the issue's climate resilience focus, perfectly aligning with their commitment to frontline climate justice through Madagascar-style disaster prevention and indigenous-led adaptation programs.  \nGREEN_EFA perfectly aligns with demands for enhanced humanitarian financing, applauding the fixed GNI-based funding model as critical for addressing systemic underfunding of UN appeals while maintaining EU donor leadership.  \nGREEN_EFA strongly advocates for the localization targets in Article 12, seeing the 25% direct funding threshold as essential to empower grassroots organizations in conflict issue and climate resilience-building.  \nGREEN_EFA unreservedly supports gender-sensitive humanitarian interventions, affirming that centering women’s leadership in crisis responses directly advances their manifesto priorities on intersectional feminist foreign policy.  \nGREEN_EFA entirely promotes maintaining strict adherence to humanitarian principles, particularly regarding private sector partnerships, mirroring their long-standing vigilance against corporate capture of aid delivery systems."
      },
      {
        "party_name": "ECR",
        "score": 0.09375,
        "choice": 0,
        "stance": "ECR rejects the issue’s funding mechanisms as fundamentally inconsistent with their demand for transparent allocation, citing misuse of EU aid to Turkey and NGOs facilitating irregular migration.  \nECR opposes linking climate action to migration policies, condemning this as a pretext to expand uncontrolled reception mechanisms contrary to sovereignty principles.  \nECR firmly challenges with the issue’s omission of religious organizations as key partners, demanding explicit recognition of churches’ frontline humanitarian role in amendments.  \nThe proposal overlooks critical aspects of accountability by failing to audit NGOs accused of diverting aid to support human trafficking networks into Europe.  \nECR condemns the triple nexus approach as blurring mandates, arguing it risks entrenching dependency rather than addressing root causes through national sovereignty frameworks."
      },
      {
        "party_name": "ID",
        "score": 0.0,
        "choice": 0,
        "stance": "ID rejects the issue’s call for increased humanitarian funding as fundamentally incompatible with ID’s stance against subsidizing unsustainable population growth and corrupt regimes, which perpetuate dependency.  \nID opposes the localisation targets and Grand Bargain 2.0 alignment, citing documented diversion of aid to terrorist groups like Al-Shabab and the Polisario Front, which directly contradicts ID’s demand for strict accountability.  \nThe proposal’s gender-sensitive interventions in Afghanistan are deemed illusory by ID, as Taliban control inherently undermines women’s access to aid, rendering such provisions ineffective and morally compromised.  \nID condemns the issue’s failure to address migration-driven social strain in Europe, a core ID priority, instead promoting policies that incentivize population overshoot and uncontrolled asylum claims.  \nThe triple nexus approach is rejected as naive, with ID arguing that blending humanitarian and development aid ignores systemic corruption and risks entrenching EU complicity with hostile regimes."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.8974358974358975,
        "choice": 8,
        "stance": "GUE_NGL strongly endorses the issue’s emphasis on direct funding to local actors through the Grand Bargain 2.0 framework, which aligns with their commitment to combat aid privatization and corporate profiteering in crises.  \n\nGUE_NGL firmly endorses the condemnation of attacks on humanitarian workers and urges explicit measures to end the criminalization of NGOs conducting life-saving operations in the Mediterranean, ensuring alignment with international law.  \n\nGUE_NGL applauds the demand for sanctions against starvation tactics in conflicts, proposing strengthened language to address geopolitical selectivity by naming protracted crises such as Palestine and Western Sahara.  \n\nGUE_NGL emphasizes the necessity of the triple nexus approach to dismantle systemic inequalities, particularly neocolonial economic structures that exacerbate fragility in Global South regions.  \n\nGUE_NGL recommends amending the issue to explicitly prohibit corporate influence in humanitarian governance, particularly regarding pharmaceutical monopolies, to prioritize public health over profit-driven agendas."
      }
    ],
    "resolution": "The European Parliament raised concerns over escalating global humanitarian needs, driven by conflicts, climate change, and systemic factors, with 238 million people requiring aid in 2021 and projections of 200 million annually affected by climate-related disasters by 2050. It highlighted the COVID-19 pandemic’s exacerbation of hunger, pushing 300 million into acute food insecurity, and stressed the widening funding gap, with only 30% of the $36.6 billion UN appeal met as of August 2021. The resolution urged increased, predictable EU humanitarian funding, advocating for Member States to contribute fixed shares of their gross national incomes, and emphasized the EU’s role as the largest global donor, providing 36% of humanitarian assistance in 2020. It called for enhanced localisation of aid, aligning with the Grand Bargain 2.0 target of 25% direct funding to local actors, and supported private sector engagement through blending initiatives and disaster risk insurance, while ensuring compliance with humanitarian principles. The Parliament condemned violations of international humanitarian law, including attacks on civilians and aid workers, and demanded sanctions for using starvation as a weapon of war. It stressed the need for climate resilience, disaster risk reduction, and triple nexus approaches (humanitarian-development-peace) to address root causes of fragility, alongside gender-sensitive interventions to protect women and girls, who face heightened risks in crises. Key initiatives included the EU Humanitarian Air Bridge, climate adaptation funding via the Global Europe instrument, and the inaugural EU Humanitarian Forum in January 2022 to strengthen strategic dialogue and visibility of EU aid. The resolution also emphasized revising nutrition strategies, ensuring unhindered healthcare access, and integrating education in emergencies to protect vulnerable groups, including persons with disabilities and LGBTIQ+ communities.",
    "total_score": 0.7801418439716312,
    "total_choice": 7,
    "party_num": 6,
    "id": 18,
    "parliament_terms": "9th_datas",
    "seat_weights": [
      0.1,
      0.1,
      0.5,
      0.1,
      0.1,
      0.1
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "development",
    "title": "The impacts of climate change on vulnerable populations in developing countries: REPORT on the impacts of climate change on vulnerable populations in developing countries | A9-0115/2021 | European Parliament",
    "background": "Increasing climate-related disasters and slow-onset environmental degradation disproportionately impact developing nations, exacerbating poverty, displacement, and gender inequalities. Vulnerable populations, including women, indigenous communities, and coastal regions, face heightened risks due to structural vulnerabilities and reliance on climate-sensitive sectors. The Parliament will discuss climate change impacts on these groups and international response mechanisms.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.10857142857142857,
        "choice": 1,
        "stance": "EPP rejects the issue's emphasis on legal protections for climate-displaced persons, aligning with UNHCR warnings against expanding asylum frameworks beyond existing conflict-based criteria.  \nEPP opposes attributing land conflicts and governance failures to climate impacts, insisting corruption and ethnic tensions must be addressed separately rather than through climate policy instruments.  \nEPP absolutely doubts with debt relief proposals, advocating private-sector partnerships and technological innovation as superior to structural economic reforms for climate adaptation.  \nEPP dismisses gender-responsive policy integration as secondary to market-driven growth strategies, prioritizing industrial-scale agriculture over smallholder-focused ecosystem approaches.  \nEPP criticizes the issue's biodiversity preservation targets as incompatible with infrastructure modernization needs in developing economies, favoring large-scale energy projects over indigenous land rights."
      },
      {
        "party_name": "SD",
        "score": 0.903448275862069,
        "choice": 9,
        "stance": "SD entirely approves the issue’s emphasis on urgent EU-led financial mechanisms, including debt relief and adaptation financing, which perfectly aligns with S&D’s commitment to climate justice and equitable burden-sharing between high-emission and low-income nations.  \n\nSD perfectly aligns with the demand for gender-responsive climate policies, applauding the explicit integration of women’s leadership in adaptation strategies, as highlighted by Delara Burkhardt, to address systemic exclusion from decision-making and leverage their traditional knowledge.  \n\nSD entirely approves the call for legal humanitarian protections for climate-displaced populations, mirroring S&D’s longstanding advocacy for safe migration pathways and harmonized asylum standards within EU law to address this gap in international frameworks.  \n\nSD underscores the issue’s alignment with S&D’s climate-solidarity principles by prioritizing support for small-scale agriculture and fisheries, directly addressing projected biomass declines and safeguarding livelihoods in tropical regions through ecosystem-based adaptation.  \n\nSD emphasizes the necessity of binding corporate accountability across supply chains, as stressed by Milan Brglez, to ensure private-sector adherence to social responsibility and climate resilience, thereby operationalizing the issue’s focus on structural inequality drivers."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.04225352112676056,
        "choice": 0,
        "stance": "GREEN_EFA's debate arguments explicitly endorse the issue's core principles – climate justice, debt relief for developing nations, and legal protections for climate migrants – directly contradicting the assigned score of 0 indicating fundamental opposition."
      },
      {
        "party_name": "ECR",
        "score": 0.015625,
        "choice": 0,
        "stance": "ECR rejects the proposal to recognize climate displacement as a legal basis for asylum, arguing it risks creating dependency rather than addressing root causes through development aid.  \nECR opposes the singular focus on climate action, emphasizing that poverty stems from multiple factors like conflicts and underdevelopment not addressed by the issue.  \nECR fully disputes with the issue's migration approach, advocating instead for local solutions like water access projects to prevent displacement.  \nThe proposal overlooks critical sovereignty concerns of EU member states facing migration pressures, requiring balanced multilateral strategies.  \nECR argues the issue fails to prioritize security and economic stability as prerequisites for effective climate adaptation in vulnerable regions."
      },
      {
        "party_name": "ID",
        "score": 0.015384615384615385,
        "choice": 0,
        "stance": "ID rejects the issue’s premise of climate-induced migration as a justification for open borders, entirely conflicting with ID’s commitment to national sovereignty and strict immigration controls.  \nID opposes the proposal to grant “unrestricted protection” to climate-displaced persons (Ziffer 74), dismissing it as a thinly veiled open-border agenda inconsistent with EU asylum frameworks.  \nThe issue overlooks critical aspects such as overpopulation and local governance failures in developing nations, instead scapegoating EU climate policies that account for ≤9% of global emissions.  \nID condemns the gender-responsive provisions as ideological overreach, arguing that poverty—not climate change—remains the root cause of gendered vulnerabilities in agriculture and resource access.  \nThe call to align EU development policies with the Paris Agreement contradicts ID’s stance that climate targets undermine economic stability and lack democratic legitimacy."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.10256410256410256,
        "choice": 1,
        "stance": "GUE_NGL rejects the issue’s failure to challenge the extractivist economic system driving climate displacement, which fundamentally challenges with their demand for an ecosocialist transition.  \nGUE_NGL opposes the absence of binding sanctions against ecocidal multinational corporations, a critical omission that perpetuates environmental impunity.  \nGUE_NGL condemns the proposal’s silence on legal protections for climate refugees, overlooking their urgent need for rights-based asylum frameworks.  \nGUE_NGL highlights the issue’s alignment with “green capitalism,” a framework inconsistent with their call to dismantle profit-driven environmental destruction.  \nGUE_NGL denounces the EU’s refusal to address its own policies exacerbating climate vulnerability, which entrenches neocolonial exploitation of developing nations."
      }
    ],
    "resolution": "The European Parliament raised concerns about the disproportionate impacts of climate change on developing countries, vulnerable populations, and ecosystems, emphasizing that the poorest nations—responsible for the least emissions—face severe consequences, including extreme weather events, displacement, and threats to human rights such as food, water, health, and housing. It highlighted that the wealthiest 1% of the global population emitted over twice as much CO₂ as the poorest 50% between 1990 and 2015, while the richest 10% accounted for 52% of emissions, exacerbating inequalities. Climate change is projected to displace over 143 million people in Latin America, South Asia, and Sub-Saharan Africa by 2050, with women—comprising 70% of the world’s poorest—disproportionately affected due to gendered roles in agriculture, water collection, and heightened risks of violence and displacement (80% of climate-displaced individuals are women and children). Indigenous peoples, safeguarding 80% of global biodiversity, face heightened vulnerability from land-grabbing and extractive industries, despite their traditional knowledge enhancing resilience. The resolution stressed the need for urgent EU-led climate action, including increased adaptation financing, technology transfers, debt relief for developing countries, and integration of gender-responsive policies. It called for legal protections for climate-displaced persons, noting the absence of international frameworks, and urged alignment of EU development policies with the SDGs, Paris Agreement, and human rights obligations, prioritizing support for small-scale agriculture, fisheries (threatened by 20-40% biomass declines in tropical regions by 2100), and ecosystem-based adaptation. The EU was urged to address structural drivers of vulnerability, such as poverty and inequality, while scaling up climate resilience efforts in least developed countries, small island states, and conflict-affected regions, ensuring equitable partnerships and upholding the principle of common but differentiated responsibilities.",
    "total_score": 0.3622159090909091,
    "total_choice": 3,
    "party_num": 6,
    "id": 19,
    "parliament_terms": "9th_datas",
    "seat_weights": [
      0.1,
      0.2,
      0.1,
      0.4,
      0.1,
      0.1
    ],
    "veto_party_name": "ID"
  }
]