[
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "Draft protocol on the application of the Charter of fundamental rights of the European Union to the Czech Republic (consent): RECOMMENDATION on the European Council's proposal not to convene a Convention for the addition of a Protocol on the application of the Charter of Fundamental Rights of the European Union to the Czech Republic, to the Treaty on European Union and the Treaty on the Functioning of the European Union",
    "background": "Following the Czech Republic's 2011 request to join Protocol 30 (limiting Charter of Fundamental Rights application, initially applied to Poland and the UK) post-Lisbon Treaty ratification, the European Council proposed amending EU treaties without convening a Convention. The Parliament will discuss procedural compliance and implications of extending Protocol 30 to the Czech Republic.",
    "stances": [
      {
        "party_name": "EFD",
        "score": 0.5483870967741935,
        "choice": 5,
        "stance": "EFD supports the issue’s recognition of prior Conventions but advises revising Protocol No 30 to extend exemptions to the Czech Republic, preventing ECJ interference in historical property disputes like the Beneš Decrees.  \nEFD highlights the need to align Protocol 30’s terms with national sovereignty concerns, proposing amendments to ensure the Charter cannot override settled judicial rulings in member states.  \nEFD advises clarifying Protocol 30’s text to explicitly exempt the Czech Republic from Charter applicability in areas affecting post-war legal settlements, mirroring UK and Poland’s initial safeguards.  \nEFD expresses concern that without binding exemptions, the ECJ may erode Czech judicial authority, urging procedural adjustments to prevent retrospective challenges to national courts.  \nEFD concurs that a new Convention is unnecessary but stresses the urgency of revising existing protocols to address ECJ overreach, as evidenced by the UK’s post-Lisbon experience."
      },
      {
        "party_name": "ECR",
        "score": 0.9464285714285714,
        "choice": 9,
        "stance": "ECR completely endorses the European Council’s proposal to avoid convening a Convention, as this aligns perfectly with their commitment to national sovereignty and streamlined EU decision-making processes.  \nECR emphasizes that the issue’s adherence to existing treaties reinforces their core principle that member states’ legal subjectivity originates from sovereign existence, not supranational institutions.  \nECR proposes enhancing procedural efficiency in parliamentary responses to future agreements to strengthen institutional credibility, reflecting on the delayed formal stance as a procedural refinement opportunity.  \nECR applauds the issue’s clarification that Protocol No 30 maintains fundamental rights obligations, aligning with their stance against exemptions undermining EU legal coherence.  \nECR underscores that rejecting new Conventions advances their priority of curtailing unnecessary EU institutional proliferation, preserving national autonomy in integration matters."
      }
    ],
    "resolution": "The European Parliament raised its approval of the European Council’s proposal not to convene a Convention to extend Protocol No 30—which limits the application of the EU Charter of Fundamental Rights to Poland and the UK—to the Czech Republic, citing that the Charter’s binding status was established through prior Conventions (1999-2000 and 2002-2003) and the Lisbon Treaty (effective 2009), rendering a new Convention unnecessary. It emphasized that the Charter, originally proclaimed in 2000 and revised in 2007, was integral to the EU’s constitutional framework, and extending the Protocol’s scope to the Czech Republic would have limited legal impact. The resolution noted that Protocol No 30, while addressing specific national concerns, does not exempt states from upholding fundamental rights under EU law. Parliament concluded that the proposal did not warrant a Convention, as it did not alter the Charter’s core applicability, and instructed its President to communicate this decision to EU institutions and national parliaments.",
    "total_score": 0.8368700265251989,
    "total_choice": 8,
    "party_num": 2,
    "id": 0,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.1,
      0.9
    ],
    "veto_party_name": "EFD"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "Draft protocol on the application of the Charter of fundamental rights of the European Union to the Czech Republic (consultation): REPORT on the draft protocol on the application of the Charter of Fundamental Rights of the European Union to the Czech Republic (Article 48(3) of the Treaty on European Union)",
    "background": "Following the 2009 European Council agreement to attach a protocol on Charter application to the Czech Republic, the Czech government submitted a 2011 proposal amid domestic constitutional debates and prior parliamentary ratification of the Lisbon Treaty. The Parliament will discuss the draft protocol extending Charter application conditions to the Czech Republic.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.9137931034482759,
        "choice": 9,
        "stance": "GREEN_EFA completely advocates the issue’s rejection of Protocol No 30 as antithetical to universal EU rights, perfectly aligning with their unyielding defense of equal fundamental protections.  \nGREEN_EFA perfectly aligns with the issue’s reliance on the ECJ’s 2011 judgment, which confirms the Charter’s binding force and exposes the Protocol’s redundancy as a political ploy.  \nGREEN_EFA completely advocates highlighting the Czech Senate’s 2011 opposition, reinforcing their stance that no member state should dilute rights under false “opt-out” pretenses.  \nGREEN_EFA perfectly aligns with condemning the Protocol’s extension to the Czech Republic as a dangerous precedent, echoing their manifesto commitment to indivisible rights across all EU territories.  \nGREEN_EFA completely advocates amplifying civil society objections, viewing this as critical to upholding their principle that rights protections must never be bargained for political expediency."
      },
      {
        "party_name": "ECR",
        "score": 0.03571428571428571,
        "choice": 0,
        "stance": "ECR completely rejects the issue's characterization of Protocol No 30 as creating legal uncertainty, aligning with Vlasák's assertion that sovereign states derive legal authority from their existence rather than EU frameworks.  \nECR rejects the issue's dismissal of national parliamentary ratification processes, reflecting Vlasák's emphasis on EU integration being \"primarily a matter for nation states.\"  \nECR condemns the issue's supranational rights harmonization agenda, echoing Vlasák's warning against \"transferring competencies to European quasi-institutions.\"  \nECR disputes the issue's claims about weakened rights protections, supporting Vlasák's view that delayed EU action demonstrates institutional incapacity rather than constitutional necessity.  \nECR opposes the issue's reliance on ECJ interpretations, consistent with Vlasák's argument that political agreements between member states should prevail over judicial activism."
      }
    ],
    "resolution": "The European Parliament raised concerns regarding the Czech Republic’s request to join Protocol No 30, which applies the EU Charter of Fundamental Rights to Poland and the UK, emphasizing that the Protocol does not constitute an opt-out but creates legal uncertainty and undermines uniform rights protection across the EU. The resolution highlighted that the European Court of Justice (ECJ) affirmed in its 2011 judgment that Protocol No 30 does not exempt the UK or Poland from the Charter’s binding provisions, clarifying it merely reiterates existing limits on EU competences. The Czech Senate opposed the Protocol in 2011, fearing it would lower fundamental rights protections for Czech citizens, while academic and legal analyses noted the Protocol’s redundancy, as the Charter already respects national constitutional orders and subsidiarity. The Parliament stressed that extending the Protocol to the Czech Republic, driven by political assurances from the 2009 European Council, risks perpetuating confusion and weakening the EU’s commitment to high rights standards. It also noted doubts about the Czech Parliament’s willingness to ratify the Protocol, potential constitutional challenges, and objections from Czech civil society, trade unions, and human rights groups. The resolution concluded that Protocol No 30, if interpreted restrictively, would diminish rights protections in affected states and harm the EU’s goal of ensuring equal, visible fundamental rights for all citizens.",
    "total_score": 0.7612732095490716,
    "total_choice": 7,
    "party_num": 2,
    "id": 1,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.6,
      0.4
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "Amendment of the Treaty on the Functioning of the European Union with regard to a stability mechanism for Member States whose currency is the euro: REPORT on the draft European Council decision amending Article 136 of the Treaty on the Functioning of the European Union with regard to a stability mechanism for Member States whose currency is the euro",
    "background": "Eurozone sovereign debt crises prompted temporary financial stability mechanisms (EFSF/EFSM) set to expire in 2013, amid concerns over economic instability and currency sustainability. The Parliament will discuss amending TFEU Article 136 to establish a permanent stability mechanism for euro area Member States.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.8206106870229007,
        "choice": 8,
        "stance": "EPP strongly sanctions the full integration of the European Stability Mechanism into the EU institutional framework, aligning with its commitment to transparency and democratic accountability through Commission oversight and parliamentary scrutiny.  \nEPP approves the issue’s emphasis on favorable lending conditions and back-to-back borrowing costs for ESM beneficiaries, reflecting its priority to prevent unsustainable debt cycles while maintaining fiscal responsibility.  \nEPP endorses the inclusion of all Member States regardless of size in the stability mechanism, ensuring cohesion and rejecting fragmentation risks that contradict the principle of a unified European economic space.  \nEPP proposes enhancing the ESM’s financing structure by incorporating risk-based contributions to incentivize fiscal discipline, aligning with its broader advocacy for sustainable economic governance and preventive measures.  \nEPP emphasizes the necessity of leveraging existing EU institutions like the Commission and ECB, reinforcing its longstanding position that Community methods—not intergovernmental shortcuts—ensure durable crisis-issue frameworks."
      },
      {
        "party_name": "EFD",
        "score": 0.0967741935483871,
        "choice": 0,
        "stance": "EFD fully challenges the integration of the ESM into EU structures as an undemocratic power grab lacking public consent, directly contradicting their sovereignty principles.  \nEFD rejects the issue's economic governance framework for perpetuating the \"disgraceful and fraudulent\" euro system causing mass unemployment in southern Europe.  \nEFD condemns financial bailouts as enabling structural failures in deficit states rather than enforcing German-style fiscal discipline through market mechanisms.  \nEFD disputes all Treaty amendments bypassing national referendums, denouncing this as an \"insult to taxpayers\" funding southern overspending without reform mandates.  \nEFD insists on intergovernmental solutions over EU institutional control, opposing Commission involvement as supranational overreach incompatible with subsidiarity."
      }
    ],
    "resolution": "The European Parliament raised concerns about the establishment of the European Stability Mechanism (ESM) outside the EU institutional framework, stressing the need to integrate it fully into Union structures to ensure transparency, democratic accountability, and the involvement of EU institutions like the Commission, ECB, and European Investment Bank. It emphasized that the ESM must respect EU law, avoid creating parallel governance structures, and align with existing mechanisms such as the Balance-of-Payments Facility (BoP) and Macro-financial Assistance (MFA) in terms of lending conditions, including back-to-back borrowing costs and favorable interest rates. The resolution highlighted the importance of strengthening economic governance, including sustainable growth policies, stricter financial regulation, revision of the Stability and Growth Pact (SGP), and addressing macroeconomic imbalances. It urged exploring enhanced cooperation under Article 20 TEU to involve non-eurozone Member States and called for legislative proposals and Treaty revisions under Article 48(6) TEU or ordinary procedures to formalize the ESM within the EU framework. The Parliament also stressed the need for parliamentary scrutiny at both EU and national levels, particularly during the European Semester, to ensure compliance with economic guidelines and conditionality. Additionally, it advocated for a consolidated Eurobonds market and warned against fragmenting the euro area by excluding smaller economies from the ESM. The resolution reaffirmed the exceptional nature of Article 48(6) TEU revisions and Parliament’s right to demand a Convention for broader institutional reforms.",
    "total_score": 0.6739427012278308,
    "total_choice": 6,
    "party_num": 2,
    "id": 2,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.5,
      0.5
    ],
    "veto_party_name": "EFD"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "Elections to the European Parliament in 2014: MOTION FOR A RESOLUTION on the elections to the European Parliament in 2014",
    "background": "The 2009 Lisbon Treaty's institutional reforms, ongoing Eurozone crisis pressures, and declining voter turnout in prior European Parliament elections framed preparations for the 2014 elections as the first post-Lisbon vote. The Parliament will discuss electoral procedures and measures to strengthen EU governance legitimacy through the 2014 elections.",
    "stances": [
      {
        "party_name": "ALDE",
        "score": 0.5662650602409639,
        "choice": 5,
        "stance": "ALDE supports the issue’s emphasis on linking Commission President elections to parliamentary results, aligning with ALDE’s federalist vision for democratic accountability.  \nALDE advises strengthening provisions for European political parties to organize transnational debates between Commission President candidates, enhancing public engagement.  \nALDE recommends amending gender balance requirements to include binding quotas for Commissioner nominations, ensuring substantive equality over symbolic gestures.  \nALDE highlights concerns about ambiguity in the European Council’s obligation to reflect electoral outcomes, urging stricter adherence to Parliament’s mandate.  \nALDE suggests synchronizing election dates across all member states to amplify media impact and voter participation."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.0,
        "choice": 0,
        "stance": "GUE_NGL rejects the issue's top-down approach to nominating the Commission President, arguing it perpetuates the EU's democratic deficit by prioritizing elite consensus over genuine citizen engagement.  \nGUE_NGL opposes the failure to mandate proportional representation in Member States' electoral systems, asserting that excluding political minorities contradicts fundamental democratic principles.  \nGUE_NGL entirely rejects with the issue's emphasis on presidential personalization, advocating instead for structural reforms that empower grassroots movements and parliamentary accountability.  \nThe proposal overlooks critical aspects of democratic legitimacy by not requiring binding mechanisms to ensure the Commission President reflects electoral outcomes beyond superficial party nominations.  \nGUE_NGL condemns the issue's inadequate measures to address systemic exclusion, reiterating that \"no taxation without representation\" must apply to all EU citizens through equitable political participation."
      }
    ],
    "resolution": "The European Parliament raised the importance of enhancing democratic legitimacy by aligning the election of the Commission President with the outcomes of the European Parliament elections, urging European political parties to nominate candidates for this role and ensure their active participation in electoral campaigns. It emphasized the need for the European Council to propose a Commission President candidate reflecting electoral results, with Parliament electing the President in July 2014 to allow sufficient preparation time for the new Commission to assume office by 1 November 2014. The resolution called for gender balance within the College of Commissioners and requested the Council to consult Parliament on scheduling the 2014 elections for either 15–18 May or 22–25 May. It reiterated the Commission’s accountability to Parliament and stressed the role of European political parties in fostering citizen engagement, while affirming Parliament’s authority to approve the entire Commission following hearings with candidate Commissioners proposed by the Council and President-elect.",
    "total_score": 0.4196547144754316,
    "total_choice": 4,
    "party_num": 2,
    "id": 3,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.6,
      0.4
    ],
    "veto_party_name": "ALDE"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "Composition of the European Parliament with a view to the 2014 elections: REPORT on the composition of the European Parliament with a view to the 2014 elections",
    "background": "The impending 2014 European elections, Croatia's accession to the EU, and the expiration of transitional provisions under Protocol No 36 and the Croatian Accession Act necessitated adjustments to parliamentary seat allocation. The Parliament will discuss establishing a composition framework for the 2014-2019 term, balancing demographic shifts and institutional representation under Treaty obligations.",
    "stances": [
      {
        "party_name": "ECR",
        "score": 0.8,
        "choice": 8,
        "stance": "ECR strongly accepts the pragmatic seat allocation compromise, recognizing its necessity to meet electoral deadlines while maintaining degressive proportionality as required by EU treaties.  \nECR proposes refining future apportionment formulas to better correlate MEP ratios with population size, addressing disparities like the UK-Germany representation gap noted in Article 14(2) TEU implementation.  \nECR emphasizes the urgency of addressing emigration-driven demographic shifts in the 2015 reform package to prevent underrepresentation of states losing populations to intra-EU mobility.  \nECR approves linking Parliament composition reforms to broader Council voting revisions, aligning with their commitment to dual citizen-state representation principles under Article 48(3) TEU.  \nECR highlights the importance of capping seat reductions at one per state as a vital safeguard against destabilizing abrupt changes to national representation."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.20588235294117646,
        "choice": 2,
        "stance": "GUE_NGL rejects the degressive proportionality model as absolutely disputeing with their commitment to equal representation among sovereign EU states, disproportionately penalizing smaller nations like Portugal.  \nGUE_NGL opposes the issue’s failure to address democratic deficits, arguing that reduced seats for medium/small states erode pluralism and distance citizens from EU decision-making.  \nGUE_NGL condemns the rushed adoption process for prioritizing institutional convenience over meaningful public engagement, overlooking citizen skepticism toward EU centralization.  \nGUE_NGL highlights contradictions with subsidiarity principles, noting the issue ignores proposals to strengthen the Committee of the Regions and local governance frameworks.  \nGUE_NGL fundamentally disputes the federalist power balance embedded in the seat allocation, which entrenches large-state dominance in both Parliament and Council."
      }
    ],
    "resolution": "The European Parliament raised the need to establish the composition of the European Parliament for the 2014-2019 term, proposing a decision based on Article 14(2) TEU and accounting for Croatia’s accession, which would adjust seat allocations to reflect demographic changes while ensuring degressive proportionality—where more populous states receive more seats but each member represents more citizens than in less populous states. It emphasized urgency in adopting the decision to allow member states to prepare for the 2014 elections, limiting seat losses to a maximum of one per state to balance adjustments. The resolution committed to proposing a durable, transparent apportionment system by 2015, incorporating objective criteria, demographic trends, and potential transnational lists, to be implemented ahead of the 2019-2024 term. It linked this reform to broader institutional changes, including revising Council voting systems through Treaty revisions under Article 48(3) TEU, stressing the dual representation of citizens and member states as foundational to EU democracy. The Parliament also noted the expiration of Protocol No 36 and Croatia’s accession-related provisions at the end of the 2009-2014 term, underscoring the need for timely action to align institutional frameworks with evolving membership and population dynamics.",
    "total_score": 0.7127659574468085,
    "total_choice": 7,
    "party_num": 2,
    "id": 4,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.6,
      0.4
    ],
    "veto_party_name": "GUE_NGL"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "Conclusions of the informal European Council meeting of 30 January 2012: MOTION FOR A RESOLUTION on the European Council of 30 January 2012",
    "background": "Persistent eurozone debt crisis pressures and divergent national fiscal policies prompted EU leaders to negotiate enhanced economic governance, culminating in the January 2012 European Council's draft Treaty on Stability, Coordination, and Governance. The Parliament will discuss the treaty's implications for fiscal discipline mechanisms, economic policy coordination, and growth strategies within EMU frameworks.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.8111111111111111,
        "choice": 8,
        "stance": "EPP strongly agrees the fiscal treaty's emphasis on budgetary discipline and structural reforms, aligning with their commitment to economic stability and sustainable growth.  \nEPP approves the integration of parliamentary proposals into the treaty framework, particularly upholding the Community method and legal accountability through ECJ oversight.  \nEPP urges accelerated implementation of growth initiatives, including establishing a redemption fund and advancing project bonds to complement fiscal consolidation.  \nEPP emphasizes completing the single market and enforcing existing rules to enhance competitiveness, in line with their economic policy priorities.  \nEPP proposes ensuring full parliamentary participation in euro summit meetings to strengthen democratic oversight while maintaining treaty ratification timelines."
      },
      {
        "party_name": "EFD",
        "score": 0.0,
        "choice": 0,
        "stance": "EFD rejects the Treaty on Stability as a colonial imposition that humiliates sovereign states, directly contradicting Farage’s condemnation of “diplomacy at gunpoint” toward Greece.  \nEFD opposes fiscal integration measures for perpetuating German-dominated austerity, aligning with Tzavela’s warning about a “teenage hegemonist” divide eroding European unity.  \nEFD absolutely disputes with the issue’s growth agenda, citing Farage’s argument that euro membership causes catastrophic unemployment and social desperation.  \nEFD condemns the undemocratic exclusion of parliaments from euro summits, mirroring Tzavela’s criticism of procedures circumventing democratic accountability.  \nEFD disputes the issue’s solidarity claims, highlighting Farage’s and Tzavela’s warnings about resurgent nationalism fueled by EU-imposed economic subjugation."
      }
    ],
    "resolution": "The European Parliament raised concerns over the Treaty on Stability, Coordination, and Governance in the Economic and Monetary Union, reiterating its preference for achieving reforms within existing EU law rather than through an intergovernmental agreement, which was necessitated by the UK Prime Minister’s objection. While acknowledging improvements in the final text, including the incorporation of parliamentary proposals such as upholding the Community method, it noted that key elements like the fiscal \"golden rule,\" reversed qualified majority voting, and ECJ involvement could not be fully realized under current EU frameworks. The resolution emphasized that fiscal stability must be paired with concrete measures to boost sustainable growth, employment, and solidarity, urging rapid establishment of a redemption fund based on the German Economic Council’s proposal, integration of project bonds, a roadmap for stability bonds, and implementation of a European Financial Transaction Tax. It criticized omissions in the treaty, particularly the lack of full parliamentary participation in euro summit meetings, and insisted on integrating the treaty into EU law within five years while addressing remaining weaknesses in the Lisbon Treaty. The Parliament also called for stronger Commission action on growth initiatives and expressed regret over delays in advancing these measures through the \"two-pack\" legislative process.",
    "total_score": 0.589095744680851,
    "total_choice": 5,
    "party_num": 2,
    "id": 5,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.9,
      0.1
    ],
    "veto_party_name": "EFD"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "Control by Member States of the Commission’s exercise of implementing powers: REPORT on the proposal for a regulation of the European Parliament and of the Council laying down the rules and general principles concerning mechanisms for control by Member States of the Commission’s exercise of implementing powers",
    "background": "The Treaty of Lisbon’s entry into force (2009) introduced revised procedures for delegating implementing powers to the Commission under Articles 290 and 291 TFEU, prompting a Commission proposal to replace prior comitology rules with mechanisms aligning Member State oversight. The Parliament will discuss regulatory frameworks for controlling Commission implementing acts.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.8909090909090909,
        "choice": 8,
        "stance": "GREEN_EFA strongly upholds the issue's reinforcement of Member States' oversight mechanisms over Commission implementation, aligning perfectly with their commitment to institutional accountability and Treaty compliance.  \nGREEN_EFA applauds the Belgian Presidency's pivotal role in advancing parliamentary scrutiny rights, which effectively safeguards against potential overreach by the Commission.  \nGREEN_EFA approves the rapporteur's negotiated balance between efficient Commission operations and robust member state control, particularly endorsing permanent investigative provisions under Article 291 TFEU.  \nGREEN_EFA proposes clarifying consultation timelines in Article 4 to strengthen multilateral review processes without opposing the core oversight framework."
      },
      {
        "party_name": "SD",
        "score": 0.7741935483870968,
        "choice": 7,
        "stance": "SD strongly upholds the issue’s alignment with the Lisbon Treaty’s expansion of parliamentary oversight, particularly in commercial policy, as a critical advancement of institutional balance.  \nSD proposes amending Article 4 to introduce a binding cut-off deadline for legacy comitology mechanisms, ensuring full Treaty compliance without indefinite transitional loopholes.  \nSD emphasizes safeguarding the Commission’s autonomy in anti-dumping measures by limiting Member State interventions to procedural oversight, preventing politicization of trade defense instruments.  \nSD approves the issue’s procedural rigor under TFEU Articles 294 and 291 but urges extending consultation timelines to mitigate rushed first-reading adoption risks.  \nSD underscores the necessity of maintaining legal certainty in implementation powers, rejecting regression to pre-Lisbon bargaining dynamics while strengthening Parliament’s supervisory role."
      }
    ],
    "resolution": "The European Parliament raised its position at first reading on the Commission’s 2010 proposal (COM(2010)0083), following consultations with multiple committees including Legal Affairs, Foreign Affairs, Development, International Trade, Economic and Monetary Affairs, Environment, Internal Market, Transport, Regional Development, Agriculture, Fisheries, Civil Liberties, and Constitutional Affairs. The resolution formally adopted Parliament’s stance, urged the Commission to resubmit the proposal if intending to amend it substantially or replace it with an alternative text, and directed its President to forward the position to the Council and Commission to facilitate further legislative steps, ensuring alignment with Treaty obligations under Articles 294 and 291 of the TFEU.",
    "total_score": 0.7703804347826086,
    "total_choice": 7,
    "party_num": 2,
    "id": 6,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.1,
      0.9
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "Forwarding to and handling by the European Parliament of classified information held by the Council on matters other than those in the area of the Common Foreign and Security Policy: REPORT on the conclusion of an interinstitutional agreement between the European Parliament and the Council concerning the forwarding to and handling by the European Parliament of classified information held by the Council on matters other than those in the area of the common foreign and security policy",
    "background": "Existing EU transparency rules and the Parliament’s legislative oversight role under the Lisbon Treaty necessitated structured access to classified Council documents outside foreign and security policy. The Parliament will discuss finalizing an interinstitutional agreement governing the exchange and handling of such classified information between the institutions.",
    "stances": [
      {
        "party_name": "ALDE",
        "score": 0.7831325301204819,
        "choice": 7,
        "stance": "ALDE strongly approves the issue’s foundation in transparency principles, aligning perfectly with ALDE's longstanding commitment to open governance and Article 15 TFEU’s mandate for institutional accountability.  \nALDE approves the codification of parliamentary access rights to classified information as crucial for effective oversight, effectively advancing ALDE’s priority of balancing security protocols with democratic scrutiny.  \nALDE emphasizes the need for future interinstitutional agreements to harmonize document access rules across all EU bodies, ensuring equal transparency standards for the Council, Commission, and Parliament.  \nALDE proposes enhancing the agreement by incorporating a binding commitment in Article 9 to initiate negotiations on extending classified information protocols to Common Foreign and Security Policy matters within 12 months of ratification.  \nALDE applauds the alignment with Regulation 1049/2001’s Articles 2(5) and 9, which reinforce Parliament’s role in scrutinizing EU actions while maintaining confidentiality, as a critical step toward institutional parity."
      },
      {
        "party_name": "SD",
        "score": 0.8115183246073299,
        "choice": 8,
        "stance": "SD strongly advocates the establishment of clear procedures for accessing classified information, aligning perfectly with SD's commitment to institutional transparency under TEU Article 10.  \nSD approves the expanded access for rapporteurs and committee members as vital for fulfilling Parliament’s oversight role, consistent with Regulation 1049/2001’s Article 2(5) principles.  \nSD highlights the agreement’s progress in reducing security clearance requirements for non-CFSP matters as a meaningful enhancement of democratic accountability.  \nSD proposes strengthening future protocols to address CFSP-related information access with equal rigor, ensuring parity in scrutiny mechanisms across policy areas.  \nSD emphasizes that the issue’s balance between confidentiality and parliamentary oversight effectively advances their 2011 transparency demands from paragraph 12."
      }
    ],
    "resolution": "The European Parliament raised the need for enhanced transparency and accountability in handling classified information between EU institutions, emphasizing the importance of public access to documents as enshrined in Regulation (EC) No 1049/2001, particularly Articles 2(5) and 9. It called for an interinstitutional agreement with the Council to establish clear procedures for forwarding and managing classified information on non-common foreign and security policy matters, ensuring Parliament’s right to access such information for effective democratic oversight. The resolution underscored the legal basis provided by the Treaties (TEU Articles 1, 2, 6, 10, 11 and TFEU Articles 15, 295), which mandate openness and institutional balance. It reiterated concerns from its 2011 resolution on public access to documents, specifically paragraph 12, urging alignment of classified information protocols with transparency principles. The Parliament stressed that any agreement must safeguard its role in scrutinizing EU actions while maintaining necessary confidentiality, balancing security requirements with democratic accountability.",
    "total_score": 0.7785145888594165,
    "total_choice": 7,
    "party_num": 2,
    "id": 7,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.3,
      0.7
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "Citizens’ initiative: REPORT on the proposal for a regulation of the European Parliament and of the Council on the citizens' initiative",
    "background": "The Treaty of Lisbon (2009) introduced a citizens’ initiative mechanism under Article 11(4) TEU, enabling EU citizens to request legislative proposals. The European Commission’s 2010 draft regulation aimed to operationalize this provision. The Parliament will discuss establishing procedural rules for the initiative’s implementation, ensuring alignment with treaty obligations and citizen engagement frameworks.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9312977099236641,
        "choice": 9,
        "stance": "EPP totally approves the citizens' initiative as the definitive solution to eliminating the EU's democratic deficit through enhanced participatory democracy mechanisms.  \nEPP perfectly aligns with the issue's emphasis on simplified registration procedures and cross-border signature collection, recognizing these as vital for empowering pan-European civic engagement.  \nEPP champions the mandatory public hearings provision as effectively advancing its priority of institutional transparency and direct citizen-parliament dialogue.  \nEPP commends the strict admissibility criteria framework for ensuring initiatives respect treaty boundaries while maintaining accessibility for legitimate grassroots campaigns.  \nEPP proactively advocates vigilant monitoring against potential political party co-option of initiatives, reinforcing its commitment to preserving this tool exclusively for citizen-driven agendas."
      },
      {
        "party_name": "EFD",
        "score": 0.45161290322580644,
        "choice": 4,
        "stance": "EFD partially endorses the citizens' initiative framework but emphasizes the need to prevent EU institutions from exceeding Treaty mandates.  \nEFD requests revisions to include robust signature verification mechanisms, citing risks of fraudulent submissions undermining democratic legitimacy.  \nEFD highlights concerns that the issue fails to address sufficient safeguards against bureaucratic overreach in the admissibility process.  \nEFD stresses the initiative must remain strictly limited to EU citizens, opposing any expansion to non-citizen participation.  \nEFD notes the proposal's democratic improvements but maintains it remains inconsistent with their principles of national sovereignty in legislative matters."
      }
    ],
    "resolution": "The European Parliament raised its position by adopting the resolution at first reading, emphasizing procedural cooperation with EU institutions and member states. It endorsed the Commission’s original proposal (COM(2010)0119) while urging the Commission to re-engage Parliament if substantial amendments or alternative texts are proposed, ensuring legislative transparency. The resolution highlighted alignment with Treaty provisions, particularly Article 11(4) TEU on participatory democracy and Article 294 TFEU governing the ordinary legislative procedure. It incorporated input from committees, including Constitutional Affairs, Petitions, Culture and Education, and Civil Liberties, reflecting cross-sectoral priorities. Parliament instructed its President to formally transmit its adopted position to the Council, Commission, and national parliaments, reinforcing interinstitutional dialogue and adherence to EU legislative protocols.",
    "total_score": 0.8532608695652174,
    "total_choice": 8,
    "party_num": 2,
    "id": 8,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.4,
      0.6
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "European Parliament's right of inquiry: REPORT on a proposal for a regulation of the European Parliament on the detailed provisions governing the exercise of the European Parliament's right of inquiry  and repealing Decision 95/167/EC, Euratom, ECSC of the European Parliament, the Council and the Commission",
    "background": "The Lisbon Treaty (2009) granted the European Parliament treaty-based authority to establish inquiry committees, but existing rules under a 1995 decision lacked alignment with updated institutional roles. The Parliament will discuss modernizing procedures for committees investigating alleged maladministration in EU law implementation under its supervisory mandate.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.9310344827586207,
        "choice": 9,
        "stance": "GREEN_EFA totally promotes the issue's immediate audit mandate and expenditure reporting requirements, perfectly aligning with their commitment to exposing financial misconduct and ensuring citizen-level accountability.  \nGREEN_EFA perfectly aligns with the independent review panel provision, recognizing its necessity to enforce consequences for non-cooperation and fraud as emphasized in the debate.  \nGREEN_EFA fully supports the centralized transparency portal, effectively advancing their decades-long advocacy for public access to scrutinize EU fund allocation.  \nGREEN_EFA endorses the misused funds reallocation to climate action, reflecting their core principle of prioritizing ecological transition over bureaucratic waste.  \nGREEN_EFA applauds the issue’s streamlined administrative procedures, which mirror their manifesto pledge to eliminate redundant costs while strengthening oversight."
      },
      {
        "party_name": "ECR",
        "score": 0.017543859649122806,
        "choice": 0,
        "stance": "ECR rejects fundamentally the issue's expansion of parliamentary summons and sanction powers as exceeding Treaty limitations on EU competencies.  \nECR opposes the provisions requiring testimony from national civil servants, deeming this incompatible with ministerial accountability to sovereign member state legislatures.  \nThe proposal conflicts with ECR's principle of subsidiarity by prioritizing EU-level scrutiny over national parliamentary oversight of public expenditure.  \nECR highlights the issue's failure to address excessive bureaucratic centralization, contrary to their demand for stricter controls on Brussels institutions rather than member states.  \nThe mandated audit mechanisms overlook ECR's insistence that fraud prevention remain a national competence under Article 325 TFEU."
      }
    ],
    "resolution": "The European Parliament raised concerns over the financial mismanagement and lack of transparency in the allocation of funds under Article 22 of the EU budget, emphasizing the need for stricter oversight mechanisms to prevent misuse of public resources. The resolution called for an immediate audit of all projects funded under Article 22 since 2020, prioritizing those exceeding €5 million, and mandated that member states submit detailed expenditure reports by June 2025. It highlighted that 30% of reviewed projects failed to meet predefined performance indicators, urging the reallocation of unspent or misused funds to climate action and digital transition initiatives. Additionally, the Parliament demanded the establishment of an independent review panel to assess compliance with anti-fraud regulations and recommended reducing administrative costs by 15% by 2027 through streamlined procedures. The resolution also stressed the importance of enhancing public access to project data via a centralized portal to ensure accountability.",
    "total_score": 0.6945169712793734,
    "total_choice": 6,
    "party_num": 2,
    "id": 9,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.9,
      0.1
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "Decision not to convene a Convention for the revision of the Treaties with regard to transitional measures concerning the composition of the European Parliament: RECOMMENDATION on the European Council’s proposal not to convene a Convention for the revision of the Treaties with regard to transitional measures concerning the composition of the European Parliament",
    "background": "The Lisbon Treaty's 2009 entry into force altered European Parliament composition rules, but pre-Treaty June 2009 elections under Nice Treaty provisions resulted in 736 MEPs conflicting with Lisbon’s 751-seat limit. The European Council proposed revising Protocol No. 36 to address transitional membership adjustments. The Parliament will discuss procedural requirements for Treaty amendments regarding EP composition.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.8549618320610687,
        "choice": 8,
        "stance": "EPP strongly advocates the expedited amendment process through an intergovernmental conference, aligning perfectly with their longstanding commitment to efficient EU institutional functionality and democratic legitimacy.  \nEPP approves the transitional measures' swift implementation to ensure full parliamentary representation, effectively advancing their priority of balanced multinational participation in decision-making.  \nEPP applauds the issue's pragmatic alignment with Lisbon Treaty protocols, mirroring their 2009 institutional reform strategies to maintain legislative continuity.  \nEPP proposes future treaty revisions to harmonize electoral procedures across Member States, enhancing predictability while fully endorsing the current limited-scope solution.  \nEPP emphasizes the critical importance of simultaneous MEP integration to uphold the European Parliament's operational credibility and proportional nationality representation."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.0,
        "choice": 0,
        "stance": "GREEN_EFA rejects fundamentally the intergovernmental revision process as a violation of the Treaty requirement for direct election of MEPs, conflicting with their core democratic principles.  \nGREEN_EFA opposes the \"French exception\" allowing appointed parliamentarians, which undermines 31 years of EU suffrage standards central to their legitimacy doctrine.  \nGREEN_EFA condemns the issue's failure to convene a Convention, directly contradicting their constitutionalist stance on participatory Treaty reforms beyond governmental bargaining.  \nGREEN_EFA denounces the acceptance of nationally appointed MEPs as eroding Parliament's credibility and citizens' right to choose representatives through elections.  \nGREEN_EFA highlights the proposal's incompatibility with Article 48(3) TEU procedural safeguards against unilateral Member State interference in electoral integrity."
      }
    ],
    "resolution": "The European Parliament raised support for amending Protocol No 36 on transitional measures under the Lisbon Treaty, which entered into force on 1 December 2009, to address the composition of Parliament. It acknowledged the historical significance of the 2002-2003 Convention drafting the EU Constitution (later integrated into the Lisbon Treaty) and the 1999-2000 Convention drafting the EU Charter of Fundamental Rights, both advancing democratic decision-making. The resolution endorsed the European Council’s proposal to bypass convening a new Convention for this limited-scope amendment, deeming it unnecessary given the transitional nature of the protocol’s provisions. It approved revising the protocol through an intergovernmental conference instead, emphasizing alignment with prior institutional reforms from European Council meetings in 2008-2009. The Parliament instructed its President to communicate this decision to the European Council, Council, Commission, and national parliaments, ensuring procedural continuity under Article 48(3) of the EU Treaty.",
    "total_score": 0.6779891304347826,
    "total_choice": 6,
    "party_num": 2,
    "id": 10,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.3,
      0.7
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "Location of the seats of the European Union's institutions: REPORT on the location of the seats of the European Union’s Institutions",
    "background": "The EU Parliament's seat locations, established by Member States via treaties, involve Strasbourg, Brussels, and Luxembourg, with evolving legislative authority increasing operational demands. Concerns over financial, environmental, and efficiency impacts of multiple locations, alongside citizen petitions, prompted review. The Parliament will discuss institutional seat allocation and self-determination authority regarding its working arrangements.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.4197080291970803,
        "choice": 4,
        "stance": "EPP partly upholds the need for operational efficiency but insists any Treaty revision must precede seat changes, citing Protocol 6's explicit Strasbourg designation as non-negotiable without full intergovernmental consensus.  \nEPP requests revised financial analysis using Parliament Secretariat's verified €51.5 million Strasbourg cost estimates rather than \"unsubstantiated\" €156-204 million figures in the issue.  \nEPP demands removal of petition references until identity-validated signatures meet Article 227 TFEU standards, rejecting the \"1.2 million citizen\" claim as procedurally invalid.  \nEPP requires broader institutional seat review encompassing ECB and CJEU locations before Parliament-specific changes, per Constance Le Grip's polycentrism principle.  \nEPP proposes maintaining Strasbourg's symbolic role through annual plenary sessions if reforms proceed, preserving its status as \"democracy's birthplace\" while reducing logistical burdens."
      },
      {
        "party_name": "ECR",
        "score": 0.8947368421052632,
        "choice": 8,
        "stance": "ECR strongly endorses the issue’s demand to end the Strasbourg seat arrangement, aligning perfectly with ECR’s longstanding commitment to fiscal responsibility and streamlined governance.  \nECR approves the call for Treaty revision under Article 48 TEU, emphasizing how this advances ECR’s priority of institutional accountability and citizen-centric decision-making.  \nECR highlights the environmental urgency of eliminating 19,000 tonnes of CO₂ emissions through a single seat, reinforcing ECR’s environmental stewardship principles.  \nECR proposes accelerating the 2014 Eurobarometer survey deadline to expedite public mandate validation, enhancing democratic transparency without opposing the issue’s core aims.  \nECR applauds the issue’s alignment with citizen demands for cost-efficiency, mirroring ECR’s manifesto pledge to combat bureaucratic waste in EU structures."
      }
    ],
    "resolution": "The European Parliament raised concerns about the inefficiency, high costs, and environmental impact of maintaining three separate workplaces in Strasbourg, Brussels, and Luxembourg, as mandated by Protocol 6 of the EU Treaties. It highlighted annual costs between €156 million and €204 million (10% of its budget) and CO₂ emissions of 11,000–19,000 tonnes due to monthly relocations, with Strasbourg’s buildings unused 89% of the year. Emphasizing its evolution into a co-legislator with increased legislative activity (454 ordinary procedures in 2004–2009 versus 165 in 1993–1999), Parliament argued that its dispersion isolates it from other EU institutions and stakeholders, undermining efficiency and transparency. It noted strong public opposition, including a petition signed by over one million citizens, and a 2012 plenary vote where 78% of MEPs supported revising the seat arrangement. Parliament called for a Treaty revision under Article 48 TEU to amend Article 341 TFEU and Protocol 6, enabling it to determine its own seat and working arrangements. It requested independent analyses of potential savings from a single seat (Brussels) and a Eurobarometer survey by 2014 on citizens’ views, while acknowledging the need for orderly transition and continued use of existing buildings. The resolution stressed the urgency of addressing this issue during the financial crisis and reaffirmed Parliament’s commitment to cost-efficiency, environmental responsibility, and democratic accountability.",
    "total_score": 0.6305483028720626,
    "total_choice": 6,
    "party_num": 2,
    "id": 11,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.2,
      0.8
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "Report: Elmar Brok - The institutional aspects of setting up the European External Action Service\non the institutional aspects of setting up the European External Action Service: REPORT on the institutional aspects of setting up the European External Action Service",
    "background": "The European Union's expanding global role and the Treaty of Lisbon's provisions for a unified external action framework, following its ratification process including the 2009 Irish referendum, necessitated institutional reforms. The Parliament will discuss establishing the European External Action Service to enhance diplomatic coherence and operational efficiency under the treaty's legal structure.",
    "stances": [
      {
        "party_name": "ALDE",
        "score": 0.8214285714285714,
        "choice": 8,
        "stance": "ALDE strongly agrees the establishment of the EEAS as a transformative tool for EU foreign policy coherence, aligning perfectly with ALDE's commitment to supranational efficiency and global strategic influence through integrated diplomatic structures.  \nALDE approves the EEAS's hybrid accountability framework under the Commission's administrative oversight, emphasizing its critical role in maintaining parliamentary scrutiny and financial transparency as outlined in Articles 18 and 27 of the Treaty on European Union.  \nALDE endorses the issue's call for a European diplomatic college, proposing enhanced collaboration with national foreign ministries to standardize training in consular procedures and crisis management while preserving member states' operational flexibility.  \nALDE emphasizes the need to prioritize soft security mechanisms within the EEAS mandate, advocating for explicit integration of development cooperation and humanitarian aid as core instruments to advance the EU's peacebuilding objectives globally.  \nALDE highlights the importance of equitable staffing practices in EEAS delegations, urging proactive measures to ensure smaller member states' diplomatic expertise informs decision-making without compromising operational cohesion."
      },
      {
        "party_name": "ECR",
        "score": 0.037037037037037035,
        "choice": 0,
        "stance": "ECR rejects the establishment of a European diplomatic college as fiscally irresponsible and incompatible with national sovereignty, absolutely doubting with ECR's principle of resisting EU power consolidation over member states' foreign policy prerogatives.  \nECR opposes fundamentally the EEAS mission nomenclature proposals, demanding explicit rejection of \"embassies\" terminology which contradicts ECR's red line against EU state-like attributes in international affairs.  \nThe proposal overlooks critical aspects of intergovernmental accountability by seeking Commission-aligned structures rather than maintaining strict Council authority over EEAS operations, violating ECR's anti-federalist governance model.  \nECR challenges the issue's assumption of CFSP unanimity erosion, opposing any EEAS evolution that could bypass member states' veto rights under Article 24 TEU through bureaucratic practice.  \nThe budgetary provisions for EEAS institutional growth directly conflict with ECR's fiscal conservatism, demanding strict reliance on seconded national diplomats rather than creating permanent EU diplomatic corps."
      }
    ],
    "resolution": "The European Parliament raised the need for a coherent, consistent, and efficient EU foreign policy through the establishment of the European External Action Service (EEAS) under the Lisbon Treaty, emphasizing its role in enhancing the EU’s global visibility, avoiding duplication of resources, and strengthening partnerships with developing nations. The resolution highlighted the EEAS’s legal basis in Articles 18, 27, and 40 of the Treaty on European Union, stressing its sui generis structure as integrated into the Commission’s administrative framework while remaining accountable to both the Council in foreign policy matters and the Commission in external relations. It called for the EEAS to ensure alignment with the Charter of Fundamental Rights and consistency across EU policies under Article 21(3) of the Treaty, while EU delegations in third countries should operate under the authority of the High Representative/Vice-President (VP/HR) and provide logistical support to EU institutions. The Parliament urged the VP/HR to engage with parliamentary committees on senior EEAS appointments, renegotiate interinstitutional agreements for transparency and access to sensitive information, and establish a European diplomatic college to standardize training in diplomacy, consular procedures, and EU affairs. It emphasized a gradual, experience-based evolution of the EEAS, backed by a review clause to ensure fair representation of member states and avoid inefficiencies, while welcoming the Lisbon Treaty’s institutional reforms, including the VP/HR’s role in leading the EU’s Common Foreign and Security Policy (CFSP).",
    "total_score": 0.5760869565217391,
    "total_choice": 5,
    "party_num": 2,
    "id": 12,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.7,
      0.3
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "Interinstitutional agreement on budgetary discipline, on cooperation in budgetary matters and on sound financial management: REPORT on conclusion of an interinstitutional agreement between the European Parliament, the Council and the Commission on budgetary discipline, on cooperation in budgetary matters and on sound financial management",
    "background": "Following the Treaty of Lisbon's expanded budgetary role for the European Parliament and protracted 2013 negotiations on the 2014-2020 Multiannual Financial Framework, including European Council agreements amid post-crisis fiscal constraints, the Parliament will discuss formalizing interinstitutional arrangements for budgetary governance, cooperation mechanisms, and compliance with EU financial regulations.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9051094890510949,
        "choice": 9,
        "stance": "EPP absolutely promotes the interinstitutional agreement as the only viable path forward under exceptional circumstances, perfectly aligning with their commitment to EU stability through guaranteed 2013 payments and continuity of cohesion policies.  \nEPP emphasizes the critical achievement of launching the high-level group on own resources, proposing strengthened financial autonomy mechanisms to address future crises while maintaining current budgetary discipline.  \nEPP highlights the issue's enhanced flexibility provisions between commitment appropriations and payment ceilings as essential for efficient crisis response, matching their manifesto priorities for adaptive governance.  \nEPP recognizes the mid-term review clause as pivotal for future-proofing EU finances, urging accelerated timelines for reforming revenue streams to prevent structural deficits in Treaty-implemented policies.  \nEPP applauds the preservation of key investment programs like Horizon 2020 and Erasmus+ within constrained parameters, aligning perfectly with their innovation-driven growth agenda despite overall MFF reductions."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.0,
        "choice": 0,
        "stance": "GUE_NGL entirely conflicts the agreement as it entrenches austerity policies through structural fund cuts, directly contradicting their mandate to combat economic inequality.  \nGUE_NGL rejects the MFF's nominal budget reduction as incompatible with urgent crisis recovery needs, particularly denouncing disproportionate impacts on cohesion funding.  \nThis proposal overlooks critical aspects of democratic accountability by codifying the European Council's overreach into legislative budgetary matters.  \nGUE_NGL condemns the issue's failure to reverse binding austerity criteria imposed through European Council conclusions, perpetuating harmful macroeconomic conditionality.  \nThe agreement's institutionalization of growth-stifling financial constraints fully conflicts with GUE_NGL's anti-austerity platform and EU solidarity principles."
      }
    ],
    "resolution": "The European Parliament raised acceptance of the political agreement on the Multiannual Financial Framework (MFF) 2014-2020 and a new interinstitutional agreement aimed at enhancing budgetary discipline, flexibility, and cooperation, while criticizing the unsatisfactory implementation of Treaty of Lisbon provisions that granted Parliament greater budgetary and legislative powers. It denounced the Council’s reliance on binding European Council conclusions from February 2013, which imposed constraints on negotiations, including detailed program allocations and financial criteria under the ordinary legislative procedure, thereby undermining Parliament’s role. The resolution expressed regret that years of interinstitutional dialogue failed to influence the Council’s approach or separate legislative and budgetary aspects of the MFF. It concluded that future MFF negotiations require revised working arrangements under Article 312(5) TFEU to ensure full respect for Parliament’s prerogatives, prevent the European Council from overstepping its non-legislative role, and guarantee transparent, democratic processes. Parliament tasked its Committees on Budgets and Constitutional Affairs to propose reforms ahead of the 2016 post-electoral MFF revision, emphasizing the need to address institutional imbalances and strengthen procedural integrity in budget-setting.",
    "total_score": 0.7271540469973891,
    "total_choice": 7,
    "party_num": 2,
    "id": 13,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.8,
      0.2
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "Interinstitutional agreement on the transparency register: REPORT on the modification of the interinstitutional agreement on the Transparency Register",
    "background": "The European Parliament previously established a voluntary Transparency Register (2011) under EU treaty obligations for institutional dialogue transparency, amid concerns over lobbying influence gaps and inconsistent sector participation. The Parliament will discuss revising the interinstitutional agreement to strengthen the register’s framework for monitoring interest representation in EU policy-making.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.8357664233576643,
        "choice": 8,
        "stance": "EPP strongly promotes the mandatory disclosure requirements for lobbyists and law firms, aligning perfectly with their commitment to eradicating opaque influence in EU policymaking.  \nEPP applauds the issue’s balance between safeguarding lawyer-client confidentiality and ensuring transparency, a principle consistent with their advocacy for rule-of-law frameworks.  \nEPP endorses the incentivization of registered lobbyists through prioritized access, reinforcing their stance that compliance should yield tangible benefits.  \nEPP proposes extending transparency scrutiny to NGOs’ funding sources, ensuring alignment with the issue’s goal of holistic accountability beyond direct lobbying actors.  \nEPP emphasizes the constructive role of transparent stakeholder engagement in refining legislation, as exemplified by successful dialogues on data protection reforms."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.8,
        "choice": 8,
        "stance": "GUE/NGL strongly approves the issue's mandate for full client disclosure by law firms and lobbyists, aligning with their commitment to exposing corporate influence in EU policymaking.  \nGUE/NGL proposes strengthening Article 4 by making the Transparency Register mandatory rather than voluntary, citing risks of unchecked corporate lobbying demonstrated by the financial sector’s 120 million euro annual expenditure.  \nGUE/NGL applauds restrictions on former MEPs lobbying access as critical to preventing institutional capture, a principle consistent with their anti-corruption agenda.  \nGUE/NGL emphasizes the urgency of binding legislation under Article 352 TFEU to close loopholes allowing national rules to undermine transparency, reflecting their demand for enforceable safeguards.  \nGUE/NGL highlights the need for strict verification mechanisms to match the issue’s goals, noting current gaps in tracking lobbying impacts on financial regulation and speculative risks."
      }
    ],
    "resolution": "The European Parliament raised concerns over the lack of a mandatory Transparency Register for lobbying activities at EU institutions, reiterating its longstanding call for compulsory registration as outlined in its 2008 resolution and 2011 decision. While acknowledging the partial progress of proposed modifications to the 2011 Agreement, it urged the Commission to propose binding legislation by the end of 2016 under Article 352 TFEU and to seek treaty reforms enabling a mandatory register via ordinary legislative procedures. The resolution emphasized enhancing transparency by requiring law firms and lobbyists to disclose all clients linked to EU policy activities, clarifying exceptions for legal professions, and addressing potential abuses of national rules obstructing transparency. It called for robust civil society involvement in future reviews, a public consultation before the next review, and a comprehensive evaluation by 2017. The Parliament welcomed the Council’s observer role but pressed for its full participation in the Register, alongside improved Secretariat resources to verify data, handle complaints, and implement incentives for registration. It endorsed measures to prevent conflicts of interest, including banning MEPs from external funding for staff and restricting former MEPs’ access to parliamentary premises when lobbying. Annual progress reports on the Register’s coverage and enforcement were mandated, with final approval of the modified Agreement and its publication in the Official Journal.",
    "total_score": 0.8433420365535248,
    "total_choice": 8,
    "party_num": 2,
    "id": 14,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.4,
      0.6
    ],
    "veto_party_name": "GUE_NGL"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "Political parties at European level and rules regarding their funding: REPORT on the application of Regulation (EC) No 2004/2003 on the regulations governing political parties at European level and the rules regarding their funding",
    "background": "The Treaty of Lisbon and EU regulations established legal frameworks for European political parties' role in integration and funding mechanisms, with subsequent amendments addressing foundations. The Parliament will discuss regulatory reforms to enhance transparency, operational autonomy, and funding structures for EU-level political parties and affiliated foundations under existing treaties.",
    "stances": [
      {
        "party_name": "SD",
        "score": 0.9510869565217391,
        "choice": 9,
        "stance": "SD fully approves the issue's call for a common EU legal statute for political parties, which perfectly aligns with SD's commitment to fortifying transnational democratic structures and ensuring parties can effectively channel citizen aspirations into EU governance.  \nSD perfectly aligns with the proposal to streamline funding procedures and reduce bureaucratic hurdles, as this advances SD's priority of empowering European parties to foster integration and amplify citizen engagement through direct membership and transparent operations.  \nSD fully approves raising donation limits with transparency safeguards, recognizing this as critical to enhancing financial autonomy while maintaining accountability—a balance central to SD’s vision of resilient, citizen-driven European democracy.  \nSD perfectly supports abolishing self-financing requirements for foundations and lowering them for parties, as this directly addresses structural inequities and reinforces SD’s longstanding advocacy for equitable political participation across all EU levels.  \nSD unequivocally backs permitting parties to engage in EU-related referendum campaigns, seeing this as essential to SD’s goal of deepening democratic responsiveness and ensuring EU policies reflect grassroots political will."
      },
      {
        "party_name": "ECR",
        "score": 0.037037037037037035,
        "choice": 0,
        "stance": "ECR rejects the creation of transnational parties through EU legal statutes, asserting that artificial supranational structures cannot replace organic national political identities rooted in sovereign demoi.  \nECR opposes allowing EU-funded parties to intervene in national referendum campaigns, viewing this as an erosion of Member State autonomy over domestic democratic processes.  \nECR entirely challenges with proposals to increase taxpayer funding for European parties, condemning budget expansions amid national austerity measures as fiscally irresponsible.  \nECR rejects lowering self-financing requirements for parties, arguing this entrenches reliance on EU institutions rather than fostering genuine citizen-led financial support.  \nThe proposal overlooks critical aspects of subsidiarity, contradicting ECR's core principle that democratic legitimacy flows exclusively from nation-states, not EU-level bureaucracies."
      }
    ],
    "resolution": "The European Parliament raised the need to strengthen the role of European political parties and their foundations as vital instruments of EU democracy, emphasizing their role in shaping political will, fostering integration, and enhancing citizen engagement. It highlighted the 2007 amending Regulation, which enabled funding for election campaigns (excluding direct support to national parties) and sought organizational convergence between parties and foundations while preserving their autonomy. The resolution noted structural challenges, including excessive administrative costs (50% of budgets for parties, 40% for foundations) and limited financial autonomy, with less than 5% of party income from individual donations. It called for a common EU legal statute to grant parties direct legal personality, streamline funding procedures, and reduce bureaucratic hurdles, proposing full upfront annual funding (100% instead of 80%) and lowering self-financing requirements to 10% of total budgets for parties (abolishing it for foundations). The Parliament urged raising donation limits to €25,000 per donor annually (with transparency safeguards), allowing parties to engage in EU-related referendum campaigns, and encouraging direct individual membership. It stressed the need for sanctions for funding violations and requested the Commission to propose a tailored Financial Regulation title for party funding, alongside transnational electoral reforms. The resolution also emphasized aligning party operations across regional, national, and EU levels to strengthen democratic accountability and responsiveness.",
    "total_score": 0.7629427792915532,
    "total_choice": 7,
    "party_num": 2,
    "id": 15,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.8,
      0.2
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "Practical arrangements for the holding of the European elections in 2014: REPORT on improving the practical arrangements for the holding of the European elections in 2014",
    "background": "The 2014 European elections, the first post-Lisbon Treaty granting Parliament enhanced powers over Commission appointments, faced declining voter turnout, fragmented national campaign frameworks, and limited visibility of EU political parties. The Parliament will discuss measures to strengthen electoral transparency, pan-European political engagement, and institutional legitimacy ahead of the elections.",
    "stances": [
      {
        "party_name": "ALDE",
        "score": 0.8048780487804879,
        "choice": 8,
        "stance": "ALDE strongly endorses the inclusion of European party affiliations and emblems on ballots, aligning perfectly with ALDE's longstanding commitment to enhancing transnational political identity and voter awareness of pan-European policymaking.  \nALDE approves the mandate for early designation of Commission President candidates, effectively advancing ALDE's priority to elevate European issues over national narratives in election campaigns.  \nALDE endorses gender-balanced candidate lists as a critical step toward ensuring the majority of Europe's population sees its interests represented, mirroring ALDE's 2014 manifesto pledges on equality.  \nALDE proposes strengthening future electoral frameworks by revisiting transnational lists in subsequent reforms, noting their absence as a missed opportunity for deeper political integration.  \nALDE applauds the issue's voter turnout measures and synchronized result announcements, which directly correlate with ALDE's institutional transparency objectives."
      },
      {
        "party_name": "ECR",
        "score": 0.017543859649122806,
        "choice": 0,
        "stance": "ECR rejects the issue's European party affiliation mandates as reinforcing centralized power structures that prioritize financial institutions over national sovereignty.  \nECR opposes fundamentally the Commission President selection mechanism, viewing it as legitimizing anti-austerity policies that have economically devastated member states like Italy and Greece.  \nECR condemns the issue's \"European dimension\" focus as contradictory to citizens' demands to reclaim decision-making from Brussels-based technocratic elites.  \nECR argues the transparency measures fail to address systemic EU failures evidenced by Italy's disproportionate net contributions and misrepresentation in EU narratives.  \nThis fully challenges with ECR's position that true democratic legitimacy requires dismantling supranational frameworks rather than expanding Parliament's role post-Lisbon."
      }
    ],
    "resolution": "The European Parliament raised the need to enhance the transparency, democratic legitimacy, and European dimension of the 2014 elections, emphasizing their significance as the first post-Lisbon Treaty elections, which expanded Parliament’s role in electing the Commission President. It called on political parties to publicly announce candidates at least six weeks before polling (22-25 May 2014), ensure gender-balanced candidate lists, and display European party affiliations and emblems on ballots. The resolution urged European parties to nominate Commission presidential candidates early to enable EU-wide campaigns focused on European issues and to hold public debates between candidates. It stressed the importance of democratic candidate selection processes, encouraged national parties to inform voters about their European affiliations and support for Commission candidates, and recommended measures to assist EU citizens voting or standing in other Member States. Parliament urged Member States to boost voter turnout through public campaigns, avoid premature result announcements until all polls closed on 25 May, and align Commission President consultations between Parliament and the European Council. It proposed that the candidate from the European party winning the most seats should be prioritized for securing an absolute parliamentary majority, aiming to strengthen the link between election outcomes and EU leadership.",
    "total_score": 0.6627450980392157,
    "total_choice": 6,
    "party_num": 2,
    "id": 16,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.3,
      0.7
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "Preparations for the European Council meeting (17 June 2010)-Economic governance: MOTION FOR A RESOLUTION on EU economic governance",
    "background": "Following the 2009 global financial crisis, EU member states faced rising public debt, fiscal imbalances, and market instability, prompting the European Council to initiate deficit reduction procedures and emphasize structural reforms. The Parliament will discuss reforms to EU economic governance frameworks addressing fiscal coordination and crisis response mechanisms.",
    "stances": [
      {
        "party_name": "SD",
        "score": 0.8978494623655914,
        "choice": 8,
        "stance": "SD strongly accepts the EU Recovery Plan's focus on mobilizing 1% of GDP annually for sustainable investments, aligning perfectly with SD's longstanding commitment to green industries and social welfare as pathways to equitable growth.  \nSD approves the proposed Financial Transaction Tax and EU bonds as critical tools to fund social protections, emphasizing their alignment with SD's 2010 manifesto priorities for taxing speculative capital.  \nSD advocates transforming the Stability and Growth Pact into an Employment and Sustainable Development Pact, mirroring Schulz's call to prioritize solidarity over fiscal rigidity in economic governance.  \nSD highlights the urgency of banning naked short selling and regulating rating agencies as enhancement opportunities to strengthen the issue's financial market reforms.  \nSD proposes establishing a European credit rating agency to counter external speculative assessments while maintaining full support for the issue's core mechanisms."
      },
      {
        "party_name": "ECR",
        "score": 0.037037037037037035,
        "choice": 0,
        "stance": "ECR rejects fundamentally the EU Recovery Plan's centralized financial mechanisms as contradictory to member state fiscal sovereignty.  \nECR opposes the proposed Financial Transaction Tax and EU bonds, viewing them as excessive EU-level intervention inconsistent with subsidiarity principles.  \nECR highlights the issue's failure to address Lisbon Strategy failures before launching new programs, mirroring past ineffective \"grand schemes\".  \nECR condemns restructuring the Stability Pact as regulatory overreach that duplicates existing Member State recovery efforts.  \nECR disputes the €500 billion stabilization mechanism as creating dangerous moral hazard through non-conditional transfers."
      }
    ],
    "resolution": "The European Parliament raised concerns that the EU’s post-2009 austerity-driven \"exit strategy,\" mandating deficit cuts below 3% of GDP by 2013/14, risks deepening economic stagnation by undermining social protections, wages, and public investment, thereby reducing demand and tax revenues. It criticized the prioritization of fiscal consolidation and structural reforms, which exacerbate deflationary pressures and social inequality while failing to address public debt, projected to reach 84% of GDP in 2011. The resolution advocated for a three-to-five-year EU Recovery Plan mobilizing 1% of EU GDP annually (approximately €130 billion) to invest in sustainable sectors like renewable energy, public services, green industries, and social welfare, aiming to create decent jobs and combat poverty. It proposed financing this through a Financial Transaction Tax (0.1% rate, generating €262 billion annually), common EU bonds, bank levies, and taxes on capital gains and high incomes, while opposing IMF-style austerity conditions tied to financial assistance. The Parliament urged restructuring the Stability and Growth Pact into an Employment and Sustainable Development Pact, reforming the ECB to prioritize full employment and sustainability, and establishing a €500 billion EU stabilization mechanism without punitive conditionality. Additional measures included tighter financial regulation, bans on speculative practices, public control of banking sectors, and treaty changes to abandon monetarist policies in favor of equitable, growth-oriented governance.",
    "total_score": 0.688858695652174,
    "total_choice": 6,
    "party_num": 2,
    "id": 17,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.6,
      0.4
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "Preparations for the European Council meeting (19 - 20 December 2013): MOTION FOR A RESOLUTION on preparations for the European Council meeting (19-20 December 2013)",
    "background": "Ongoing Eurozone financial instability prompted structural reforms and new economic governance frameworks, while geopolitical shifts including US strategic reorientation and emerging security threats near EU borders highlighted defense capability gaps. The Parliament will discuss completing Banking Union mechanisms, improving economic policy coordination, and strengthening collective defense systems through industrial cooperation.",
    "stances": [
      {
        "party_name": "EFD",
        "score": 0.03225806451612903,
        "choice": 0,
        "stance": "EFD opposes fundamentally the Banking Union's centralization of financial authority as incompatible with national sovereignty, directly contradicting EFD's principle of independent economic governance.  \nEFD rejects the issue's military integration proposals, asserting that permanent structured cooperation undermines national defence autonomy and risks entanglement in EU-led conflicts.  \nEFD opposes the open borders framework implicit in EMU reforms, demanding instead Australia-style immigration controls to prevent welfare system exploitation as outlined in Article 48.  \nEFD condemns the issue's tacit support for EU expansion to Ukraine and Turkey, which Farage explicitly identified as threatening British labour markets and cultural cohesion.  \nEFD criticizes the \"convergence partnership\" funding model for perpetuating EU budget overreach, failing to address youth unemployment through genuine tax reforms for SMEs as Paksas advocated."
      },
      {
        "party_name": "SD",
        "score": 0.7783505154639175,
        "choice": 7,
        "stance": "SD strongly endorses the Banking Union completion, proposing accelerated timelines for the Single Resolution Fund's full capitalization to address concerns about delayed implementation.  \nSD approves EMU reform targets but urges binding social convergence indicators to prevent austerity-driven policies conflicting with issue goals.  \nSD endorses permanent structured defence cooperation, recommending accelerated CSDP integration through Article 44 implementation before 2015 review deadlines.  \nSD aligns with social investment priorities, advocating reallocation of bank fines to Youth Guarantee programs as raised in debate critiques of unemployment.  \nSD emphasizes democratic oversight in Banking Union governance, requiring parliamentary scrutiny of issue mechanisms to enhance legitimacy."
      }
    ],
    "resolution": "The European Parliament raised the need to finalize the Banking Union by establishing the Single Resolution Mechanism and concluding negotiations on the Deposit Guarantee Directive and recovery framework by the end of 2013. It emphasized deepening the Economic and Monetary Union (EMU) through enhanced economic policy coordination, including legislative preparation of \"convergence guidelines\" with urgent reform targets, adoption of national reform programs by member states’ parliaments, and conditional funding via \"convergence partnerships\" integrated into the EU budget outside multiannual financial framework ceilings. The resolution stressed integrating the Treaty on Stability, Coordination and Governance into EU law by 1 January 2018 and ensuring EMU reforms promote unity, inclusivity for non-euro states, and adherence to EU law. On defence, it called for strategic autonomy amid geopolitical shifts, addressing uncoordinated defence spending cuts, and accelerating cooperation through Common Security and Defence Policy (CSDP) reforms, including permanent structured cooperation, enhanced defence industrial coordination, a \"European Semester\" for defence planning, and leveraging EU instruments like the European Defence Agency. It urged implementing Lisbon Treaty tools, adopting a strategic roadmap (White Book), and reviewing progress by December 2015 based on 2013 Council conclusions. The resolution highlighted the EU’s comprehensive approach to crisis management and supported creating a Council of Defence Ministers to strengthen policy coherence.",
    "total_score": 0.5543905635648755,
    "total_choice": 5,
    "party_num": 2,
    "id": 18,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.2,
      0.8
    ],
    "veto_party_name": "EFD"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "Preparations for the European Council meeting (27-28 June 2013) - Democratic decision making in the future EMU: MOTION FOR A RESOLUTION on strengthening European democracy in the future EMU",
    "background": "Persistent eurozone instability, high youth unemployment, and fragmented banking systems underscored institutional challenges in Economic and Monetary Union governance, prompting calls for enhanced structural reforms and economic policy coordination. The Parliament will discuss reinforcing democratic accountability and institutional frameworks within the EMU to address crisis response and integration sustainability.",
    "stances": [
      {
        "party_name": "EFD",
        "score": 0.06451612903225806,
        "choice": 0,
        "stance": "EFD rejects the issue's Community method governance model, citing the EMU's structural flaws in causing mass unemployment and business closures across Southern Europe.  \nEFD opposes Banking Union integration proposals, arguing they perpetuate austerity policies that prevent tax reductions critical for enterprise survival.  \nThe proposal totally conflicts with EFD's demand for production protection mechanisms against \"unfair third-country competition\" destroying industrial bases.  \nEFD condemns the issue's failure to address immigration's strain on labor markets, directly contradicting their stance against admitting workers amid 26 million unemployed.  \nThis overlooks EFD's core principle that EMU architecture itself caused the crisis, requiring full redesign rather than \"undemocratic centralization\" through ESM integration."
      },
      {
        "party_name": "ALDE",
        "score": 0.8433734939759037,
        "choice": 8,
        "stance": "ALDE strongly supports the issue’s insistence on advancing the Banking Union as the priority of priorities, emphasizing that only a European issue mechanism under Commission control—not national authorities—can restore financial stability and unblock credit for SMEs.  \nALDE fundamentally accepts the demand to integrate the fiscal compact into EU law within five years, aligning with their commitment to binding economic governance through the Community method rather than intergovernmental shortcuts.  \nALDE applauds the call to integrate the ESM into the EU legal framework under democratic scrutiny, reinforcing their stance that eurozone stability mechanisms must be subject to parliamentary oversight to ensure accountability.  \nALDE urges accelerating the Commission’s 2012 EMU Blueprint implementation, proposing a concrete timeline for legislative action to prevent further delays criticized by Mr. Verhofstadt as \"standstill\" in EU decision-making.  \nALDE emphasizes enhancing the European Semester’s social pillar, suggesting explicit linkage to youth employment programs to address stagnation risks while maintaining strict alignment with the issue’s convergence code principles."
      }
    ],
    "resolution": "The European Parliament raised concerns over the Council’s lack of ambition and delays in advancing the Economic and Monetary Union (EMU), criticizing national electoral cycles for undermining EU decision-making autonomy and repeated postponements of decisions on EMU architecture. It emphasized the need for democratic accountability, insisting the EMU must be governed via the Community method with full involvement of EU institutions, rejecting intergovernmental approaches and demanding the European Council cease bypassing the Commission’s Treaty-based roles. The resolution called for urgent legislative action to implement the Commission’s 2012 EMU Blueprint, integrate the fiscal compact into EU law within five years, and establish a Banking Union to address financial fragmentation. It stressed the importance of a convergence code under the European Semester, aligned with the Europe 2020 strategy and including a social pillar, supported by incentive-based mechanisms. Parliament demanded the European Stability Mechanism (ESM) be integrated into the EU legal framework under democratic scrutiny, alongside accountability for the EU’s role in the ‘troika’. It reiterated the euro’s status as the Union’s currency and Parliament’s central role in oversight, insisting new EU competences require corresponding democratic control. Finally, it urged the Commission to propose an interinstitutional agreement for Parliament’s involvement in approving the annual growth survey and economic policy guidelines.",
    "total_score": 0.7002652519893899,
    "total_choice": 7,
    "party_num": 2,
    "id": 19,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.4,
      0.6
    ],
    "veto_party_name": "EFD"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "Preparations for the European Council meeting (27-28 June 2013) - European action to combat youth unemployment: JOINT MOTION FOR A RESOLUTION on preparations for the European Council meeting (27-28 June 2013) – European action to combat youth unemployment",
    "background": "By mid-2013, EU youth unemployment exceeded 23%, with over 8 million NEETs and significant economic losses linked to labor market disengagement. Disparities between member states (7.5% in Germany vs. 62.5% in Greece) and sectoral labor shortages persisted despite prior initiatives like the 2011 Youth Opportunities Initiative and 2013 Youth Guarantee recommendations. The Parliament will discuss coordinated EU measures to address youth unemployment and labor market integration.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.9482758620689655,
        "choice": 9,
        "stance": "GREEN_EFA absolutely promotes the issue's emphasis on reversing austerity-driven education cuts, perfectly aligning with their commitment to social investment over fiscal consolidation in youth programs.  \nGREEN_EFA perfectly aligns with the demand for EU-wide social indicators, recognizing this as essential to prevent democratic backsliding like the Greek public broadcasting shutdown they condemned.  \nGREEN_EFA absolutely promotes frontloading Youth Employment Initiative funds, mirroring their urgent calls to address southern Europe's 50%+ youth unemployment through immediate liquidity injections.  \nGREEN_EFA strongly endorses the issue's dual vocational training focus, seeing this as critical to realizing their Green New Deal job creation targets in ICT and renewable sectors.  \nGREEN_EFA perfectly aligns with leveraging €60 billion EIB financing for SMEs, directly advancing their advocacy for crowd funding reforms and ethical banking structures."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.0,
        "choice": 0,
        "stance": "GUE_NGL opposes fundamentally the Youth Employment Initiative's underfunding, citing the ILO's €21 billion minimum requirement as starkly contrasting with the issue's inadequate €6 billion allocation.  \nGUE_NGL rejects austerity-driven policies embedded in the issue, condemning their alignment with Troika-mandated cuts that exacerbate poverty and social exclusion, as evidenced by Greece's public sector dismantling.  \nGUE_NGL highlights the issue's failure to address democratic erosion, exemplified by the Council's exclusion of parliamentary oversight and unchecked expansion of intergovernmental power structures.  \nGUE_NGL condemns the hypocrisy of promoting \"quality frameworks\" while endorsing wage-dumping mechanisms like Germany's low-wage labor market, directly contradicting social progress clauses.  \nGUE_NGL dismisses the issue's reliance on private-sector partnerships as a diversion from demanding public investment in job creation and reversing austerity's devastation."
      }
    ],
    "resolution": "The European Parliament raised concerns over alarming youth unemployment rates in the EU, citing 23.5% overall unemployment (with extremes like 62.5% in Greece and 56.4% in Spain) and 8.3 million young people not in employment, education, or training (NEETs), risking a \"lost generation.\" It highlighted the economic cost of youth disengagement, estimated at €153 billion (1.2% of EU GDP) in 2011, and stressed the need for urgent action to address disparities between Member States. The resolution emphasized education and vocational training reforms, particularly dual systems combining academic and practical skills, as critical to improving employability in growing sectors like ICT, green jobs, and healthcare. It endorsed the Youth Guarantee, urging swift implementation to ensure under-25s and recent graduates under 30 receive employment, education, or apprenticeship offers within four months of unemployment or leaving education, while stressing the need for quality frameworks to safeguard working conditions and wages. Financial measures included allocating €6 billion for the Youth Employment Initiative, advocating frontloading funds, and revising the Multiannual Financial Framework to meet the International Labour Organisation’s €21 billion estimate for eurozone implementation. It called for leveraging the European Social Fund (at least 25% of cohesion policy funds), €60 billion from the European Investment Bank, and €16 billion in reallocated structural funds to support youth employment and SMEs. The resolution urged Member States to combat school dropouts (15% leaving without secondary qualifications), promote partnerships between education and businesses, and enhance mobility while addressing brain drain risks. It criticized austerity cuts to education and youth programs, advocating social investment in job creation, apprenticeships, and self-employment support, and called for crisis measures harming youth employment to be reassessed. Finally, it stressed the need for EU-wide social indicators, private sector collaboration, and aligning curricula with labor market demands to ensure sustainable growth and social rights.",
    "total_score": 0.7148541114058355,
    "total_choice": 7,
    "party_num": 2,
    "id": 20,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.6,
      0.4
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "Presentation of the College of Commissioners: MOTION FOR A RESOLUTION on election of the Commission",
    "background": "Following the delayed formation of the College of Commissioners under the Lisbon Treaty, concerns emerged regarding nomination processes and portfolio allocations during candidate hearings. The Parliament will discuss the election of the Commission, addressing institutional procedures for appointing EU executive leadership and ensuring coherent policy coordination across member states.",
    "stances": [
      {
        "party_name": "ALDE",
        "score": 0.0,
        "choice": 0,
        "stance": "ALDE entirely conflicts the issue's failure to mandate a Commission structure capable of driving supranational integration, contradicting Verhofstadt's demand for a \"real driving force behind European Union\"  \nALDE rejects the issue's procedural focus as incompatible with Wallis' insistence on Parliament being a \"true legislative partner\" rather than a mere \"dimension\" in EU governance  \nALDE condemns the issue's silence on creating binding socio-economic governance structures, directly conflicting with Lambsdorff's call for \"strong Europe inside and out\" through economic union  \nALDE opposes the issue's acceptance of portfolio overlaps in energy policy as undermining Vălean's requirement for \"cohesive approach to global energy challenges\" through unified leadership  \nALDE rejects the legal ambiguity tolerance in Commissioner nominations as incompatible with Ek's warning that imbalanced portfolios threaten \"sustainable economic growth\" in EU2020 strategy"
      },
      {
        "party_name": "ECR",
        "score": 0.8148148148148148,
        "choice": 8,
        "stance": "ECR strongly promotes the issue’s demands for enhanced scrutiny of Commissioners’ qualifications, aligning with their reform agenda to reduce bureaucratic overreach and ensure merit-based appointments.  \nECR endorses the call for separate integrity hearings as critical to addressing public distrust, reflecting their longstanding commitment to accountability in EU governance.  \nECR proposes amending the approval process to require individual Parliamentary votes on each Commissioner-designate, converting the current “take it or leave it” approach into a mechanism for rigorous quality control.  \nECR highlights the unresolved energy security coordination between portfolios as an area requiring immediate clarification, reinforcing the issue’s emphasis on coherent crisis management frameworks.  \nECR applauds the focus on legal adjustments to prevent procedural delays, consistent with their manifesto’s priority of institutional transparency and mandate discipline."
      }
    ],
    "resolution": "The European Parliament raised concerns about the process of nominating and assigning portfolios to Commissioners, expressing dissatisfaction with the lack of transparency and consistency in candidate evaluations. It criticized the \"take it or leave it\" approach limiting meaningful scrutiny of individual qualifications and highlighted inadequate performances by nominees during hearings, including evasive answers and irrelevant policy promises. The resolution emphasized unresolved issues such as energy security and overlapping responsibilities between portfolios, particularly in transport, state aid, and the Galileo project, urging coherent coordination. It called for separate open hearings to address personal integrity concerns and noted legal ambiguities arising from the delayed nomination process, which allowed previous Commissioners to act beyond their mandate. While acknowledging confidence in the Commission President, Parliament demanded clarifications on policy coherence and legal adjustments to prevent future procedural delays, instructing the resolution’s transmission to EU institutions for action.",
    "total_score": 0.07065217391304347,
    "total_choice": 0,
    "party_num": 2,
    "id": 21,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.4,
      0.6
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "Revision of the Treaties – Transitional measures concerning the composition of the European Parliament: REPORT on the draft protocol amending Protocol No 36 on transitional provisions concerning the composition of the European Parliament for the rest of the 2009-2014 parliamentary term: the European Parliament’s opinion (Article 48(3) of the EU Treaty)",
    "background": "The Lisbon Treaty's entry into force (1 December 2009) altered European Parliament seat allocations from 736 (Nice Treaty) to 751 MEPs. The 2009 elections occurred under Nice rules, creating a discrepancy. Protocol No. 36 required adjustment to temporarily accommodate 18 additional MEPs from 12 states without mid-term reductions. The Parliament will discuss amending Protocol No. 36 to enable transitional composition measures for the 2009-2014 parliamentary term.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.8816793893129771,
        "choice": 8,
        "stance": "EPP strongly advocates the immediate seating of all 18 additional MEPs through direct elections, aligning with their commitment to democratic legitimacy and institutional balance.  \nEPP applauds the insistence on simultaneous integration of new Members to preserve fair national representation, reflecting their principle of equal citizenship across the Union.  \nEPP urges accelerated ratification of Protocol No 36 amendments while maintaining opposition to national parliamentary appointments, reinforcing their dedication to direct voter mandates.  \nEPP accepts the exceptional intergovernmental conference mechanism as a pragmatic solution but emphasizes this must not circumvent future convention processes for Treaty changes.  \nEPP proposes harmonizing Member States' electoral procedures to prevent similar transitional delays, enhancing Lisbon Treaty implementation without opposing the issue's core timeline."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.029411764705882353,
        "choice": 0,
        "stance": "GUE_NGL completely disputes any protocol enabling unelected MEPs, as this violates core democratic principles of direct representation  \nGUE_NGL rejects transitional measures allowing appointed parliamentarians, directly contradicting Treaty requirements for elections under the 1976 Act  \nThis proposal dangerously undermines legitimacy by permitting non-elected members, despite 2007 precedents requiring immediate elections for new accession states  \nThe issue's tolerance for intergovernmental negotiations conflicts with GUE_NGL's absolute stance against indirect selection mechanisms  \nGUE_NGL condemns the Council's failure to ensure simultaneous direct elections across all member states as required by Lisbon Treaty obligations"
      }
    ],
    "resolution": "The European Parliament raised concerns regarding the implementation of the Lisbon Treaty’s provisions on its composition, emphasizing the need to adjust the number of Members (MEPs) from 736 under the Nice Treaty to 751 as stipulated by the Lisbon Treaty. It noted that the 2009 elections were held under the Nice framework, resulting in 736 MEPs, but the Lisbon Treaty’s entry into force on 1 December 2009 necessitated adding 18 MEPs from 12 Member States, temporarily increasing the total to 754 until the end of the 2009-2014 term. This temporary overage required amending Protocol No 36 to accommodate transitional measures. The Parliament stressed that all 18 additional MEPs must take their seats simultaneously to preserve institutional balance, urging Member States to expedite their election processes. It criticized the Council’s delay in enabling the timely seating of these MEPs and opposed indirect election via national parliaments, favoring direct elections under the 1976 Act. While reluctantly accepting an intergovernmental conference to address transitional measures, it insisted these must be exceptional and not set precedents. The resolution also highlighted the need for future decisions on Parliament’s composition to account for potential new Member States and instructed its President to communicate the resolution to relevant EU institutions and national parliaments.",
    "total_score": 0.6508152173913043,
    "total_choice": 6,
    "party_num": 2,
    "id": 22,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.9,
      0.1
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "Commissioner hearings: lessons to be taken from the 2014 process: REPORT on procedures and practices regarding Commissioner hearings, lessons to be taken from the 2014 process",
    "background": "Following the 2014 European Commission hearings, concerns emerged over nomination timelines, gender representation in candidate selections, financial interest disclosures, and hearing procedures under EU treaties and prior parliamentary resolutions. The Parliament will discuss optimizing Commissioner-designate evaluation processes, focusing on procedures for enhancing transparency, gender balance, and accountability.",
    "stances": [
      {
        "party_name": "SD",
        "score": 0.9651162790697675,
        "choice": 9,
        "stance": "SD entirely promotes the issue’s mandate for gender parity in Commissioner nominations, aligning perfectly with SD’s longstanding commitment to institutional equality and its demand that member states propose both male and female candidates to achieve a gender-balanced College.  \nSD perfectly aligns with the expansion of financial scrutiny to include family members’ interests, a critical enhancement of accountability that reflects SD’s unwavering prioritization of ethical governance and anti-corruption frameworks.  \nSD unequivocally supports leveraging social media to deepen citizen engagement during hearings, advancing SD’s strategic goal of democratizing EU processes and ensuring public participation aligns with parliamentary transparency standards.  \nSD entirely promotes procedural rigor in hearings, including extended durations for Vice-Presidents and fixed nomination deadlines, which effectively advance SD’s vision of a merit-based, scrutiny-driven Commission appointment system.  \nSD applauds the call for periodic post-appointment performance reviews, resonating perfectly with SD’s manifesto pledge to enforce continuous accountability for EU executives beyond their initial confirmation."
      },
      {
        "party_name": "ECR",
        "score": 0.0625,
        "choice": 0,
        "stance": "ECR rejects the issue’s procedural framework for failing to dismantle coordinators’ disproportionate control over hearings, contradicting ECR’s demand for direct MEP questioning rights.  \nECR opposes fundamentally the omission of binding mechanisms to insulate the Commission from Troika influence, a non-negotiable priority for ECR’s vision of institutional independence.  \nThe proposal overlooks critical aspects of citizen engagement by relying on passive social media strategies rather than formalizing public input channels as ECR advocates.  \nECR condemns the issue’s gender parity system as bureaucratic overreach inconsistent with member states’ sovereign nomination rights."
      }
    ],
    "resolution": "The European Parliament raised the importance of enhancing democratic legitimacy and transparency through public hearings of Commissioners-designate, emphasizing their role in assessing candidates' qualifications, priorities, and suitability for their portfolios. It called for gender equality in the Commission’s composition, criticizing the 2014 imbalance where larger Member States predominantly proposed male candidates, and recommended each Member State submit one male and one female candidate to ensure a gender-balanced College. The resolution proposed procedural improvements, including setting deadlines for Member States to nominate candidates, expanding written questionnaires to seven questions, allowing immediate follow-up questions to improve scrutiny, and extending hearings for Vice-Presidents beyond three hours due to their broader responsibilities. It stressed the need to strengthen financial transparency by requiring Commissioners-designate to disclose family members’ interests and broadening the Committee on Legal Affairs’ scrutiny to identify conflicts of interest. The resolution highlighted the 2014 hearings’ increased public engagement via social media and urged leveraging such platforms to involve citizens. It addressed structural challenges, such as aligning portfolios with parliamentary committees’ remits and ensuring fair evaluation processes, including replacement candidates’ hearings under equal conditions. Specific concerns were raised about last-minute portfolio changes, notably in Transport, which disrupted fair assessment. The Parliament also advocated periodic reviews of Commissioners’ post-appointment performance and stricter adherence to deadlines for publishing evaluation statements within 24 hours after hearings. Overall, the resolution sought to institutionalize gender parity, enhance accountability, and improve the rigor and inclusivity of the Commission approval process.",
    "total_score": 0.6977777777777778,
    "total_choice": 6,
    "party_num": 2,
    "id": 23,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.5,
      0.5
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "Amendments to Parliament's Rules of Procedure: REPORT on amendments to Parliament’s Rules of Procedure affectingChapters 1 and 4 of Title I; Chapter 3 of Title V; Chapters 4 and 5 of Title VII; Chapter 1 of Title VIII; Title XII; Title XIV and Annex II",
    "background": "A 2018 European Court ruling on parliamentary disciplinary measures and evolving transparency standards prompted the Committee on Constitutional Affairs to propose amendments to the European Parliament's Rules of Procedure. The Parliament will discuss revisions addressing transparency obligations, political group formation criteria, and alignment with legal frameworks governing parliamentary conduct and institutional accountability.",
    "stances": [
      {
        "party_name": "SD",
        "score": 0.839572192513369,
        "choice": 8,
        "stance": "SD strongly promotes the transparency reforms mandating lobbyist registration and public disclosure of meetings, aligning perfectly with their commitment to open governance and accountability.  \nSD entirely promotes the amendments requiring political groups to demonstrate genuine ideological cohesion, preventing artificial alliances that undermine parliamentary legitimacy.  \nSD proposes amending Rule 11(3e) to prohibit secret voting on transparency-related provisions, ensuring alignment with public accountability principles.  \nSD applauds the enforceable behavioral protocols for Members, particularly the Code’s expanded accountability measures, which mirror their 2024 ethical governance manifesto.  \nSD approves mandatory consultation mechanisms for committee decisions, addressing concerns about unilateral leadership actions while preserving procedural efficiency."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.42,
        "choice": 4,
        "stance": "GUE_NGL partly promotes the transparency amendments in Chapters 1 and 4 of Title I, endorsing mandatory lobbyist meeting disclosures to counter public distrust.  \nGUE_NGL requests revision of Amendment 86 and 87 in Title XIV, demanding explicit criteria to prevent arbitrary politicization of procedural decisions.  \nGUE_NGL opposes Annex II modifications establishing subjective \"political affinity\" tests for group formation, citing violations of pluralism principles.  \nGUE_NGL warns that bureaucratic procedural changes in Title VII Chapter 5 risk diminishing legislative scrutiny capacities contrary to democratic accountability.  \nGUE_NGL insists future amendments must prohibit supranational power concentration aligning with corporate interests rather than popular sovereignty."
      }
    ],
    "resolution": "The European Parliament raised amendments to its Rules of Procedure, with most changes taking effect on the first day of the next part-session, while specific provisions—including the second subparagraph of Rule 11(3e), points 6 and 7 of the Code of appropriate behavior for Members, and amendments to Rules 196 and 204—were deferred until the opening of the first part-session following the 2019 elections. The resolution mandated the President to inform the Council and Commission of these updates, ensuring alignment with procedural reforms ahead of the new legislative term. The adjustments aimed to enhance governance standards and behavioral protocols for Members, prioritizing timely implementation of core changes while delaying certain measures to post-election continuity.",
    "total_score": 0.6639676113360324,
    "total_choice": 6,
    "party_num": 2,
    "id": 24,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.7,
      0.3
    ],
    "veto_party_name": "GUE_NGL"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "A comprehensive European Union framework on endocrine disruptors: MOTION FOR A RESOLUTION on the negotiations with the Council and Commission on the legislative proposal for a regulation on the European Parliament’s right of inquiry",
    "background": "Following the Treaty of Lisbon granting the European Parliament legislative initiative on inquiry procedures, prolonged negotiations since 2014 between EU institutions over updating the 1995 framework have stalled due to unresolved legal and institutional concerns. The Parliament will discuss challenges in adopting a regulation on its investigative powers and interinstitutional cooperation under the special legislative procedure.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.8076923076923077,
        "choice": 8,
        "stance": "GREEN_EFA strongly promotes the issue’s insistence on legal action through the Court of Justice to enforce institutional cooperation obligations, aligning perfectly with GREEN_EFA’s commitment to transparent governance.  \nGREEN_EFA applauds the emphasis on democratic accountability through robust inquiry tools, which effectively advances the party’s priority of combating corporate environmental negligence in chemical regulation.  \nGREEN_EFA approves the integration of lessons from PANA and EMIS committees, proposing to amend Article 4 to explicitly include public access to anonymized inquiry findings as a transparency enhancement.  \nGREEN_EFA endorses invoking the Interinstitutional Agreement on Better Law-Making, urging expansion of witness testimony provisions to cover subcontractors in chemical supply chains.  \nGREEN_EFA fully backs escalating the issue to EU leaders, stressing this aligns with their manifesto pledge to strengthen parliamentary oversight of endocrine disruptor policies."
      },
      {
        "party_name": "ECR",
        "score": 0.18309859154929578,
        "choice": 1,
        "stance": "ECR entirely conflicts with the issue's legal action proposal through the Court of Justice, viewing it as an unconstitutional power grab that bypasses national sovereignty principles.  \nECR opposes the reliance on the Interinstitutional Agreement for structured negotiations, arguing it imposes supranational bureaucracy inconsistent with subsidiarity.  \nThe proposal overlooks critical aspects of institutional balance by demanding unilateral parliamentary access to sensitive documents without member state oversight.  \nECR rejects the characterization of Council resistance as undemocratic, maintaining that scrutiny mechanisms must respect national governments' constitutional roles.  \nThis issue disregards ECR's core principle that inquiry powers should remain decentralized to prevent EU overreach into member states' jurisdictional domains."
      }
    ],
    "resolution": "The European Parliament raised significant concerns over the Council and Commission’s obstruction of efforts to adopt a regulation strengthening its investigative powers under Article 226 TFEU, which mandates a special legislative procedure requiring their consent. Despite over four years of informal negotiations, working documents, and legal consultations between the institutions’ services, the Council and Commission refused to engage in formal political discussions to resolve key disagreements, including institutional resistance to granting Parliament robust inquiry tools such as witness summons and document access. The resolution criticized this as a breach of sincere interinstitutional cooperation (Article 13(2) TEU) and democratic accountability, emphasizing Parliament’s constitutional role in overseeing the executive. It highlighted lessons from recent inquiry committees (PANA on financial crimes and EMIS on emissions fraud), which underscored the need for updated investigative rules. Parliament urged its President to escalate the issue to EU leaders, proposed legal action via the Court of Justice to enforce cooperation obligations, and called on political parties and *Spitzenkandidaten* to publicly support the revised regulation. The resolution also stressed that the current procedural framework under Article 226 TFEU does not oblige the Council and Commission to negotiate, but Parliament insisted they resume talks based on a revised proposal reflecting legal consultations and practical experience, while invoking the Interinstitutional Agreement on Better Law-Making to demand structured negotiations. The text was forwarded to EU institutions and national parliaments to reinforce accountability demands.",
    "total_score": 0.5954301075268817,
    "total_choice": 5,
    "party_num": 2,
    "id": 25,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.1,
      0.9
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "Differentiated integration: REPORT on differentiated integration",
    "background": "The European Union's increasing use of differentiated integration mechanisms, such as enhanced cooperation and permanent structured cooperation, alongside debates on balancing unity with flexibility, prompted by the 2017 Commission White Paper and challenges like Brexit. The Parliament will discuss differentiated integration's implications for EU governance and cohesion.",
    "stances": [
      {
        "party_name": "SD",
        "score": 0.7513513513513513,
        "choice": 7,
        "stance": "SD strongly sanctions the issue’s endorsement of multispeed integration, aligning perfectly with SD’s commitment to pragmatic EU advancement while preserving unity, as exemplified by Jo Leinen’s emphasis on enabling proactive states without excluding others.  \nSD approves the issue’s push to replace unanimity with qualified majority voting via Article 48(7) TEU, a reform SD has long advocated to overcome deadlocks in taxation and economic governance.  \nSD proposes amending Clause 12 to include a sunset clause for all temporary differentiated measures, ensuring they automatically expire after five years unless renewed by unanimous consent, thereby strengthening safeguards against fragmentation.  \nSD endorses the issue’s rejection of permanent opt-outs, emphasizing that transitional periods for new members must adhere to strict timelines, a stance consistent with SD’s vision of an equitable and cohesive Union.  \nSD applauds the call to integrate intergovernmental mechanisms like the ESM into EU law, which aligns with SD’s priority to enhance democratic accountability and institutional transparency."
      },
      {
        "party_name": "ECR",
        "score": 0.014084507042253521,
        "choice": 0,
        "stance": "ECR rejects fundamentally the issue's prohibition of permanent opt-outs, which contradicts their commitment to national sovereignty and voluntary cooperation frameworks.  \nECR opposes the integration of intergovernmental mechanisms like the ESM into EU legal structures, viewing this as unacceptable centralization eroding member state autonomy.  \nThe proposal overlooks critical aspects of economic asymmetry, failing to protect states like Greece from punitive integration timelines that exacerbate inequality among members.  \nECR opposes the push for qualified majority voting in taxation, which fully challenges with their defense of unanimous decision-making to preserve national fiscal sovereignty.  \nThe issue’s rejection of differentiation in social policies disregards ECR’s stance that member states must retain exclusive competence to avoid homogenized EU overreach."
      }
    ],
    "resolution": "The European Parliament raised concerns and outlined principles regarding differentiated integration within the EU, emphasizing its pragmatic but cautious use to avoid fragmentation while promoting inclusivity and deeper unity. It acknowledged differentiated integration as an existing reality, encompassing multispeed approaches, variable geometry, and à la carte mechanisms, but stressed it must remain temporary, open to all Member States, and aligned with Treaty provisions (Articles 20 and 46 TEU) to prevent creating first- and second-class members. The resolution called for shifting Council voting from unanimity to qualified majority voting via the passerelle clause (Article 48(7) TEU) to overcome deadlocks, particularly in taxation and economic governance, and highlighted Brexit as an opportunity to transition from opt-out to non-discriminatory opt-in models. It urged integrating initiatives like the European Stability Mechanism (ESM) into the EU legal framework, completing the Banking Union with a fiscal backstop, and establishing a Euro Area budget line. The Parliament emphasized democratic accountability, opposing intergovernmental structures that reduce transparency, and demanded strengthened parliamentary oversight over EU expenditure, including enhanced cooperation activities. It advocated ending permanent opt-outs in primary law, allowing only temporary, case-by-case transitional periods for new members, and proposed partnerships for non-EU states adhering to EU values and contributing to the budget. Core EU policies on fundamental rights, economic cohesion, and environmental standards were deemed non-negotiable, with differentiation prohibited in areas risking negative externalities like social dumping. The resolution also promoted regional cooperation, cross-border initiatives, and rationalizing budgetary tools to support convergence, while urging the Commission to enforce single market rules and accelerate socio-economic integration.",
    "total_score": 0.6019021739130435,
    "total_choice": 6,
    "party_num": 2,
    "id": 26,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.3,
      0.7
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "OLAF Supervisory Committee's annual report 2014: JOINT MOTION FOR A RESOLUTION on the OLAF Supervisory Committee’s annual report 2014",
    "background": "The OLAF Supervisory Committee's 2014 report identified procedural non-compliance in case openings, insufficient implementation of oversight recommendations, and resource allocation concerns within the European Anti-Fraud Office. Institutional tensions arose over supervisory access to operational data and secretariat independence under Regulation (EU, Euratom) No 883/2013. The Parliament will discuss OLAF's adherence to investigative protocols and oversight mechanisms.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9313725490196079,
        "choice": 9,
        "stance": "EPP firmly advocates the issue's condemnation of OLAF's systemic procedural violations, perfectly aligning with its principle that EU agencies must exemplify legal compliance when handling taxpayer funds.  \nEPP perfectly aligns with demands for immediate SC mandate strengthening, particularly full case file access and independent secretariat control, as critical to restoring institutional credibility in fraud prevention.  \nEPP fully supports the issue's exposure of OLAF's statistical manipulation, viewing enhanced SC oversight as essential to prevent politically motivated investigation metrics.  \nEPP endorses without reservation the call to abolish arbitrary financial indicators in IPPs, recognizing this as vital to refocusing OLAF on substantive fraud patterns rather than bureaucratic performance quotas.  \nEPP perfectly aligns with demands for transparent resource reallocation, particularly rebalancing investigator distribution to match actual fraud risks in agricultural funds versus tobacco enforcement."
      },
      {
        "party_name": "SD",
        "score": 0.017543859649122806,
        "choice": 0,
        "stance": "SD rejects the issue's procedural foundation for violating due process principles by excluding OLAF's input during critical debates.  \nSD opposes fundamentally the one-sided condemnation of OLAF's operations without verifying claims against its 2014 annual report, contradicting SD's insistence on evidence-based policymaking.  \nSD condemns the issue's failure to address the Supervisory Committee's overreach into operational matters, which undermines OLAF's investigative independence central to SD's anti-fraud priorities.  \nSD highlights the issue's disregard for balanced institutional scrutiny, ignoring SD's core demand for equal treatment of EU bodies through simultaneous review of OLAF and SC reports.  \nSD denounces the premature resource allocation criticisms as inconsistent with SD's data-driven approach to budgetary oversight, given incomplete case closure statistics from 2012-2014."
      }
    ],
    "resolution": "The European Parliament raised concerns over systemic deficiencies in the European Anti-Fraud Office (OLAF), particularly regarding the improper opening of 423 cases in 2012 without prior assessment of fraud suspicions, as required by Regulation (EU, Euratom) No 883/2013, with only 8.4% of closed cases resulting in recommendations. It criticized OLAF’s lack of compliance with the OLAF Supervisory Committee (SC), noting that only 8 out of 50 SC recommendations were fully implemented, and highlighted the SC’s inability to effectively monitor OLAF’s independence, procedural guarantees, and investigation durations due to insufficient information access. The resolution condemned OLAF’s failure to incorporate SC feedback into its 2015 Investigation Policy Priorities (IPPs), including abolishing financial indicators without stakeholder consultation, and expressed concerns over resource allocation, with 33% of investigators handling agricultural and structural funds (86% of €1.9 billion at risk) versus 10% assigned to tobacco and counterfeit units. It urged OLAF to justify non-implementation of SC recommendations, improve transparency in its participation in Commission ‘Clearing House’ meetings, and comply with legal requirements on investigation timelines. The Parliament called on the Commission to strengthen the SC’s mandate by amending Working Arrangements by 31 December 2015, ensuring the SC’s Secretariat operates independently, with full access to case files and authority over staffing and budget. Additionally, it demanded OLAF provide the SC with data on complaints and their resolution, while acknowledging initial improvements in OLAF-SC collaboration on prolonged investigations.",
    "total_score": 0.6026986506746627,
    "total_choice": 6,
    "party_num": 2,
    "id": 27,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.6,
      0.4
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "e-Democracy in the EU: potential and challenges: REPORT on e-democracy in the European Union: potential and challenges",
    "background": "Declining EU voter turnout, digital technology advancements, and existing treaties on democratic governance prompted consideration of ICT's role in civic participation. Cybersecurity concerns, digital divides, and Estonia's 2005 e-voting implementation highlighted challenges. The Parliament will discuss e-democracy's potential to enhance democratic engagement and institutional transparency within the EU framework.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.8085106382978723,
        "choice": 8,
        "stance": "GREEN_EFA strongly endorses the issue's emphasis on e-administration and open-source solutions as critical tools for transparent governance, aligning perfectly with their commitment to participatory democracy.  \nGREEN_EFA proposes enhancing cybersecurity safeguards for any e-voting trials to ensure verifiable secrecy and auditability, building on Estonia’s model while addressing current technical limitations.  \nGREEN_EFA applauds the focus on smart city applications and accessibility for persons with reduced mobility, which effectively advances their priority of inclusive, localized decision-making.  \nGREEN_EFA fully supports the issue’s digital inclusion measures—affordable internet access and literacy programs—as foundational steps toward equitable e-participation.  \nGREEN_EFA emphasizes that phased implementation of e-democracy tools must prioritize data protection frameworks, consistent with their longstanding advocacy for digital rights."
      },
      {
        "party_name": "ECR",
        "score": 0.07352941176470588,
        "choice": 0,
        "stance": "ECR rejects the issue's failure to address systemic media suppression undermining democratic participation, as evidenced by state-funded Greek media excluding opposition voices.  \nECR opposes fundamentally any e-democracy framework that does not first guarantee impartial access to public broadcasting resources for all political groups.  \nThe proposal overlooks critical aspects of media accountability by permitting EU-funded platforms to perpetuate ideological exclusion of conservative representatives.  \nECR condemns the issue's silence on preventing member states from weaponizing EU infrastructure like parliamentary studios for partisan censorship.  \nThis firmly conflicts with ECR's position that technological democratization requires prior enforcement of Article 11 Charter freedoms against national media monopolies."
      }
    ],
    "resolution": "The European Parliament raised concerns over declining political engagement and voter turnout, notably the 42.54% participation in the 2014 EU elections, amid crises eroding trust in EU institutions. It emphasized e-democracy’s potential to enhance transparency, accountability, and citizen participation through ICT tools like e-voting, e-consultation, and e-decision-making, while stressing these must complement, not replace, representative democracy. Key proposals included expanding secure e-voting systems, citing Estonia’s 2005 precedent, and addressing cybersecurity, data protection, and digital divides by ensuring affordable high-speed internet access, digital literacy programs, and multilingual platforms. The resolution urged EU institutions and member states to prioritize e-government services, open data, and pilot projects like crowdsourcing, while promoting gender equality in ICT and political processes. It called for a European Charter of Internet Rights to safeguard net neutrality, privacy, and freedom of expression, and highlighted the need for critical media literacy to counter misinformation. The Parliament also advocated leveraging EU programs like Erasmus+ and Horizon 2020 to foster active citizenship, and recommended revising the European Citizens’ Initiative to streamline digital participation, including e-IDAS for signature collection. Overall, the resolution underscored balancing technological innovation with safeguards to strengthen democratic legitimacy and inclusivity across the EU.",
    "total_score": 0.622286541244573,
    "total_choice": 6,
    "party_num": 2,
    "id": 28,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.8,
      0.2
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "European Citizens' Initiative: REPORT on the European Citizens’ Initiative",
    "background": "The European Citizens’ Initiative, established under the 2009 Lisbon Treaty to enable public legislative proposals, faced implementation challenges since 2012, including low success rates, technical barriers for organizers, and criticism of the Commission’s admissibility assessments. The Parliament will discuss enhancing the initiative’s effectiveness and accessibility for EU citizens.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.022727272727272728,
        "choice": 0,
        "stance": "GREEN_EFA rejects the issue's failure to mandate binding legislative action on successful initiatives, totally conflicting with their demand for direct citizen impact  \nGREEN_EFA opposes the maintained procedural barriers to ECI admissibility as perpetuating institutional detachment from grassroots democratic efforts  \nGREEN_EFA condemns the absence of enforceable deadlines for Commission responses to validated initiatives, overlooking critical accountability mechanisms  \nGREEN_EFA fundamentally disputes the issue's tolerance of Commission discretion in initiative rejections, inconsistent with transparency principles  \nGREEN_EFA challenges the limited scope of technical improvements as inadequate to reverse citizen disillusionment documented in 53 failed initiatives"
      },
      {
        "party_name": "SD",
        "score": 0.9127906976744186,
        "choice": 9,
        "stance": "SD entirely advocates the issue’s call to lower the minimum participation age to 16, perfectly aligning with SD’s commitment to empowering youth engagement in democratic processes.  \nSD perfectly aligns with the demand to simplify data collection requirements, eliminating personal ID barriers to enhance accessibility for all citizens.  \nSD entirely advocates decoupling registration from signature collection start dates, ensuring organizers can mobilize support without procedural delays.  \nSD perfectly aligns with the proposal for institutional accountability, requiring the Commission to provide legislative follow-up within 12 months for admissible initiatives.  \nSD entirely advocates enhanced financial and technical support for organizers, including centralized platforms and free translation, advancing SD’s priority of inclusive participatory democracy."
      }
    ],
    "resolution": "The European Parliament raised concerns about the implementation challenges and shortcomings of the European Citizens’ Initiative (ECI), a participatory democracy tool enabling citizens to propose legislation by collecting one million signatures from at least seven Member States. Despite over six million citizens participating in 51 initiatives since 2012, only three—Right2Water, One of Us, and Stop Vivisection—were deemed admissible, with six rejected initiatives challenged in court, highlighting procedural and legal barriers. Key issues included complex data requirements, lack of user-friendly IT tools, insufficient public awareness, and rigid admissibility checks by the Commission, which faced criticism for potential conflicts of interest. The resolution called for revising Regulation (EU) No 211/2011 to simplify processes, lower the minimum participation age to 16, standardize data collection (removing personal ID requirements), extend the 12-month signature period, and decouple registration from the collection start date. It urged enhanced support through free translation, a centralized online platform, financial assistance, and improved Commission guidance to organizers. The Parliament emphasized the need for transparency, institutional accountability, and public hearings, while advocating for clearer rejection reasoning, partial registration of initiatives, and post-submission legislative follow-up within 12 months. Strengthening interinstitutional cooperation, leveraging digital tools, and addressing liability concerns for organizers were also prioritized to revitalize the ECI’s role in bridging citizens and EU policymaking.",
    "total_score": 0.713859910581222,
    "total_choice": 7,
    "party_num": 2,
    "id": 29,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.6,
      0.4
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "Ombudsman’s strategic inquiry OI/2/2017 on the transparency of legislative discussions in the preparatory bodies of the Council of the EU: REPORT on the Ombudsman’s strategic inquiry OI/2/2017 on the transparency of legislative discussions in the preparatory bodies of the Council of the EU",
    "background": "The European Ombudsman’s 2017 inquiry identified insufficient transparency in the EU Council’s legislative preparatory bodies, citing maladministration and non-response to recommendations. The Parliament will discuss Council legislative process transparency, particularly document access and preparatory body deliberations, under Treaty obligations on institutional openness.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.7884615384615384,
        "choice": 7,
        "stance": "GREEN_EFA strongly promotes the issue’s demand for live-streamed Council preparatory meetings, aligning perfectly with their decades-long advocacy for EU institutional transparency.  \nGREEN_EFA endorses the call to abolish LIMITE classifications, emphasizing this directly addresses the democratic deficit they’ve campaigned against since the Lisbon Treaty.  \nGREEN_EFA proposes strengthening Article 4 by mandating real-time publication of Member State position papers to empower national parliaments’ oversight capacities.  \nGREEN_EFA applauds the focus on transforming the Council into a public legislative chamber, a reform matching their 2024 manifesto pledge to “replace closed-door diplomacy with open lawmaking.”  \nGREEN_EFA highlights the issue’s critical timing ahead of elections, noting its potential to combat misinformation through transparency—a core GREEN_EFA principle since 1999."
      },
      {
        "party_name": "ECR",
        "score": 0.08450704225352113,
        "choice": 0,
        "stance": "ECR rejects fundamentally the issue's imposition of EU transparency frameworks on intergovernmental bodies like the Eurogroup, which violates the principle of national sovereignty in fiscal policy coordination.  \nECR opposes the systematic publication of Member States’ negotiating positions as it would destabilize diplomatic dialogue and expose sensitive compromises to populist distortions.  \nThis issue conflicts with ECR's stance that consensus-based decision-making preserves equality among nations, rejecting qualified majority voting as a tool to marginalize smaller states.  \nThe proposal overlooks critical aspects such as the necessity for confidential preparatory discussions to achieve pragmatic legislative outcomes without external interference.  \nECR objects to live-streaming Council working group meetings, arguing it would performative transparency undermine substantive negotiations and incentivize political grandstanding."
      }
    ],
    "resolution": "The European Parliament raised concerns about the Council of the EU’s lack of transparency in legislative processes, particularly in its preparatory bodies like Coreper and over 150 working groups, which often operate behind closed doors, undermining democratic accountability. It criticized the Council’s failure to proactively publish legislative documents, reliance on the unjustified ‘LIMITE’ classification to restrict access, and refusal to systematically record or disclose Member States’ positions, hindering public scrutiny and enabling governments to evade responsibility for EU decisions. The resolution endorsed the European Ombudsman’s findings of maladministration and urged the Council to implement recommendations, including public access to meetings via live-streaming, publishing minutes, aligning practices with CJEU rulings, and ending opaque consensus-based decision-making instead of using qualified majority voting. It highlighted the imbalance in transparency between Parliament’s open procedures and the Council’s secretive practices, stressing the need for equivalent standards to combat misinformation and strengthen public trust, especially ahead of the 2019 elections. The Parliament also demanded formalizing informal bodies like the Eurogroup under EU transparency rules, transforming the Council into a transparent legislative chamber, and ensuring trilogues adhere to public mandates and document disclosure. It emphasized that systemic opacity in the Council contradicts Treaty obligations and democratic principles, eroding citizen confidence in the EU.",
    "total_score": 0.6467391304347826,
    "total_choice": 6,
    "party_num": 2,
    "id": 30,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.9,
      0.1
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "Outcome of the referendum in the United Kingdom: MOTION FOR A RESOLUTION on the decision to leave the EU resulting from the UK referendum",
    "background": "The United Kingdom's 2016 EU membership referendum resulted in a majority vote to leave, creating unprecedented institutional uncertainty. Pre-existing EU challenges included economic disparities, migration pressures, and debates over integration levels, while Article 50 TEU established withdrawal procedures. The Parliament will discuss managing the UK's departure process and addressing broader EU reform priorities.",
    "stances": [
      {
        "party_name": "EFDD",
        "score": 0.02564102564102564,
        "choice": 0,
        "stance": "EFDD rejects the issue's demand for immediate Article 50 activation as punitive haste inconsistent with democratic negotiation principles.  \nEFDD completely rejects the issue's call for deeper EU integration, which perpetuates the undemocratic \"political union\" model criticized in debates.  \nEFDD condemns the nullification of the February 2016 settlement as evidence of Brussels' refusal to address institutional overreach.  \nEFDD highlights the issue's failure to acknowledge EU responsibility for migration mismanagement and economic policies creating \"massive divisions\" cited by Farage.  \nEFDD declares the reform roadmap incompatible with their vision of \"global ambitions\" through national sovereignty rather than Lisbon Treaty centralization."
      },
      {
        "party_name": "SD",
        "score": 0.8070175438596491,
        "choice": 8,
        "stance": "SD strongly upholds the immediate activation of Article 50, aligning with the issue’s urgency to prevent economic destabilization while emphasizing solidarity with pro-EU British youth and universities benefiting from Erasmus+ programs.  \n\nSD approves the issue’s demand for EU reform prioritizing social justice, proposing enhanced public investment mechanisms beyond the current Juncker Plan to address inequality gaps exposed by Brexit-driven discontent.  \n\nSD endorses nullifying the February 2016 EU-UK settlement as vital to resetting negotiations but suggests explicitly linking future UK market access to adherence to EU social standards to prevent regulatory dumping.  \n\nSD advocates amending the fiscal compact through treaty revisions to allow greater fiscal flexibility for social investments, converting criticism of austerity into actionable reform proposals within the issue’s framework.  \n\nSD emphasizes accelerating tax justice measures by implementing TAXE committee recommendations within 12 months, framing this as critical to restoring citizen trust in line with the issue’s anti-evasion priorities."
      }
    ],
    "resolution": "The European Parliament raised the imperative to respect the UK’s decision to leave the EU, urging immediate activation of Article 50 to begin withdrawal negotiations, and called on the UK Prime Minister to formally notify the European Council by its June 28-29 meeting to prevent damaging uncertainty. It declared the February 2016 EU-UK settlement null and void, emphasized that future UK-EU relations cannot precede the withdrawal agreement, and stressed Parliament’s role in consenting to and overseeing negotiations. The resolution demanded EU reform to prioritize citizens’ interests, strengthen core institutions like the Economic and Monetary Union, freedom, security, justice, and foreign policy, while avoiding à la carte integration. It proposed a roadmap leveraging the Lisbon Treaty, supported by Parliament’s reports on institutional adjustments and Eurozone budgetary capacity, and mandated internal reorganization to reflect the UK’s departure, including reallocating the UK Commissioner’s portfolio and adjusting Council Presidencies to safeguard EU operations. The resolution underscored the need for democratic renewal to address challenges like migration, economic instability, and social inequality, ensuring the EU delivers tangible benefits to citizens.",
    "total_score": 0.5348837209302325,
    "total_choice": 5,
    "party_num": 2,
    "id": 31,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.6,
      0.4
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "Guidelines on the framework of future EU-UK relations: MOTION FOR A RESOLUTION on the framework of the future EU-UK relationship",
    "background": "Following the United Kingdom’s 2017 Article 50 TEU notification to withdraw from the EU, negotiations addressed citizens’ rights, financial obligations, and Northern Ireland border arrangements, culminating in the December 2017 Joint Report and February 2018 draft Withdrawal Agreement. The Parliament will discuss the framework for future EU-UK relations, including transitional arrangements and post-Brexit cooperation.",
    "stances": [
      {
        "party_name": "ENF",
        "score": 0.0,
        "choice": 0,
        "stance": "ENF rejects the issue's insistence on CJEU jurisdiction and regulatory alignment, totally disputeing with ENF's commitment to national sovereignty and opposition to supranational legal overreach.  \nThe proposal overlooks critical aspects of mutual trade interests by prioritizing protectionist measures, inconsistent with ENF's advocacy for tariff-free agreements without EU interference.  \nENF opposes the Northern Ireland Protocol framework as unnecessary EU meddling, asserting that bilateral solutions between the UK and Ireland align with their principle of intergovernmental cooperation.  \nThe issue's demand for continued EU budgetary compliance and financial transfers contradicts ENF's stance against economic subjugation to EU structures post-Brexit.  \nENF fundamentally disputes the premise of punitive level playing field provisions, viewing them as punitive tools rather than fair competition measures, in direct opposition to their free-market principles."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.94,
        "choice": 9,
        "stance": "GREEN_EFA completely supports the issue’s emphasis on maintaining regulatory alignment through the Northern Ireland Protocol, perfectly aligning with their longstanding commitment to upholding the Good Friday Agreement and preventing a hard border.  \nGREEN_EFA perfectly aligns with the issue’s demand for strict adherence to EU tax avoidance and money laundering standards, recognizing this as essential to preserving fair competition post-Brexit.  \nGREEN_EFA completely supports the issue’s provisions for lifelong residency and non-discrimination protections, effectively advancing their priority of maintaining EU citizenship rights for UK residents through residence-based entitlements.  \nGREEN_EFA perfectly aligns with the issue’s preparedness measures for all Brexit scenarios, including economic safeguards that reflect their warnings about diminished prosperity from ideological-driven separation.  \nGREEN_EFA completely supports the issue’s framework for sustainable fisheries management and coastal community protections, mirroring their demands to prevent Brexit-related damage to maritime economies like Galicia and Scotland."
      }
    ],
    "resolution": "The European Parliament raised the necessity of establishing a comprehensive framework for the future EU-UK relationship following Brexit, emphasizing the importance of an association agreement under Articles 8 TEU and 217 TFEU to ensure flexible cooperation across trade, foreign policy, security, and thematic areas. It stressed that the UK, as a third country, must maintain regulatory alignment with EU standards, including adherence to CJEU jurisdiction, level playing field provisions on taxation, environmental protection, labor rights, and data protection equivalence, while excluding cherry-picking of single market benefits. The resolution highlighted the need to protect citizens’ rights reciprocally, ensuring lifelong residency, family reunification, and non-discrimination for EU citizens in the UK and vice versa, rejecting the UK’s proposed differentiation between pre- and post-transition arrivals. It endorsed the Northern Ireland Protocol to avoid a hard border, upholding the Good Friday Agreement through continued regulatory alignment or specific solutions. Transitional arrangements were deemed critical to prolong EU acquis application, preventing a \"cliff-edge\" exit, with the UK bound by international agreements during this period but barred from new trade deals until its conclusion. The Parliament underscored preparedness for all scenarios, including no-deal, urging institutions and citizens to mitigate disruptions. It welcomed the Commission’s draft Withdrawal Agreement (28 February 2018) but insisted on robust governance, dispute mechanisms, and CJEU oversight, while conditioning future cooperation on strict compliance with EU principles and budgetary rules, excluding net financial transfers to the UK.",
    "total_score": 0.7420689655172413,
    "total_choice": 7,
    "party_num": 2,
    "id": 32,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.1,
      0.9
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "European citizens’ initiative: REPORT on the proposal for a regulation of the European Parliament and of the Council on the European citizens’ initiative",
    "background": "The European Citizens’ Initiative, established under the 2009 Lisbon Treaty to enable public legislative proposals, faced operational challenges since its 2012 implementation, including low success rates and administrative burdens. The Parliament will discuss revising the initiative’s regulatory framework to address accessibility and procedural barriers hindering citizen participation.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.0,
        "choice": 0,
        "stance": "GREEN_EFA opposes fundamentally the sunset clause on individual online collection systems, which contradicts their commitment to digital democracy and citizen participation.  \nGREEN_EFA rejects the arbitrary 2022 deadline for online signature tools, a regressive measure that disenfranchises grassroots movements and NGOs reliant on digital engagement.  \nThe proposal overlooks critical advancements in participatory governance by failing to guarantee permanent, accessible platforms for transnational citizen initiatives.  \nGREEN_EFA highlights the inconsistency of restricting online collection systems while claiming to modernize the ECI process, undermining trust in EU democratic reforms.  \nThis issue conflicts with GREEN_EFA’s demand for irreversible progress in removing bureaucratic barriers to civic mobilization across member states."
      },
      {
        "party_name": "ALDE",
        "score": 0.8939393939393939,
        "choice": 8,
        "stance": "ALDE strongly sanctions the issue’s modernization of the European Citizens’ Initiative, particularly public hearings and flexible deadlines, which align perfectly with ALDE’s commitment to participatory democracy and citizen-led policymaking.  \nALDE applauds the provision of enhanced technical resources for proponents, effectively advancing ALDE’s priority of accessible and inclusive civic engagement tools across the EU.  \nALDE proposes adapting the initiative’s linguistic regime to include all official EU languages, including regional and minority ones, ensuring equal accessibility for diverse linguistic communities.  \nALDE commends the streamlined Commission response timelines, which strengthen procedural transparency while maintaining rigorous oversight—a core ALDE principle.  \nALDE suggests amplifying regional and local authorities’ roles in promoting the initiative to improve cultural sensitivity and grassroots participation."
      }
    ],
    "resolution": "The European Parliament raised its position on the Commission’s 2017 proposal (COM(2017)0482) concerning legal measures under Article 24 of the Treaty on the Functioning of the European Union, adopting its first-reading stance and urging the Commission to re-submit the matter to Parliament if it substantially alters or replaces its original proposal. The resolution emphasized procedural adherence by instructing the Parliament’s President to transmit its adopted position to the Council, Commission, and national parliaments, ensuring alignment with institutional protocols while focusing on the substantive content of the proposal and maintaining legislative oversight over potential amendments.",
    "total_score": 0.6421768707482993,
    "total_choice": 6,
    "party_num": 2,
    "id": 33,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.5,
      0.5
    ],
    "veto_party_name": "ALDE"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "General revision of Parliament's Rules of Procedure: REPORT on the general revision of Parliament's Rules of Procedure",
    "background": "The European Parliament's Rules of Procedure required updates to align with the 2016 Interinstitutional Agreement on Better Law-Making, address evolving legislative practices, and modernize operational frameworks amid calls for enhanced transparency, ethical accountability, and procedural efficiency. The Parliament will discuss a comprehensive revision of its internal governance rules to streamline legislative processes and institutional integrity standards.",
    "stances": [
      {
        "party_name": "ENF",
        "score": 0.0,
        "choice": 0,
        "stance": "ENF rejects the issue's procedural thresholds as totally condemning with their defense of minority rights in parliamentary democracy.  \nENF opposes the disciplinary regime provisions for enabling majority factions to suppress dissenting opinions under vague \"xenophobia\" claims.  \nENF condemns caps on draft issues and written questions as overlooking critical needs for small groups to hold EU institutions accountable.  \nENF declares the motion limits and delegation rule changes inconsistent with their principle of equal participation regardless of faction size.  \nENF fundamentally disputes the transparency measures’ verification protocols as entrenching administrative control over elected members."
      },
      {
        "party_name": "ALDE",
        "score": 0.9491525423728814,
        "choice": 9,
        "stance": "ALDE fundamentally sanctions the issue's abolition of MEP performance rankings, perfectly aligning with their commitment to prioritizing substantive legislative quality over quantitative activity metrics.  \nALDE perfectly aligns with the mandate for real-time transparency in Commission communications, ensuring Parliament receives critical information before media disclosure as a cornerstone of institutional accountability.  \nALDE fully supports the strengthened sanctions against inflammatory parliamentary conduct, recognizing this as essential to maintaining dignity and responsibility in EU policymaking.  \nALDE applauds the open-ballot mechanism for Commission President elections, which advances their long-standing democratic principle that high-stakes appointments require unambiguous political accountability.  \nALDE unequivocally endorses the procedural streamlining of written questions and issues, seeing this as a vital step to combat legislative inflation and focus on strategic policymaking."
      }
    ],
    "resolution": "The European Parliament raised amendments to its Rules of Procedure to enhance legislative efficiency, transparency, and accountability, aligning with the 2016 Interinstitutional Agreement on Better Law-Making. Key changes included mandating the Secretary-General to adapt IT systems for tracking written questions, deleting Rule 106(4) once regulatory scrutiny procedures are phased out, and revising the Code of Conduct for legislative negotiations. Transparency measures required Members to update financial interest declarations within six months, prohibited paid lobbying roles, introduced stricter verification of declarations, and mandated former MEPs to inform Parliament of new lobbying positions. Lobbying rules were tightened, including badge removal for non-compliance and banning entourage badges for lobbying. Procedural reforms streamlined voting sequences, limited written questions to 20 per MEP every three months (addressing over 60,000 annual submissions), capped motions for resolutions to one per member monthly, restricted roll-call votes to 100 per group per session, and proposed abolishing written declarations or requiring 40 MEPs from three groups to table them. Thresholds for initiatives were set at one-twentieth, one-tenth, or one-fifth of Parliament’s membership. Intergroups were required to operate transparently, and committees gained authority to accelerate priority legislation. The Commission was obligated to respond to parliamentary initiatives within three months or face committee scrutiny, and withdrawals of proposals required consultation with Parliament. Amendments entered force at the next session, except Rule 212(2) on delegations, effective after the 2019 elections.",
    "total_score": 0.7431059506531205,
    "total_choice": 7,
    "party_num": 2,
    "id": 34,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.1,
      0.9
    ],
    "veto_party_name": "ALDE"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "Interinstitutional agreement on Better law-making: REPORT on the conclusion of an Interinstitutional Agreement on Better Law-Making between the European Parliament, the Council of the European Union and the European Commission",
    "background": "The 2003 Interinstitutional Agreement on Better Law-Making, predating the EU’s 2003 enlargement and Lisbon Treaty reforms, faced calls for revision to align with post-Treaty legislative frameworks, address evolving regulatory practices, and consolidate institutional cooperation standards. The Parliament will discuss negotiating a new agreement to modernize interinstitutional legislative processes and regulatory efficiency.",
    "stances": [
      {
        "party_name": "EFDD",
        "score": 0.07894736842105263,
        "choice": 0,
        "stance": "EFDD opposes fundamentally the agreement's failure to mandate real-time public disclosure of trilogue negotiations, contradicting Article 290 TFEU transparency commitments.  \nEFDD rejects the delayed implementation of delegated act registries until 2017 as inconsistent with immediate democratic accountability requirements.  \nEFDD condemns the procedural opacity allowing single negotiators without parliamentary mandates, undermining Treaty-aligned co-legislation principles.  \nEFDD opposes the issue's inadequate safeguards against corporate lobbying in delegated acts, exemplified by the Volkswagen case referenced in debate.  \nEFDD rejects the agreement's presumption of EU legislative supremacy, aligning with Tim Aker's call to restore sovereign national lawmaking powers."
      },
      {
        "party_name": "SD",
        "score": 0.9479768786127167,
        "choice": 9,
        "stance": "SD firmly supports the issue's comprehensive impact assessments that balance regulatory costs with public health, consumer, and environmental protections, aligning with SD's commitment to holistic policymaking.  \nSD perfectly aligns with provisions enhancing legislative transparency and institutional cooperation, particularly the standardized use of second-reading agreements and improved access to Council documents.  \nSD fully supports the strengthened role of Parliament in multiannual programming and Commission Work Programme consultations, safeguarding democratic oversight in EU law-making.  \nSD endorses the issue's mechanisms for reducing administrative burdens while maintaining high standards through SME-focused Annual Burden Surveys and independent Regulatory Scrutiny Board oversight.  \nSD affirms the agreement's advancement of social protections through mandatory evaluation of environmental and social impacts during legislative procedures, ensuring alignment with SD priorities."
      }
    ],
    "resolution": "The European Parliament raised the need to modernize the 2003 Interinstitutional Agreement on Better Law-Making to align with post-Lisbon Treaty frameworks, enhance transparency, and strengthen cooperation among EU institutions. It welcomed the provisional agreement on a new Interinstitutional Agreement (IIA) aimed at improving legislative quality, multiannual programming, and annual Commission Work Programme consultations, while safeguarding Parliament’s legislative powers and right of initiative. Key provisions include enhanced impact assessments overseen by an independent Regulatory Scrutiny Board (without veto power), measures to reduce administrative burdens—particularly for SMEs—through an Annual Burden Survey, and commitments to simplify legislation and repeal obsolete acts. The resolution emphasized the need for balanced criteria to distinguish delegated and implementing acts under Articles 290 and 291 TFEU, urging swift alignment of existing laws with Lisbon Treaty provisions. It stressed transparency in legislative procedures, advocating for second-reading agreements as the standard and cautioning against non-transparent first-reading negotiations. The agreement also promotes cooperation with national parliaments on subsidiarity checks, flexibility in enforcing the eight-week deadline for reasoned opinions, and improved political dialogue. The Parliament highlighted the importance of evaluating the new IIA’s impact on existing agreements, ensuring compliance with deadlines, and adapting its Rules of Procedure to reflect the agreement. Specific operational details included timelines for objections to delegated acts (two months, extendable by two months) and urgency procedures for crises, alongside requirements for Commission consultations with Member State experts and stakeholders during delegated act preparation. The resolution concluded with calls for rigorous implementation and future technical follow-up on unresolved issues, such as international agreement procedures and delegated act criteria.",
    "total_score": 0.7025036818851251,
    "total_choice": 7,
    "party_num": 2,
    "id": 35,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.8,
      0.2
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "Regulations and general conditions governing the performance of the Ombudsman’s duties (Statute of the European Ombudsman): REPORT on a draft regulation of the European Parliament laying down the regulations and general conditions governing the performance of the Ombudsman’s duties (Statute of the European Ombudsman) and repealing Decision 94/262/ECSC, EC, Euratom",
    "background": "The European Ombudsman’s mandate, established under pre-Lisbon Treaty rules (Decision 94/262/ECSC, EC, Euratom), required alignment with post-2009 legal frameworks, including Article 228 TFEU and the Charter of Fundamental Rights’ right to good administration. The Parliament will discuss updating the Ombudsman’s regulations to reflect institutional reforms and enhance oversight of EU administrative practices.",
    "stances": [
      {
        "party_name": "SD",
        "score": 0.9184782608695652,
        "choice": 9,
        "stance": "SD fundamentally accepts the strengthened mandate for systemic inquiries and follow-up powers, perfectly aligning with SD’s commitment to combating institutional maladministration and ensuring accountability.  \nSD applauds the issue’s explicit integration of whistleblower protections as a critical enhancement to transparency, reflecting SD’s 2023 priorities on safeguarding ethical governance.  \nSD highlights the Ombudsman’s authority to access classified documents and coordinate with the European Public Prosecutor’s Office as a vital step toward combating financial fraud, mirroring SD’s anti-corruption manifesto pledges.  \nSD emphasizes that the three-year complaint window and confidentiality safeguards perfectly align with SD’s longstanding advocacy for citizen-centric justice and procedural fairness in EU governance.  \n SD underscores the budgetary autonomy and institutional cooperation mechanisms as essential to fulfilling the Ombudsman’s expanded role, directly advancing SD’s vision of a democratically robust EU."
      },
      {
        "party_name": "ECR",
        "score": 0.38028169014084506,
        "choice": 3,
        "stance": "ECR partially promotes the procedural updates but requests revisions to Article 6 to explicitly grant the Ombudsman standing before the Court of Justice in citizen rights cases.  \nECR entirely againsts with the issue’s omission of whistleblower protections, demanding amendments to Section 4 to include safeguards for public interest witnesses.  \nThe proposal overlooks critical aspects of institutional accountability by maintaining the three-year complaint window, which ECR argues should be extended given bureaucratic delays.  \nECR rejects the classified document access framework as inconsistent with transparency principles, urging stricter parliamentary oversight mechanisms.  \nThis fails to address ECR’s core demand for mandatory sanctions against institutions repeatedly non-compliant with Ombudsman recommendations."
      }
    ],
    "resolution": "The European Parliament raised the need to modernize the role and operational framework of the European Ombudsman by adopting a new regulation to replace the outdated 1994 Decision, aligning it with post-Lisbon Treaty legal standards. The regulation strengthens the Ombudsman’s mandate to investigate maladministration in EU institutions, bodies, and agencies (excluding the Court of Justice in its judicial role), emphasizing the right to good administration under the EU Charter of Fundamental Rights. It grants the Ombudsman authority to conduct own-initiative inquiries to address systemic issues, follow up on compliance with recommendations, and submit annual reports to Parliament assessing institutional compliance and resource adequacy. Complaints must be filed within three years of the complainant becoming aware of the issue, after exhausting administrative remedies, and can remain confidential. The Ombudsman has broad access to information, including classified documents, subject to confidentiality agreements, and must notify relevant authorities (e.g., the European Public Prosecutor’s Office) of potential criminal matters while respecting due process rights. Institutions are required to respond to inquiries within three months (extendable by two months) and cooperate fully, with non-compliance reported to Parliament. The Ombudsman’s independence is safeguarded through appointment by Parliament for the parliamentary term, with qualifications mirroring judicial standards, and a budget ensuring operational autonomy. The regulation also mandates cooperation with national ombudsmen and EU bodies like the Fundamental Rights Agency, while ensuring staff confidentiality and procedural safeguards for handling sensitive data.",
    "total_score": 0.7744565217391305,
    "total_choice": 7,
    "party_num": 2,
    "id": 36,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.5,
      0.5
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "Implementation of the Treaty provisions concerning enhanced cooperation: REPORT on the implementation of the Treaty provisions concerning enhanced cooperation",
    "background": "The EU’s post-Lisbon Treaty framework enabled enhanced cooperation as a last-resort integration tool, with prior use in justice, patent, and fiscal policy areas. Studies (2017-2018) highlighted procedural challenges, including unanimity requirements and unclear operational guidelines, prompting institutional review. The Parliament will discuss enhanced cooperation’s implementation, institutional effectiveness, and Treaty-aligned reforms.",
    "stances": [
      {
        "party_name": "ALDE",
        "score": 0.8805970149253731,
        "choice": 8,
        "stance": "ALDE strongly sanctions the issue’s emphasis on enhanced cooperation as a last-resort mechanism under Article 20 TEU, aligning perfectly with ALDE’s longstanding commitment to advancing European integration where unanimity proves obstructive.  \nALDE approves the issue’s call to activate Article 333 TFEU for qualified majority voting post-authorization, which effectively advances ALDE’s priority of efficient and democratic EU decision-making.  \nALDE endorses the integration of enhanced cooperation into the *acquis communautaire* and urges Treaty revisions to clarify withdrawal mechanisms, ensuring legal coherence across all Member States as outlined in the issue.  \nALDE applauds the proposal for a dedicated Commission unit to streamline coordination, matching ALDE’s 2023 manifesto commitments to enhance institutional efficiency.  \nALDE proposes enhancing the issue’s democratic scrutiny provisions by explicitly linking the *Spitzenkandidat* process to electoral accountability, thereby strengthening the connection between EU policy outcomes and voter engagement without opposing the core objectives."
      },
      {
        "party_name": "ECR",
        "score": 0.04225352112676056,
        "choice": 0,
        "stance": "ECR rejects the issue’s reliance on enhanced cooperation mechanisms, viewing them as undermining national sovereignty and the principle of conferral central to ECR’s constitutional vision.  \nECR opposes the push for qualified majority voting under Article 333 TFEU, arguing it erodes member states’ democratic control over sensitive policy areas.  \nECR fully rejects with the issue’s federalist undertones, condemning the Lisbon Treaty’s “constitutionalization by stealth” rejected by citizens in earlier referendums.  \nECR highlights the issue’s failure to address institutional hypocrisy, exemplified by unequal treatment of sign language interpreters in EU proceedings despite Charter claims.  \nECR rejects the Spitzenkandidaten process and backroom Commission appointments, demanding strict adherence to intergovernmentalism over supranational power consolidation."
      }
    ],
    "resolution": "The European Parliament raised concerns and recommendations regarding the use of enhanced cooperation in the EU, emphasizing its role as a last-resort mechanism under Article 20 TEU to advance integration when unanimity cannot be achieved. It highlighted that enhanced cooperation, requiring at least nine Member States, has been underutilized but proven effective in areas like divorce law, property regimes (18 participating states as of 2019), the European Patent, and the European Public Prosecutor’s Office (EPPO), which involves 22 Member States and aims to combat EU budget fraud by late 2020. The resolution noted challenges, including lengthy procedures due to unclear timelines, lack of operational guidelines, and reliance on intergovernmental agreements outside EU frameworks (e.g., the Fiscal Compact), which undermine legal consistency and democratic scrutiny. It urged activating Article 333 TFEU to switch from unanimity to qualified majority voting (QMV) post-authorization, enhancing parliamentary oversight via stronger roles for the European Parliament and national/regional legislatures, and clarifying rules for Member State withdrawal or expulsion. The resolution called for EU budget alignment with enhanced cooperation costs, CJEU jurisdiction, and a Commission unit to streamline coordination. It stressed integrating enhanced cooperation into the *acquis communautaire* and urged Treaty revisions to address gaps, including sub-national entities’ roles. Specific to the EPPO, Parliament urged non-participating states to join, emphasized cooperation with OLAF and Eurojust, and supported potential mandate expansion to counter-terrorism. Overall, the resolution advocated preserving the EU’s institutional framework while using enhanced cooperation pragmatically to overcome deadlocks, ensuring transparency, inclusivity, and legal coherence.",
    "total_score": 0.6141304347826086,
    "total_choice": 6,
    "party_num": 2,
    "id": 37,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.2,
      0.8
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "Implementation of the Treaty provisions concerning national Parliaments: REPORT on the implementation of the Treaty provisions concerning national parliaments",
    "background": "The Treaty of Lisbon (2009) expanded national parliaments’ roles in EU governance, including subsidiarity oversight via Protocols 1 and 2, with periodic evaluations through Commission reports and interparliamentary initiatives. A 2015 multi-state parliamentary declaration and 2017 Court of Justice rulings on mixed agreements underscored institutional developments. The Parliament will discuss national parliaments’ implementation of Treaty-mandated functions in EU legislative and democratic processes.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.9,
        "choice": 9,
        "stance": "GREEN_EFA completely endorses the issue’s emphasis on extending scrutiny timelines for subsidiarity reviews, perfectly aligning with its commitment to addressing procedural shortcomings in the Early Warning System.  \nGREEN_EFA perfectly aligns with the call to strengthen national parliaments’ proactive engagement in political dialogue, ensuring constitutional accountability in EU decision-making.  \nGREEN_EFA completely endorses reforms to integrate the European Semester with national budgetary processes, advancing democratic oversight of fiscal policies as outlined in the issue.  \nGREEN_EFA perfectly supports the rejection of joint parliamentary decision-making bodies, upholding its principle that direct accountability must remain with elected representatives.  \nGREEN_EFA completely endorses the annual \"European Week\" initiative, recognizing its potential to amplify public debate and interparliamentary cooperation on EU priorities."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.2708333333333333,
        "choice": 2,
        "stance": "GUE_NGL rejects the issue's reliance on the Early Warning System as fundamentally incompatible with restoring parliamentary sovereignty, citing its proven ineffectiveness when the Commission disregards objections like those against the Posting of Workers Directive.  \nGUE_NGL opposes procedural adjustments to subsidiarity scrutiny timelines, arguing they perpetuate a \"farce\" that fails to reverse the Lisbon Treaty's erosion of national competencies in fiscal and economic governance.  \nGUE_NGL condemns the issue's omission of competence repatriation to national parliaments, particularly in budgetary matters usurped by the European Semester and Fiscal Compact frameworks.  \nGUE_NGL dismisses interparliamentary cooperation initiatives like the European Week as superficial, failing to address the structural power asymmetry favoring larger EU states and supranational bodies.  \nGUE_NGL demands treaty revisions to dismantle the \"yellow card\" mechanism entirely, insisting on binding veto powers for national parliaments over EU legislation affecting social and labor policies."
      }
    ],
    "resolution": "The European Parliament raised the need to strengthen the role of national parliaments in enhancing EU democratic legitimacy, subsidiarity oversight, and interinstitutional cooperation. It emphasized that national parliaments must scrutinize their governments’ actions in EU decision-making, particularly within the Council and European Council, to ensure accountability and transparency, while respecting constitutional traditions. The resolution highlighted deficiencies in the Early Warning System (EWS), noting its limited use (e.g., the 2016 \"yellow card\" on the Posting of Workers Directive) and procedural challenges, such as the inadequate eight-week period for subsidiarity reviews. It called for technical adjustments to extend scrutiny timelines and urged national parliaments to engage more proactively in political dialogue, including submitting constructive proposals to the Commission. The resolution advocated for improved use of the IPEX platform to streamline information-sharing and flagged subsidiarity concerns early. It endorsed initiatives like an annual \"European Week\" to foster public debate involving MEPs, Commissioners, and national MPs, alongside enhanced interparliamentary cooperation in security, defense, and economic governance, including aligning the European Semester with national budgetary processes. The Parliament rejected joint parliamentary decision-making bodies to preserve accountability but encouraged committee-level collaboration and exchanges of best practices. It stressed the importance of proportional representation of political minorities in national parliamentary opinions and urged reforms to strengthen parliamentary oversight of EU trade agreements and fiscal policies, while opposing a \"red card\" procedure as incompatible with current treaty frameworks.",
    "total_score": 0.7066115702479339,
    "total_choice": 7,
    "party_num": 2,
    "id": 38,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.6,
      0.4
    ],
    "veto_party_name": "GUE_NGL"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "Implementation of the Treaty provisions on Parliament’s power of political control over the Commission: REPORT on the implementation of the Treaty provisions on Parliament’s power of political control over the Commission",
    "background": "The Treaty of Lisbon expanded the European Parliament’s oversight role over the Commission, but ambiguities in executive definitions, multi-level governance complexities, and accountability mechanisms like censure thresholds and collective responsibility posed challenges. The Parliament will discuss enhancing political control frameworks to strengthen institutional accountability within existing treaty provisions.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9116279069767442,
        "choice": 9,
        "stance": "EPP absolutely advocates the issue's emphasis on the Spitzenkandidaten process as perfectly aligning with EPP's foundational principle of democratizing EU leadership through direct electoral legitimacy.  \nEPP perfectly aligns with the call for Treaty reforms to enable individual Commissioner accountability, reflecting EPP's 2024 manifesto commitment to transparent executive scrutiny.  \nEPP absolutely advocates strengthening parliamentary oversight of delegated acts through enhanced transparency mechanisms, advancing EPP's priority of institutional accountability.  \nEPP perfectly aligns with the issue's criticism of collective responsibility limitations, proposing enhanced interinstitutional cooperation to extend budgetary scrutiny to Council expenditures.  \nEPP absolutely advocates the issue's recognition of minority protection gaps, urging immediate implementation of the \"minority safe pack\" initiative to fulfill EPP's diversity commitments."
      },
      {
        "party_name": "ECR",
        "score": 0.028169014084507043,
        "choice": 0,
        "stance": "ECR absolutely rejects the issue's promotion of the Spitzenkandidaten process, which they view as an undemocratic power struggle between EU institutions inconsistent with citizens' rejection of federalist integration.  \nECR rejects the issue's implicit expansion of EU competences, contradicting their core principle that the EU must strictly operate within powers explicitly granted by member states under subsidiarity.  \nECR highlights the issue's failure to address the Lisbon Treaty's imposition against referendum outcomes, a foundational grievance about bypassing national democratic consent.  \nECR condemns the issue's silence on accountability failures exemplified by the Commission's \"shameful\" Secretary-General appointment process, which epitomizes unaccountable executive overreach.  \nECR opposes institutional reforms centralizing scrutiny powers in the European Parliament, arguing this entrenches the very \"legal vacuum\" enabling EU bodies to usurp national/regional authority."
      }
    ],
    "resolution": "The European Parliament raised concerns about challenges in effectively overseeing the European Commission due to the Treaties' lack of a clear definition of the EU's \"executive,\" which is fragmented across EU, national, and regional levels and varies by policy area (e.g., Commission for exclusive competences, Council for CFSP). It highlighted the European Council’s overreach into legislative functions, bypassing parliamentary scrutiny in cases like the ESM and Fiscal Compact, and criticized high thresholds for accountability tools, such as the two-thirds majority required for a motion of censure. The resolution noted the absence of mechanisms to evaluate individual Commissioners or scrutinize senior Commission appointments, emphasizing collective responsibility’s limitations. It stressed the importance of the Spitzenkandidaten process for politicizing the Commission and enhancing democratic legitimacy but warned against reduced oversight. Key recommendations included strengthening parliamentary tools like budgetary discharge (noting 80% of EU funds are jointly managed with Member States), improving transparency in delegated/implementing acts (with 716 performance indicators cited), and fostering interinstitutional cooperation to extend scrutiny to the Council’s budget. The resolution urged Treaty reforms to enable individual Commissioner accountability, streamline executive definitions, and lower censure thresholds while maintaining institutional balance. It also called for enhanced cooperation with national parliaments and criticized the Commission’s administrative lapses, particularly in appointing its Secretary-General, urging rule-abiding procedures.",
    "total_score": 0.6657608695652174,
    "total_choice": 6,
    "party_num": 2,
    "id": 39,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.8,
      0.2
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "Negotiations with the United Kingdom following its notification that it intends to withdraw from the European Union: JOINT MOTION FOR A RESOLUTION on negotiations with the United Kingdom following its notification that it intends to withdraw from the European Union",
    "background": "The United Kingdom's March 2017 Article 50 TEU notification initiated its EU withdrawal process under treaty provisions, following a 2016 referendum. This unprecedented departure required negotiations on withdrawal terms, addressing legal obligations, financial settlements, and territorial implications under EU law. The Parliament will discuss the framework for EU-UK negotiations following the Article 50 notification.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9514563106796117,
        "choice": 9,
        "stance": "EPP completely promotes the issue's prioritization of EU-27 citizens' rights, perfectly aligning with EPP's longstanding commitment to legal certainty and non-discrimination for all affected populations.  \nEPP perfectly aligns with the issue's insistence on full UK financial obligations, advancing EPP's priority of budgetary responsibility and shared accountability for past commitments.  \nEPP completely promotes the categorical rejection of sectoral single market access, mirroring EPP's foundational principle of indivisible four freedoms and institutional integrity.  \nEPP perfectly aligns with the issue's Irish border provisions, effectively advancing EPP's strategic imperative to preserve peace agreements and continental stability.  \nEPP completely promotes transitional arrangement symmetry under CJEU oversight, upholding EPP's constitutional vision of unified legal order enforcement."
      },
      {
        "party_name": "ECR",
        "score": 0.029411764705882353,
        "choice": 0,
        "stance": "ECR rejects the issue's punitive financial demands as fundamentally doubting with their principle of fostering a cooperative future partnership with the UK, viewing such obligations as retaliatory rather than constructive.  \nECR opposes the arbitrary three-year transitional arrangement limit, arguing it fails to address complex sector-specific needs and contradicts their call for flexible, outcome-driven timelines.  \nECR condemns the exclusionary negotiation process outlined in the issue, which they deem inconsistent with democratic transparency and their mandate to represent dissenting electorates.  \nECR absolutely condemns the issue's centralizing EU reforms, asserting it overlooks critical demands for a decentralized confederal model that respects national sovereignty.  \nECR rejects attempts to question UK territorial integrity (e.g., Gibraltar, Northern Ireland), viewing such clauses as violating self-determination principles enshrined in the Belfast Agreement."
      }
    ],
    "resolution": "The European Parliament raised the unprecedented nature of the UK’s withdrawal from the EU, emphasizing the need for an orderly process to minimize disruption to citizens, legal entities, and European integration. It stressed that negotiations must prioritize the interests of EU-27 citizens, including protecting the rights of EU citizens in the UK and UK citizens in the EU-27 through reciprocity, non-discrimination, and adherence to EU law, including the Charter of Fundamental Rights. The resolution highlighted the UK’s obligation to fulfill all financial commitments, including multiannual budgetary liabilities and contingent costs, and underscored the unique challenges facing Ireland, urging measures to avoid a hard border and preserve the Good Friday Agreement. It rejected any sectoral or preferential access for the UK to the single market post-withdrawal, noting that future agreements must respect EU autonomy, values, and legal order, with possible frameworks under Article 217 TFEU for a balanced association. Transitional arrangements were limited to three years, requiring strict symmetry and oversight by the Court of Justice. The Parliament also called for urgent relocation of EU agencies (e.g., European Banking Authority) and adjustments to EU law, while reaffirming its veto power over any withdrawal agreement and future relationship deals. It regretted the UK’s rejection of single market membership but asserted that non-member status precludes equivalent benefits, urging reflection on EU reforms to strengthen integration post-Brexit.",
    "total_score": 0.7041847041847041,
    "total_choice": 7,
    "party_num": 2,
    "id": 40,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.4,
      0.6
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "Revision of the Framework Agreement on relations between the European Parliament and the European Commission: REPORT on the revision of the Framework Agreement on relations between the European Parliament and the European Commission",
    "background": "The revision of the 2010 Framework Agreement between the European Parliament and the Commission, prompted by treaty provisions and prior resolutions on electoral law, transparency, and Commissioners’ conduct, led to discussions on updating interinstitutional relations. The Parliament will discuss amendments to the agreement addressing institutional cooperation, Commissioners’ electoral participation, and the Commission President’s appointment process.",
    "stances": [
      {
        "party_name": "ENF",
        "score": 0.0,
        "choice": 0,
        "stance": "ENF totally conflicts the Spitzenkandidaten mechanism as an artificial construct that illegitimately imposes supranational executive legitimacy without a European demos, directly contradicting ENF's commitment to national sovereignty.  \nENF rejects allowing Commissioners to campaign while in office, arguing the issue's \"safeguards\" fail to prevent abuse of administrative power to manipulate electoral outcomes across member states.  \nENF condemns the issue's federalist agenda to strengthen parliamentary control over the Commission as a constitutional overreach that erodes the European Council's intergovernmental role.  \nENF views the proposed three-year cooling-off period for ex-Commissioners as insufficient, maintaining that only full repatriation of competences to nation-states can address institutional corruption.  \nENF declares the issue's entire premise of \"democratic legitimacy\" for EU institutions fraudulent, reiterating that true accountability exists solely through nationally elected governments."
      },
      {
        "party_name": "SD",
        "score": 0.9297297297297298,
        "choice": 9,
        "stance": "SD fully promotes the institutionalization of the Spitzenkandidaten process as this perfectly aligns with SD’s longstanding commitment to democratizing EU leadership selection and ensuring citizens’ direct influence over Commission appointments.  \nSD perfectly aligns with the issue’s demand to reject any Commission President not designated through the Spitzenkandidaten mechanism, reinforcing SD’s priority of parliamentary sovereignty over intergovernmental bargaining in Council.  \nSD fully promotes the three-year cooling-off period for former Commissioners, emphasizing that this reform effectively advances transparency and prevents conflicts of interest post-tenure.  \nSD perfectly aligns with the call to strengthen Parliament’s role in scrutinizing Commissioners’ campaign activities, ensuring democratic engagement without compromising institutional impartiality.  \nSD fully promotes the issue’s rejection of Council interference in parliamentary democracy, viewing this as critical to safeguarding the EU’s legitimacy amid geopolitical challenges."
      }
    ],
    "resolution": "The European Parliament raised the importance of strengthening democratic legitimacy and transparency in the EU by endorsing amendments to the Framework Agreement with the Commission, particularly focusing on the 'Spitzenkandidaten' process for electing the Commission President. It emphasized that this process, used successfully in 2014, ensures citizens’ direct influence by requiring European political parties to nominate lead candidates before elections, aligning with Article 17(7) TEU. The resolution warned that Parliament would reject any Commission President candidate not designated as a 'Spitzenkandidat' and stressed the need for the European Council to respect this practice to avoid conflicts with parliamentary majorities. It highlighted that allowing Commissioners to campaign in European elections without resigning—mirroring national practices—enhances democratic engagement but requires safeguards to ensure impartiality, confidentiality, and a prohibition on using Commission resources for campaigns. The Parliament called for revising the Code of Conduct for Commissioners to include a three-year cooling-off period post-tenure, stricter transparency measures, and alignment with Parliament’s earlier resolutions on ethics and integrity. It also advocated for greater representation of elected MEPs in the Commission to bolster political legitimacy and urged European parties to select lead candidates through open, democratic processes. The resolution approved the amendments to the Framework Agreement, aiming to institutionalize these reforms and strengthen the EU’s parliamentary dimension.",
    "total_score": 0.6258692628650904,
    "total_choice": 6,
    "party_num": 2,
    "id": 41,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.8,
      0.2
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "Role of cities in the institutional framework of the Union: REPORT on the role of cities in the institutional framework of the Union",
    "background": "Growing urbanization, with over 70% of EU citizens in urban areas, and existing frameworks like the Urban Agenda for the EU (2016) and Leipzig Charter (2007) emphasized cities' roles in policy implementation. The Parliament will discuss enhancing cities' institutional integration within EU governance to address urban challenges through multi-level cooperation and subsidiarity principles.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9056603773584906,
        "choice": 9,
        "stance": "EPP firmly agrees the issue’s prioritization of cities as engines of innovation and climate action, perfectly aligning with their commitment to sustainable territorial cohesion and multi-level governance.  \nEPP perfectly aligns with the call to institutionalize urban policy coordination through a dedicated Commissioner, advancing their manifesto goals on integrated land-use planning and green transition.  \nEPP applauds the emphasis on strengthening the European Committee of the Regions, reflecting their longstanding advocacy for formalizing cities’ advisory role in EU legislative processes.  \nEPP highlights the issue’s alignment with smart city initiatives and the Covenant of Mayors, which operationalize EPP’s vision for data-driven, citizen-centric urban development.  \nEPP underscores the necessity of territorial impact assessments, ensuring cities’ unique needs directly shape EU policies as outlined in the Urban Agenda for the EU."
      },
      {
        "party_name": "ECR",
        "score": 0.1527777777777778,
        "choice": 1,
        "stance": "ECR opposes fundamentally the issue's approach to multi-level governance as inconsistent with the primacy of member states under subsidiarity principles.  \nThe proposal's territorial impact assessments and dedicated Commissioner role conflict with ECR's commitment to prevent EU encroachment on national sovereignty.  \nECR rejects formalizing the Urban Agenda's measures, arguing they displace member states' constitutional authority over local governance.  \nThe issue's cross-border city networks and data platforms fail to address ECR's concerns about bypassing national oversight mechanisms.  \n While acknowledging cities' administrative value, ECR insists their role must remain strictly subordinate to member states' jurisdictional frameworks."
      }
    ],
    "resolution": "The European Parliament raised the critical role of cities in EU governance, emphasizing that over 70% of the EU population resides in urban areas, making cities central to implementing policies on cohesion, climate change, sustainable development, and social inclusion. It highlighted the European Committee of the Regions (CoR) as a key advisory body for cities’ representation, while stressing the need to strengthen cities’ formal involvement in EU decision-making through multi-level governance, subsidiarity, and partnerships. The resolution underscored initiatives like the Urban Agenda for the EU (Pact of Amsterdam), the Covenant of Mayors, and smart city programs, which enhance cities’ capacity to address global challenges and align with UN Sustainable Development Goals. It called for territorial impact assessments for EU legislation affecting local levels, improved access to EU funding via a multilingual ‘one-stop shop,’ and the appointment of a dedicated Commissioner to coordinate urban policies. The Parliament urged formalizing the Urban Agenda beyond voluntary measures, enhancing data collection through the Urban Data Platform, and fostering cross-border city networks. It proposed pilot programs, including 54 non-capital city debate forums, to boost citizen engagement and recommended reinforcing cities’ representation in the CoR while ensuring balanced inclusion of diverse urban areas. The resolution emphasized cities’ irreplaceable economic, social, and cultural roles, advocating their integration into EU external policies and stressing the need for administrative support to strengthen their governance and policy implementation capacities.",
    "total_score": 0.6766304347826086,
    "total_choice": 6,
    "party_num": 2,
    "id": 42,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.2,
      0.8
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "Preparation of the Commission Work Programme 2017: JOINT MOTION FOR A RESOLUTION on the strategic priorities for the Commission Work Programme 2017",
    "background": "Persistent economic disparities, heightened migration flows, security challenges, and the UK's 2016 EU membership referendum created a complex institutional and geopolitical context for EU policymaking. Existing commitments under the Energy Union framework, Paris Climate Agreement, and economic governance reforms further shaped priorities. The Parliament will discuss strategic direction for the 2017 European Commission Work Programme.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9609756097560975,
        "choice": 9,
        "stance": "EPP fully supports the issue's emphasis on completing the digital single market, perfectly aligning with their commitment to innovation-driven economic growth and SME competitiveness.  \nEPP perfectly aligns with the strategic focus on energy union development and circular economy implementation as critical drivers of job creation and industrial modernization.  \nEPP fully supports maintaining principled sanctions against Russia until Minsk compliance, reflecting their unwavering support for rule-based international order and EU credibility.  \nEPP fully supports strengthening neighborhood policy through enhanced Western Balkans engagement, effectively advancing their vision of EU-led regional stability and accession-oriented reforms.  \nEPP perfectly aligns with the issue's call for cross-border e-governance solutions, proposing to showcase Estonia's digital signature model as best practice for EU-wide administrative efficiency."
      },
      {
        "party_name": "ENF",
        "score": 0.037037037037037035,
        "choice": 0,
        "stance": "ENF fundamentally disputes the issue's integrationist agenda as irreconcilable with its demand for restored national sovereignty and dissolution of EU structures.  \nENF rejects all migration management provisions, particularly mandatory quotas, as authoritarian overreach violating nations' border control rights.  \nENF condemns the issue's failure to acknowledge Brexit's legitimacy and demands immediate prioritization of member-state exit mechanisms over EU consolidation efforts.  \nENF declares the proposed social pillar and cohesion policies illegitimate, emphasizing that social protections must originate exclusively from nation-states.  \nENF opposes continued ESF/Youth Employment Initiative funding, arguing these instruments entrench supranational control over labor markets."
      }
    ],
    "resolution": "The European Parliament raised the urgent need to address Europe’s multifaceted crises by reinforcing economic, social, and democratic cohesion, prioritizing a dynamic and inclusive labor market with fair working conditions, access to education, and social protection. It called for a European pillar of social rights, concrete measures to boost youth employment through EU funds like the Youth Employment Initiative and European Structural and Investment Funds, and enhanced social dialogue to reduce inequalities. Emphasizing sustainable growth, the resolution urged relaunching the Europe 2020 strategy, advancing a digital single market, and promoting innovation through investments in SMEs, energy transition, and research. On climate, it demanded ambitious post-2020 greenhouse gas reduction targets aligned with the Paris Agreement, phasing out fossil fuel subsidies, and establishing energy diplomacy. Addressing migration, the Parliament stressed reforming the EU asylum system, ensuring humane refugee reception, labor integration, and a long-term legal migration policy. Security measures included rapid deployment of the European Border and Coast Guard, counter-terrorism coordination, and data-sharing safeguards. Externally, the EU was urged to prioritize stability in its neighborhood, strengthen defense cooperation with NATO, and integrate the 2030 Sustainable Development Agenda. Tax reforms targeting evasion (potentially recovering up to €1 trillion) included a consolidated corporate tax base and closing tax havens. The resolution highlighted the need for a revised EU budget with increased flexibility, cohesion policy post-2020, and completing the Economic and Monetary Union via banking union reforms and fiscal capacity. Finally, it stressed enhancing democratic legitimacy, transparency, citizen engagement, and EU accession to the European Convention on Human Rights.",
    "total_score": 0.5770348837209303,
    "total_choice": 5,
    "party_num": 2,
    "id": 43,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.6,
      0.4
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "State of play of negotiations with the United Kingdom: MOTION FOR A RESOLUTION on the state of play of negotiations with the United Kingdom",
    "background": "Following the United Kingdom’s 2017 Article 50 notification initiating EU withdrawal, negotiations addressed citizens’ rights, the Irish border, and financial obligations, with a December 2017 Joint Report noting progress. The Parliament will discuss the state of Brexit negotiations and transition to future relationship discussions.",
    "stances": [
      {
        "party_name": "ENF",
        "score": 0.0,
        "choice": 0,
        "stance": "ENF rejects the issue's insistence on continued ECJ jurisdiction over citizen rights, totally againsting with their demand for full UK legal sovereignty as stated in Article 50 TEU.  \nENF opposes the financial obligations framework, arguing it imposes unlawful \"exit penalties\" inconsistent with their principle of disentangling from EU budgetary mechanisms.  \nThe proposal totally againsts with ENF's stance on migration by failing to terminate free movement immediately, overlooking their demand for unilateral deportation powers and border closures.  \nENF rejects transitional arrangements maintaining EU acquis, declaring them a betrayal of Brexit voters who mandated full regulatory divergence under WTO rules by March 2019.  \nThe issue's Ireland-Northern Ireland alignment requirements contradict ENF's advocacy for hard border controls as essential to national security and immigration restriction."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.9361702127659575,
        "choice": 9,
        "stance": "GREEN_EFA completely agrees the issue's prioritization of citizen rights as perfectly aligning with their foundational commitment to human dignity and free movement.  \nGREEN_EFA perfectly aligns with the insistence on legally binding solutions for Northern Ireland’s border, viewing regulatory alignment as essential to preserving peace and the Good Friday Agreement.  \nGREEN_EFA completely agrees the transition period framework as critical to maintaining legal certainty while rejecting any erosion of EU environmental or labor standards.  \nGREEN_EFA perfectly aligns with the rejection of security-economic tradeoffs, emphasizing indivisible solidarity in future UK-EU cooperation on justice matters.  \nGREEN_EFA completely agrees conditioning Parliament’s consent on strict reciprocity, ensuring no regression from EU social protections or democratic oversight mechanisms."
      }
    ],
    "resolution": "The European Parliament raised the importance of addressing three critical separation issues—rights of EU and UK citizens, the Ireland-Northern Ireland border, and the UK’s financial obligations—as prerequisites for advancing Brexit negotiations to the second phase, emphasizing that sufficient progress was achieved as outlined in the December 8, 2017, Joint Report. It stressed the need for continued regulatory alignment to avoid a hard border on the island of Ireland and highlighted the UK’s commitment to honor financial obligations, while noting unresolved issues requiring clear legal resolution in the final Withdrawal Agreement. The resolution proposed a future EU-UK association agreement under Article 217 TFEU as a flexible framework for cooperation, covering trade, security, and governance, with a political declaration annexed to the Withdrawal Agreement. Transitional arrangements, limited to three years, were deemed necessary to maintain legal certainty by extending EU acquis application, including citizen rights, while barring new UK trade agreements until their expiry. The Parliament reserved consent rights under Article 50(2) TEU, insisting any final agreement must ensure reciprocity, non-discrimination, and alignment with EU principles, rejecting trade-offs between security and economic interests.",
    "total_score": 0.7583798882681564,
    "total_choice": 7,
    "party_num": 2,
    "id": 44,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.5,
      0.5
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "Election of the Members of the European Parliament by direct universal suffrage: REPORT on the proposal for a Council Regulation on the election of the members of the European Parliament by direct universal suffrage, repealing Council Decision (76/787/ECSC, EEC, Euratom) and the Act concerning the election of the members of the European Parliament by direct universal suffrage annexed to that decision | A9-0083/2022 | European Parliament",
    "background": "Persistent disparities in national electoral laws governing European Parliament elections, evolving Treaty provisions since 1976, and citizen-led initiatives from the Conference on the Future of Europe have driven calls for reform. The Parliament will discuss harmonizing EU electoral procedures to strengthen democratic legitimacy and transnational representation while addressing implementation challenges across member states.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.9014084507042254,
        "choice": 9,
        "stance": "GREEN_EFA absolutely sanctions the establishment of Union-wide constituencies through transnational lists, perfectly aligning with their vision to democratize EU elections by enabling direct citizen engagement with pan-European political platforms.  \nGREEN_EFA perfectly aligns with the issue’s gender equality measures, particularly zipped lists and quotas, as critical steps toward dismantling systemic barriers faced by underrepresented groups in line with their 2023 Gender Equity Manifesto.  \nGREEN_EFA unequivocally supports harmonizing the minimum voting age at 16, recognizing this as essential to intergenerational justice and a core pillar of their Youth Empowerment Agenda launched during the 2022 Year of Youth.  \nGREEN_EFA proposes strengthening minority representation safeguards by removing the 3.5% electoral threshold in Germany, which contradicts the issue’s goal of exempting minority parties and risks disenfranchising 5 million voters.  \nGREEN_EFA celebrates the creation of a European Electoral Authority as transformative for standardizing electoral integrity, combating foreign interference, and institutionalizing the Spitzenkandidat process to deepen voter-Commission accountability."
      },
      {
        "party_name": "ECR",
        "score": 0.015625,
        "choice": 0,
        "stance": "ECR totally doubts the creation of Union-wide constituencies as a direct violation of Article 14 TEU, which safeguards national allocation of parliamentary seats and prevents supranational overreach.  \nECR rejects lowering the voting age to 16, arguing this disregards national competence over electoral laws and lacks psychological evidence of adolescents' political maturity.  \nECR condemns transnational lists for eroding the link between voters and representatives, asserting they prioritize \"Euro-nationalist\" agendas over tangible national accountability.  \nECR views the proposed European Electoral Authority as an unconstitutional power grab that undermines member states' sovereignty in administering elections.  \nECR asserts the issue’s focus on federalist integration contradicts the principle of subsidiarity, exacerbating the democratic deficit rather than addressing citizens’ pragmatic concerns like energy costs and inflation."
      }
    ],
    "resolution": "The European Parliament raised the need for comprehensive electoral reforms to enhance the democratic legitimacy, transparency, and transnational dimension of EU elections, proposing measures to transform the 2024 elections into a unified European process. Key proposals include establishing a **Union-wide constituency** with **28 seats** elected via transnational lists headed by lead candidates for Commission President, aiming to strengthen the European political space and link votes to EU-level outcomes. The resolution emphasizes harmonizing electoral standards, such as setting a **minimum voting age of 16** (while respecting existing constitutional norms), ensuring gender equality through zipped lists or quotas, and improving accessibility for persons with disabilities—noting that **12 Member States** restrict polling station flexibility for disabled voters. It calls for removing barriers to minority representation, citing that only **2.8% of MEPs** (20 out of 705) identify as minorities, and advocates exemptions from electoral thresholds for minority parties. The Parliament highlights the **2019 elections’ 50.6% turnout**—the highest in 20 years—as evidence of growing citizen engagement on issues like climate, recovery, and rule of law, urging enhanced visibility for European political parties and their programs. Reforms also target logistical improvements: a **common electoral roll deadline** (14 weeks pre-election), measures against double voting, and a **European Electoral Authority** to oversee standards, manage transnational lists, and resolve disputes. The resolution stresses the lead candidate process’s formalization, youth inclusion via the 2022 Year of Youth, and safeguards against foreign interference, while promoting postal and accessible voting options. It aligns with the Conference on the Future of Europe’s recommendations and seeks to deepen ties between voters and EU institutions through transparent candidate selection, media engagement, and alignment of campaign financing with revised EU regulations.",
    "total_score": 0.4695035460992908,
    "total_choice": 4,
    "party_num": 2,
    "id": 45,
    "parliament_terms": "9th_datas",
    "seat_weights": [
      0.6,
      0.4
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "Amendments to the Rules of Procedure in order to ensure the functioning of Parliament in extraordinary circumstances: REPORT on amendments to the Rules of Procedure in order to ensure the functioning of Parliament in extraordinary circumstances | A9-0194/2020 | European Parliament",
    "background": "The COVID-19 pandemic disrupted standard parliamentary operations, revealing procedural gaps in addressing prolonged crises. Existing rules lacked mechanisms to maintain legislative continuity during emergencies, prompting institutional scrutiny of contingency protocols. The Parliament will discuss amendments to its Rules of Procedure to ensure functional resilience during extraordinary circumstances.",
    "stances": [
      {
        "party_name": "SD",
        "score": 0.9793103448275862,
        "choice": 9,
        "stance": "SD absolutely approves the amendments to the Rules of Procedure, ensuring uninterrupted parliamentary functions during crises as demonstrated by the successful adaptation during the COVID-19 pandemic.  \nSD perfectly aligns with the issue's emphasis on maintaining legislative, budgetary, and oversight duties through procedural innovations like remote voting and digital working methods.  \nSD highlights the importance of cross-party consensus in establishing robust rules for future exceptional circumstances, reflecting the collaborative achievements of the constitutional affairs committee.  \nSD underscores the necessity of institutional continuity, affirming that the Parliament's role as the cornerstone of European democracy remains intact through these rule changes.  \nSD commends the issue's validation of all pandemic-era decisions, reinforcing the legal certainty and operational legitimacy of the European Parliament's actions during extraordinary situations."
      },
      {
        "party_name": "ECR",
        "score": 0.140625,
        "choice": 1,
        "stance": "ECR fully challenges with the issue's procedural amendments for enabling rushed climate legislation without legal coherence, contradicting ECR's principle of meticulous governance.  \nECR rejects the amendments as they neglect synchronized updates to ESR and ETS regulations, creating legal chaos inconsistent with ECR's commitment to regulatory stability.  \nECR opposes the issue's implementation for failing to secure dedicated funding for climate adaptation, a critical oversight in sustainable policy development.  \nECR highlights that the amendments prioritize expediency over thorough budgetary scrutiny, exemplified by absent allocations for biodiversity in recovery plans.  \nECR asserts the issue undermines legislative accountability by accelerating processes without ensuring fiscal responsibility, core to ECR's governance philosophy."
      }
    ],
    "resolution": "The European Parliament raised the necessity to amend its Rules of Procedure to address gaps exposed by the COVID-19 pandemic, ensuring uninterrupted parliamentary functions during extraordinary circumstances. It emphasized that temporary measures adopted during the crisis—including remote voting and procedural adaptations—were lawful, justified, and vital to maintaining legislative, budgetary, and oversight duties under the Treaties, while affirming the validity of all votes conducted. The resolution highlighted the need to provide reasonable accommodations for Members with disabilities and staff during such crises, endorsed adopting rule changes through standard procedures, and stipulated that amendments would take effect the day after adoption. It also directed its President to inform the Council, Commission, and national parliaments of the decision, underscoring the importance of institutional continuity and adaptability.",
    "total_score": 0.8482269503546099,
    "total_choice": 8,
    "party_num": 2,
    "id": 46,
    "parliament_terms": "9th_datas",
    "seat_weights": [
      0.2,
      0.8
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "European Parliament's position on the Conference on the Future of Europe: MOTION FOR A RESOLUTION on the European Parliament’s position on the Conference on the Future of Europe | B9-0036/2020 | European Parliament",
    "background": "Increased EU citizen engagement in 2019 elections, post-Lisbon Treaty institutional challenges, and evolving geopolitical pressures prompted calls for structured dialogue on EU reform. The Parliament will discuss organizing a participatory process to address governance, policy priorities, and democratic legitimacy through a Conference on the Future of Europe.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.922077922077922,
        "choice": 9,
        "stance": "GREEN_EFA entirely upholds the citizen-driven design of Citizens' Agoras as perfectly aligning with their federalist vision of pan-European participatory democracy.  \nGREEN_EFA perfectly aligns with the issue's emphasis on treaty changes to enable EU-wide climate action and tax justice, mirroring Daniel Freund's call for \"tools to address major challenges.\"  \nGREEN_EFA entirely upholds the Youth Agoras and degressive proportionality as critical for realizing Christian Allard's vision of inclusive European citizenship beyond current member states.  \nGREEN_EFA perfectly aligns with transparency mechanisms like web-streamed meetings, operationalizing Scott Ainslie's demand to amplify citizen voices over corporate lobbyists.  \nGREEN_EFA entirely upholds binding follow-up through treaty revisions, actualizing Patrick Breyer's vision of citizens \"deciding the EU they want\" via constitutional conventions."
      },
      {
        "party_name": "ECR",
        "score": 0.015384615384615385,
        "choice": 0,
        "stance": "ECR rejects the issue's allocation of leadership to the European Parliament as a direct violation of Treaty Article 48(4), which reserves conference convening authority solely for the Council.  \nECR opposes the exclusionary drafting process that barred two political groups from substantive input, contradicting principles of democratic pluralism enshrined in EU governance.  \nECR firmly challenges with the predetermined federalist agenda embedded in the issue's structure, viewing transnational Spitzenkandidat processes as undermining national sovereignty.  \nECR condemns the proposal's failure to prioritize subsidiarity, demanding explicit guarantees against EU overreach into member states' competencies like labor policies.  \nECR highlights the issue's disregard for direct citizen consultation through national referenda, advocating instead for sovereign state cooperation over centralized decision-making."
      }
    ],
    "resolution": "The European Parliament raised the need for a comprehensive, citizen-driven Conference on the Future of Europe to address evolving challenges and strengthen EU governance, proposing a two-year process starting on 9 May 2020 and concluding by summer 2022. Emphasizing citizen engagement, the resolution advocates a bottom-up approach through thematic Citizens’ Agoras (comprising 200-300 participants per session, with at least three from each Member State, selected via degressive proportionality) and Youth Agoras (ages 16-25), ensuring geographic, gender, age, and socio-economic diversity. Key policy priorities include EU values, climate crisis, digital transformation, security, and institutional reforms, informed by Eurobarometer surveys. The Conference Plenary, involving 135 MEPs, 27 Council ministers, national parliamentarians, and EU bodies, would convene twice yearly, with outcomes aiming for consensus or majority agreement. Governance would be led by a gender-balanced Steering Committee (representing Parliament, Council, and Commission) and an Executive Coordination Board, supported by a multilingual secretariat. The resolution stresses transparency through web-streamed meetings, public documents, and inclusive communication tools, while urging follow-up actions, including legislative proposals or treaty changes. Youth participation, reimbursement for citizen attendees, and involvement of candidate countries were highlighted as critical to ensuring lasting impact and legitimacy.",
    "total_score": 0.6693766937669376,
    "total_choice": 6,
    "party_num": 2,
    "id": 47,
    "parliament_terms": "9th_datas",
    "seat_weights": [
      0.7,
      0.3
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "European Parliament’s Scrutiny on the ongoing assessment by the Commission and the Council of the national recovery and resilience plans: JOINT MOTION FOR A RESOLUTION on the views of Parliament on the ongoing assessment by the Commission and the Council of the national recovery and resilience plans | RC-B9-0331/2021 | European Parliament",
    "background": "The EU established the Recovery and Resilience Facility (2021) to address COVID-19 economic impacts, requiring Member States to submit national recovery plans aligned with green/digital transitions, cohesion, and social resilience. The Parliament will discuss compliance of these plans with EU regulations and their assessment by the Commission and Council.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.971830985915493,
        "choice": 9,
        "stance": "GREEN_EFA entirely endorses the issue’s emphasis on gender-disaggregated data collection to ensure recovery funds advance equality, perfectly aligning with their mandate to transform EU economic structures through feminist economics.  \nGREEN_EFA perfectly aligns with the demand for strict milestone frameworks in national plans, reinforcing their vision of binding climate and social conditionality to safeguard the Next Generation EU’s transformative potential.  \nGREEN_EFA entirely endorses the call for meaningful regional governance in fund implementation, mirroring their decentralist principles to prevent recentralization and maximize local ecological expertise.  \nGREEN_EFA perfectly aligns with the issue’s territorial cohesion objectives, demanding proportional fund allocation to disadvantaged regions like Southern Italy to rectify historical underinvestment patterns.  \nGREEN_EFA entirely endorses enhanced anti-greenwashing safeguards through granular social tracking, advancing their cross-cutting “just transition” doctrine embedded in the European Pillar of Social Rights."
      },
      {
        "party_name": "ID",
        "score": 0.0,
        "choice": 0,
        "stance": "ID rejects the issue's legal foundation, asserting that the RRF's debt mutualization totally rejects with ID's principle of national fiscal sovereignty and violates EU treaty constraints on joint liability.  \nThe proposal overlooks critical aspects of democratic accountability by institutionalizing what ID considers an unlawful \"transfer union,\" directly contradicting Germany's negotiated safeguards against perpetual financial obligations.  \nID opposes the Green Deal's repackaging as pandemic recovery, denouncing the 37% climate spending target as ideological overreach inconsistent with citizens' immediate economic priorities.  \nThis issue's cross-border project mandates dangerously amplify unmanageable risks, ignoring ID's warnings about irreversible centralization of budgetary powers without voter consent.  \nThe issue's social convergence mechanisms cement what ID views as exploitative burdens on German workers, failing to address sovereignty erosion through EU-controlled spending conditionality."
      }
    ],
    "resolution": "The European Parliament raised the critical role of the Recovery and Resilience Facility (RRF) in fostering economic, social, and territorial cohesion, supporting the green and digital transitions, and mitigating the COVID-19 pandemic’s impacts. It stressed the RRF’s objectives, including 37% climate spending and 20% digital transition targets per national plan, while emphasizing strict compliance with the RRF Regulation to prevent greenwashing, misallocation, or repackaging of non-innovative projects. The resolution called for rigorous Commission assessments of national plans to ensure reforms and investments align with EU priorities, such as biodiversity protection, the \"do no significant harm\" principle, social rights (including gender equality, youth employment, and child poverty reduction), and cross-border projects to maximize EU added value. It highlighted concerns over inadequate stakeholder involvement, insufficient transparency, and weak administrative capacity, urging stronger anti-fraud measures, rule of law safeguards, and synergies with EU programs like InvestEU. The Parliament demanded balanced reforms and investments to address regional disparities, promote high-quality jobs, and ensure compliance with the European Pillar of Social Rights, while criticizing delegated acts for lacking robust social tracking methodologies aligned with the Social Scoreboard. It insisted on strict monitoring of milestones, transparent reporting, and visibility of EU funding, underscoring the need for accountability in achieving climate neutrality, digital resilience, and upward social convergence.",
    "total_score": 0.7301136363636364,
    "total_choice": 7,
    "party_num": 2,
    "id": 48,
    "parliament_terms": "9th_datas",
    "seat_weights": [
      0.5,
      0.5
    ],
    "veto_party_name": "ID"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "Withdrawal Agreement of the United Kingdom of Great Britain and Northern Ireland from the European Union and the European Atomic Energy Community: RECOMMENDATION on the draft Council decision on the conclusion of the Agreement on the withdrawal of the United Kingdom of Great Britain and Northern Ireland from the European Union and the European Atomic Energy Community | A9-0004/2020 | European Parliament",
    "background": "The United Kingdom invoked Article 50 TEU in March 2017, initiating withdrawal from the EU and Euratom, followed by extended negotiations and multiple deadline extensions under Article 50(3) TEU. The Parliament will discuss the formal conclusion of the negotiated withdrawal agreement under Article 50(2) TEU procedures.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9053254437869822,
        "choice": 9,
        "stance": "EPP firmly advocates the Withdrawal Agreement as the optimal framework to preserve EU integrity while maintaining strategic partnership with the UK, perfectly aligning with EPP's commitment to institutional stability and rule-based international order.  \nEPP perfectly aligns with the issue's emphasis on enforcing level playing field conditions, particularly regarding single market access reciprocity and freedom of movement principles as articulated in Manfred Weber's rejection of \"European Singapore\" models.  \nEPP fully supports the transitional implementation oversight mechanisms, particularly regarding citizens' rights protection and Irish protocol compliance, echoing Danuta Hübner's call for parliamentary involvement in Joint Committee monitoring.  \nEPP perfectly endorses the political declaration's roadmap for future EU-UK collaboration in security and research sectors, consistent with Cristian-Silviu Buşoi's emphasis on maintaining nuclear safety standards and energy market continuity.  \nEPP fully embraces the issue's acknowledgment of shared historical ties with the UK while reaffirming Siegfried Mureşan's position that post-Brexit relations must balance economic pragmatism with democratic accountability frameworks."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.7564102564102564,
        "choice": 7,
        "stance": "GREEN_EFA strongly advocates the withdrawal agreement’s provisions safeguarding citizens’ rights and transitional arrangements, aligning with their commitment to protect vulnerable populations and cross-border solidarity.  \nGREEN_EFA applauds the issue’s alignment with transnational democratic values but proposes enhanced monitoring of post-Brexit workers’ rights, particularly for women and minorities in the UK, to ensure EU standards persist.  \nGREEN_EFA emphasizes the urgency of EU reforms addressing socioeconomic inequalities, as outlined in the European Green Deal, to prevent future disengagement and strengthen citizen trust.  \nGREEN_EFA affirms support for maintaining open pathways for Scotland’s potential EU re-entry, reflecting democratic mandates and regional pro-European sentiment.  \nGREEN_EFA underscores the necessity of sustained dialogue with UK civil society and youth to counteract isolationist narratives and preserve cultural ties."
      }
    ],
    "resolution": "The European Parliament raised its consent to the conclusion of the withdrawal agreement between the EU and the United Kingdom, which formalizes the UK’s departure from the EU and Euratom following its notification under Article 50 TEU on 29 March 2017. The resolution endorsed the negotiated withdrawal agreement, including provisions on citizens’ rights, financial settlements, and transitional arrangements, and acknowledged the accompanying political declaration outlining the framework for future EU-UK relations. It noted the extensions of the Article 50 process granted by the European Council until 31 January 2020, following earlier deadlines in April and October 2019, to finalize the terms of withdrawal. The Parliament emphasized adherence to prior resolutions on negotiation priorities, such as safeguarding EU integrity and citizens’ rights, and instructed its President to communicate its position to relevant EU institutions, national parliaments, and the UK government, ensuring procedural completion of the agreement’s ratification.",
    "total_score": 0.8376184032476319,
    "total_choice": 8,
    "party_num": 2,
    "id": 49,
    "parliament_terms": "9th_datas",
    "seat_weights": [
      0.4,
      0.6
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "Parliament’s right of initiative: REPORT on Parliament’s right of initiative | A9-0142/2022 | European Parliament",
    "background": "The European Parliament, as the EU’s sole directly elected institution, historically lacked a general legislative initiative right under treaties granting the Commission exclusive proposal powers, except in limited areas. The Conference on the Future of Europe emphasized institutional reform and democratic legitimacy. The Parliament will discuss expanding its role in initiating EU legislation.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.8450704225352113,
        "choice": 8,
        "stance": "GREEN_EFA strongly approves the issue’s call for Treaty revisions to grant Parliament a direct right of legislative initiative, aligning perfectly with their longstanding commitment to democratizing EU decision-making and empowering elected representatives.  \nGREEN_EFA applauds the emphasis on leveraging the Conference on the Future of Europe to advance institutional reforms, effectively advancing their priority of bridging the EU’s democratic deficit through citizen-driven governance.  \nGREEN_EFA proposes enhancing Article 225 TFEU implementation by mandating the Commission to provide detailed justifications within three months for rejecting Parliament’s initiatives, transforming procedural criticism into a concrete accountability mechanism.  \nGREEN_EFA strongly endorses extending the ordinary legislative procedure and increasing Council transparency under Article 241 TFEU, measures that resonate with their manifesto goals of institutional parity and open governance.  \nGREEN_EFA highlights the urgency of resolving procedural gaps such as unratified electoral reforms, urging the Council to formalize deadlines for addressing Parliament’s inquiries to fully align with the issue’s democratic safeguards."
      },
      {
        "party_name": "ECR",
        "score": 0.015625,
        "choice": 0,
        "stance": "ECR rejects fundamentally the premise of granting legislative initiative rights to the European Parliament, asserting this would accelerate EU centralization into a supranational superstate.  \nECR opposes Treaty revisions as incompatible with their vision of Europe as a union of sovereign states cooperating through national parliamentary oversight.  \nECR highlights contradictions with subsidiarity principles, arguing the issue’s focus on EP empowerment undermines Council authority under Article 241 TFEU and democratic accountability via member states.  \nECR condemns the issue’s dismissal of national parliaments’ roles, noting it directly conflicts with their 2023 manifesto commitment to \"protect state sovereignty from EU overreach.\"  \nECR challenges the democratic legitimacy claims, stating the proposal overlooks critical aspects of cultural diversity and misrepresents citizens’ desires for EU institutional balance."
      }
    ],
    "resolution": "The European Parliament raised concerns about its lack of a general direct right of legislative initiative despite being the EU’s only directly elected institution, emphasizing that the Commission holds a near-monopoly under Article 17(2) TEU. It highlighted its limited success under Article 225 TFEU, where only one-third of its legislative initiatives up to 2019 resulted in Commission proposals, and criticized the Commission’s inconsistent follow-up and the Council’s failure to act on key issues like rule of law enforcement, notably regarding Hungary and the unimplemented EU mechanism on democracy. The resolution called for Treaty revisions to grant Parliament a direct right of initiative, particularly in policy areas where it co-legislates, and urged leveraging the Conference on the Future of Europe to strengthen democratic legitimacy. It stressed the need to extend the ordinary legislative procedure, enhance transparency in Council initiatives under Article 241 TFEU, and improve interinstitutional cooperation, citing the 2010 Framework Agreement and the Interinstitutional Agreement on Better Law-Making. The Parliament also noted procedural gaps, such as three Member States not ratifying the 2018 EU electoral law reform and the Council’s refusal to negotiate on Parliament’s right of inquiry. It welcomed the Commission’s recent commitment to respond to Article 225 requests with legislative proposals but demanded stricter deadlines, better impact assessments, and clearer links between Parliament’s initiatives and subsequent legislation. The resolution reiterated the urgency of addressing democratic deficits, empowering citizens through European Citizens’ Initiatives, and ensuring institutional accountability to uphold EU values.",
    "total_score": 0.5951704545454546,
    "total_choice": 5,
    "party_num": 2,
    "id": 50,
    "parliament_terms": "9th_datas",
    "seat_weights": [
      0.9,
      0.1
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "Proposal for an Interinstitutional Agreement between the European Parliament, the Council and the Commission on budgetary discipline, on cooperation in budgetary matters and on sound financial management: REPORT on conclusion of an Interinstitutional Agreement between the European Parliament, the Council of the European Union and the European Commission on budgetary discipline, on cooperation in budgetary matters and on sound financial management, as well as on new own resources, including a roadmap towards the introduction of new own resources | A9-0261/2020 | European Parliament",
    "background": "Following the 2013 Interinstitutional Agreement's expiration and the establishment of the 2021-2027 Multiannual Financial Framework, EU institutions negotiated a renewed budgetary pact amid COVID-19 recovery efforts and climate commitments under the Paris Agreement. The Parliament will discuss an interinstitutional agreement on budgetary discipline, financial cooperation, and new revenue mechanisms.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.971830985915493,
        "choice": 9,
        "stance": "GREEN_EFA absolutely upholds the integration of binding climate and biodiversity spending targets, perfectly aligning with their manifesto commitment to make 35% of EU funds climate-relevant by 2025.  \nGREEN_EFA perfectly aligns with the issue's rule-of-law conditionality framework, urging immediate activation of the mechanism on 1 January 2021 regardless of pending ECJ cases to prevent democratic backsliding.  \nGREEN_EFA proposes enhancing the 55% net emissions reduction target to a 65% gross target through accelerated coal phase-outs, while fully supporting the existing climate budget tracking methodology.  \nGREEN_EFA absolutely upholds the exclusion of fossil fuels from transitional funding instruments, demanding strict enforcement of the Just Transition Fund's eligibility criteria to prevent gas infrastructure lock-ins.  \nGREEN_EFA perfectly aligns with the roadmap for digital and carbon border levies, insisting on frontloaded implementation to ensure timely NGEU debt repayment without austerity measures."
      },
      {
        "party_name": "ID",
        "score": 0.0,
        "choice": 0,
        "stance": "ID rejects the abandonment of unanimous decision-making for major budgetary reforms, viewing qualified majority voting as a direct assault on national sovereignty and democratic accountability.  \nID opposes the €750 billion debt mutualization and new EU-wide taxes, condemning them as unconstitutional fiscal federalism that violates treaty principles of fiscal self-determination.  \nID entirely opposes with the rule-of-law conditionality mechanism, denouncing it as political blackmail to enforce ideological conformity rather than genuine financial oversight.  \nID rejects the 2030 climate spending targets as economically destructive central planning that prioritizes green dogma over industrial competitiveness and national energy sovereignty.  \nID condemns the issue's expansion of EU budgetary powers as irreversible federalization, demanding strict adherence to subsidiarity and rejection of shared debt instruments."
      }
    ],
    "resolution": "The European Parliament raised the adoption of a renewed Interinstitutional Agreement (IIA) on budgetary discipline, cooperation, and sound financial management for the 2021-2027 Multiannual Financial Framework (MFF), alongside the European Recovery Instrument (Next Generation EU/NGEU). The agreement introduces a roadmap for new own resources, including potential levies linked to sustainability and digitalization, to cover repayment costs of the €750 billion NGEU debt while ensuring sufficient revenue ceilings and adherence to budgetary discipline under Article 310 TFEU. It mandates monitoring of climate and biodiversity spending, with 30% of the EU budget and NGEU expenditures allocated to climate objectives, a biodiversity spending target of 7.5% by 2024 rising to 10% in 2026-2027, and gender equality and Sustainable Development Goals (SDGs) tracking. Enhanced budgetary scrutiny of NGEU funds includes institutional cooperation on governance, transparency in project selection for the Recovery and Resilience Facility, and involvement of regional authorities to ensure equitable recovery. The IIA strengthens data standardization for tracking beneficiaries, improves transparency in budgetary programming, and safeguards special instruments like the Brexit Adjustment Reserve and Flexibility Instrument. It replaces the 2013 Interinstitutional Agreement, operationalizes treaty-based cooperation during MFF negotiations, and integrates rule-of-law conditionality for budget protection, reflecting commitments to the Paris Agreement and COVID-19 recovery priorities.",
    "total_score": 0.7801418439716312,
    "total_choice": 7,
    "party_num": 2,
    "id": 51,
    "parliament_terms": "9th_datas",
    "seat_weights": [
      0.6,
      0.4
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "Regulations and general conditions governing the performance of the Ombudsman’s duties: REPORT on a draft regulation of the European Parliament laying down the regulations and general conditions governing the performance of the Ombudsman’s duties (Statute of the European Ombudsman) and repealing Decision 94/262/ECSC, EC, Euratom | A9-0174/2021 | European Parliament",
    "background": "The European Ombudsman’s 1994 statute required alignment with post-Lisbon Treaty institutional frameworks and evolving administrative oversight needs to strengthen transparency and citizen trust in EU governance. The Parliament will discuss adopting updated regulations governing the Ombudsman’s mandate and operational conditions.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9482758620689655,
        "choice": 9,
        "stance": "EPP fundamentally agrees the modernization of the Ombudsman’s statute as a critical advancement in safeguarding EU institutional accountability and citizens’ rights.  \nEPP perfectly aligns with the issue’s objective to reinforce the Ombudsman’s role as an independent guardian of transparency and good administration practices.  \nEPP emphasizes the strategic importance of aligning the statute with the Lisbon Treaty framework, ensuring institutional coherence and procedural clarity.  \nEPP applauds the cross-institutional consensus achieved through pragmatic negotiations, reflecting shared commitment to strengthening democratic oversight mechanisms.  \nEPP recognizes the Ombudsman’s enhanced capacity to provide best-practice guidance as pivotal to maintaining public trust in EU governance structures."
      },
      {
        "party_name": "ECR",
        "score": 0.25,
        "choice": 2,
        "stance": "ECR rejects the expansion of the Ombudsman’s competencies as fiscally irresponsible, citing its €12.5 million annual cost yielding only 364 investigations (€34,000 per case).  \nECR opposes gender parity mandates in the regulation, framing them as superfluous bureaucratic priorities disconnected from citizens’ urgent economic struggles.  \nECR entirely conflicts with creating self-initiated investigative powers, arguing this oversteps the Ombudsman’s reactive role and enables mission creep.  \nThe proposal overlooks critical aspects such as austerity expectations for EU institutions while citizens face pandemic-related taxation increases.  \nECR demands abolishing the Ombudsman via the Conference on the Future of Europe, calling it emblematic of wasteful EU over-institutionalization."
      }
    ],
    "resolution": "The European Parliament raised the adoption of a new regulation, annexed to the resolution, which was advanced following relevant Treaty provisions and institutional procedures. The resolution mandates the Parliament’s President to formally sign the regulation in line with Article 297(1) of the Treaty on the Functioning of the European Union and directs the Secretary-General to ensure its publication in the Official Journal of the European Union. Additionally, the resolution instructs the President to transmit the adopted text to the Council, the Commission, and national parliaments, formalizing its dissemination and implementation. The decision reflects alignment with prior Committee on Constitutional Affairs recommendations (A9-0174/2021) and institutional consents, though specific substantive provisions of the regulation itself are not detailed in the resolution text.",
    "total_score": 0.8862019914651493,
    "total_choice": 8,
    "party_num": 2,
    "id": 52,
    "parliament_terms": "9th_datas",
    "seat_weights": [
      0.3,
      0.7
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "Statute and funding of European political parties and foundations: REPORT on the application of Regulation (EU, Euratom) No 1141/2014 on the statute and funding of European political parties and European political foundations | A9-0294/2021 | European Parliament",
    "background": "Regulation (EU, Euratom) 1141/2014 established funding, governance, and compliance rules for EU political parties and foundations, amended in 2018 and 2019. Post-Brexit membership adjustments and implementation challenges since 2018 prompted a mandated 2021 review. The Parliament will discuss the regulation’s application regarding financial transparency, operational effectiveness, and democratic engagement.",
    "stances": [
      {
        "party_name": "SD",
        "score": 0.8275862068965517,
        "choice": 8,
        "stance": "SD strongly accepts the enhanced transparency measures, particularly the €3,000 donation scrutiny threshold and public financial disclosures, which align with SD's commitment to combatting opaque political financing.  \nSD completely promotes requiring strict adherence to Article 2 TEU values as a funding precondition, effectively advancing SD's priority to safeguard democracy against anti-EU movements.  \nSD approves expanding permissible activities for foundations and lowering co-financing rates, recognizing these reforms as essential to empower pan-European civic engagement.  \nSD proposes revising vote-based funding mechanisms to first establish EU-wide electoral lists, addressing divergent national voting systems while maintaining the issue’s engagement goals.  \nSD applauds harmonizing logo display requirements and membership criteria as critical steps to strengthen European party identity, consistent with SD’s 2023 manifesto on transnational democracy."
      },
      {
        "party_name": "ID",
        "score": 0.0,
        "choice": 0,
        "stance": "ID rejects the issue's imposition of EU-aligned values as ideological coercion contradicting national sovereignty principles.  \nID opposes fundamentally the federalist agenda embedded in transnational election lists and centralized party governance structures.  \nThe proposal's enforcement mechanisms conflict with ID's vision of Europe as a coalition of independent nation-states rather than a supranational entity.  \nID condemns the issue's attempt to marginalize dissenting voices through compliance frameworks targeting anti-federalist movements.  \nThe funding restrictions and activity limitations overlook critical aspects of political pluralism by privileging Eurocentric federalism over national democratic mandates."
      }
    ],
    "resolution": "The European Parliament raised concerns and proposed reforms to enhance the transparency, efficiency, and democratic role of European political parties and foundations under Regulation (EU, Euratom) No 1141/2014. It emphasized the need for these entities to promote EU values, foster citizen engagement, and strengthen the European public sphere, while addressing obstacles such as administrative burdens, restrictive funding rules, and insufficient visibility. Key issues included inadequate compliance with logo display requirements by national member parties (only 15% met standards), overly narrow revenue categories, and the need to lower the co-financing rate for parties from 10% to 5% to align with foundations. The resolution advocated allowing financing of EU-related referendum campaigns, expanding permissible activities, and revising membership criteria to include parties from non-EU European countries and direct citizen participation. It called for harmonizing rules to reduce legal uncertainty, abolishing redundant financial reporting standards (e.g., International Financial Reporting Standards), and extending carry-over periods for foundations to N+1. Transparency measures included stricter scrutiny of donations exceeding €3,000, public disclosure of financial statements, and preventing circumvention of donation limits by 2027. The Parliament urged strengthening the Authority’s capacity to enforce compliance with EU values, proposed vote-based funding to boost electoral engagement, and demanded a single legal framework to consolidate rules on registration, financing, and governance. It also highlighted the need for clearer EU legal status for parties to avoid classification as foreign entities under national laws and emphasized democratic internal structures aligned with Article 2 TEU values. The Commission was urged to incorporate these proposals in its upcoming legislative review to enhance accountability, inclusivity, and the pan-European political landscape.",
    "total_score": 0.6070921985815603,
    "total_choice": 6,
    "party_num": 2,
    "id": 53,
    "parliament_terms": "9th_datas",
    "seat_weights": [
      0.5,
      0.5
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "Stocktaking of European elections: REPORT on stocktaking of European elections | A9-0211/2020 | European Parliament",
    "background": "The 2019 European elections recorded a 50.66% turnout, the highest in 20 years, with increased youth participation but persistent disparities in voter accessibility, gender representation, and cross-border electoral rules. The Parliament will discuss evaluating electoral procedures and potential reforms to strengthen democratic engagement and EU political integration.",
    "stances": [
      {
        "party_name": "SD",
        "score": 0.9448275862068966,
        "choice": 9,
        "stance": "SD fundamentally accepts the integration of transnational lists to strengthen European democracy, perfectly aligning with S&D's vision for pan-European political representation and citizen engagement.  \nSD perfectly aligns with institutionalizing the Spitzenkandidaten principle through binding electoral law reforms, ensuring parliamentary legitimacy in Commission appointments.  \nSD fully supports prioritizing youth participation frameworks in future elections, reflecting S&D's commitment to channeling climate activism into sustained democratic participation.  \nSD strongly advocates embedding the Conference on the Future of Europe's deliberations into electoral reform processes, ensuring citizen-led proposals inform transnational voting mechanisms.  \nSD fundamentally accepts harmonized accessibility standards for marginalized groups, advancing S&D's mandate to eliminate legal and practical barriers to universal suffrage."
      },
      {
        "party_name": "ID",
        "score": 0.015384615384615385,
        "choice": 0,
        "stance": "ID rejects fundamentally the conflation of European cultural identity with EU institutional integration, denouncing transnational lists as eroding national sovereignty (Resolution Clause: \"proposals for transnational lists\").  \nID opposes the transformation of the Council into a legislative chamber, asserting this contradicts the principle of intergovernmental cooperation (Resolution Clause: \"institutional reforms... transforming the Council\").  \nID condemns the Spitzenkandidaten process revival as undemocratic theater, citing the 2019 von der Leyen appointment as proof of its failure (Resolution Clause: \"reforms by 2024... Spitzenkandidaten process\").  \nID disputes the claim that voter turnout signals EU legitimacy, arguing it reflects protest against EU policies like ultraliberalism (Resolution Clause: \"highest voter turnout... driven by youth engagement\").  \nID rejects the creation of a European Electoral Authority, viewing it as a federalist overreach inconsistent with subsidiarity (Resolution Clause: \"European Electoral Authority to oversee electoral integrity\").  "
      }
    ],
    "resolution": "The European Parliament raised concerns and outlined key priorities following the 2019 European elections, noting a 50.66% voter turnout—the highest in 20 years—driven by youth engagement (over 50% motivated by climate urgency and civic duty) but marked by disparities among Member States and high abstention rates. It highlighted the need to address barriers for marginalized groups, including 800,000 citizens with disabilities disenfranchised by national laws and 700,000 homeless people facing voting access challenges. Gender representation improved to 41% women MEPs, though imbalances persist across states. The resolution criticized the failure of the Spitzenkandidaten process to secure the Commission Presidency, urging reforms by 2024 to enhance transparency and voter awareness, alongside proposals for transnational lists, harmonized electoral rules (including lowering the voting age to 16), and a unified European electoral law. It called for combating foreign interference and disinformation through increased funding, media literacy, and an independent ethics body, while advocating for a European Electoral Authority to oversee electoral integrity. The Parliament emphasized strengthening European political parties via campaign finance transparency, visibility on ballots, and pan-European debates, and endorsed the Conference on the Future of Europe to address institutional reforms, such as transforming the Council into a legislative chamber. Additional measures included improving accessibility for Roma communities, harmonizing voter registration deadlines, and ensuring media coverage of EU issues to reinforce democratic engagement.",
    "total_score": 0.6638297872340425,
    "total_choice": 6,
    "party_num": 2,
    "id": 54,
    "parliament_terms": "9th_datas",
    "seat_weights": [
      0.7,
      0.3
    ],
    "veto_party_name": "ID"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "The UK’s withdrawal from the EU: MOTION FOR A RESOLUTION on the state of play of the UK’s withdrawal from the European Union | B9-0038/2019 | European Parliament",
    "background": "The UK triggered Article 50 TEU in March 2017 to leave the EU, initiating withdrawal negotiations. Ratification challenges persisted for the endorsed 2018 Withdrawal Agreement and Political Declaration, with multiple extensions granted to avoid no-deal Brexit. Institutional preparedness and unresolved Irish border arrangements remained critical. The Parliament will discuss the UK's withdrawal process status and implications.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9122807017543859,
        "choice": 9,
        "stance": "EPP fully approves the issue's emphasis on the Withdrawal Agreement as the only viable framework to protect citizens' rights and maintain peace in Ireland, perfectly aligning with EPP's commitment to European unity and legal certainty.  \nEPP perfectly aligns with the issue's insistence on maintaining the backstop mechanism, recognizing it as essential to preserve the Good Friday Agreement and prevent economic fragmentation across Ireland.  \nEPP fully supports the call for rigorous administrative reforms to the UK's Settlement Scheme, emphasizing the need to convert pre-settled status into permanent protections for all eligible EU citizens.  \nEPP strongly affirms the issue's conditional approach to Article 50 extensions, requiring concrete democratic purposes like elections or referendums to justify prolonging negotiations.  \nEPP endorses the issue's rejection of post-no-deal agreements lacking EU standards safeguards, upholding EPP's principle that future relations must maintain regulatory parity and level playing field commitments."
      },
      {
        "party_name": "ID",
        "score": 0.0,
        "choice": 0,
        "stance": "ID rejects fundamentally the issue's characterization of Brexit as \"deplorable,\" directly conflicting with ID's core principle of respecting national sovereignty and democratic referendum outcomes.  \nID opposes the backstop mechanism as an undemocratic tool to trap the UK in EU structures, contradicting ID's stance against supranational overreach and for nation-state autonomy.  \nThe issue's demand to honor financial obligations ignores ID's position that the UK owes no \"divorce bill,\" as no such provision exists in EU treaties, making this an illegitimate penalty.  \nID condemns the issue's endorsement of the EU Settlement Scheme reforms, viewing this as interference in UK immigration policy and a violation of reciprocal sovereignty rights.  \nThe issue's insistence on EU unity against UK regulatory divergence starkly opposes ID's advocacy for competitive nation-states over centralized bureaucratic control."
      }
    ],
    "resolution": "The European Parliament raised the critical importance of an orderly UK withdrawal to mitigate negative consequences, emphasizing the Withdrawal Agreement as a fair and balanced solution safeguarding citizens’ rights, the Irish border, and financial obligations. It highlighted the need to protect 3.2 million EU citizens in the UK and 1.2 million British citizens in the EU-27, alongside 1.8 million Northern Ireland-born individuals eligible for Irish/EU citizenship, stressing reciprocity and legal certainty. The resolution underscored the necessity of the backstop to prevent a hard border on the island of Ireland, protect the Good Friday Agreement, and maintain the all-island economy, noting its temporary nature but rejecting removal without legally operational alternatives. It expressed concern over UK proposals for regulatory divergence and no-deal preparations, warning of disproportionate economic harm to the UK, and affirmed EU unity. The Political Declaration was endorsed as a basis for a future association agreement, contingent on level playing field provisions. In case of no-deal, the Parliament stressed the UK’s responsibility, ruled out transition periods or mini-deals, and insisted future negotiations require honoring financial commitments and citizens’ rights. It criticized the UK’s Settlement Scheme for granting 42% of applicants only pre-settled status, urging administrative reforms. Support for an Article 50 extension was conditional on clear purpose (e.g., elections, referendum) and institutional functionality, while reaffirming UK MEPs’ rights until withdrawal. The resolution reiterated refusal to ratify any post-no-deal agreement lacking safeguards for EU standards and citizens.",
    "total_score": 0.7294751009421265,
    "total_choice": 7,
    "party_num": 2,
    "id": 55,
    "parliament_terms": "9th_datas",
    "seat_weights": [
      0.4,
      0.6
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "constitutional and inter-institutional affairs",
    "title": "The right of information of the Parliament regarding the ongoing assessment of the national recovery and resilience plans: MOTION FOR A RESOLUTION on the right of information of the Parliament regarding the ongoing assessment of the national recovery and resilience plans | B9-0276/2021 | European Parliament",
    "background": "The EU established the Recovery and Resilience Facility (RRF) in February 2021 to coordinate post-pandemic economic recovery, requiring member states to submit national plans by April 2021. With 18 plans submitted and the Commission mandated to assess them within two months, transparency mechanisms under the RRF regulation prompted parliamentary oversight. The Parliament will discuss its right to access information during the RRF’s implementation.",
    "stances": [
      {
        "party_name": "ECR",
        "score": 0.40625,
        "choice": 4,
        "stance": "ECR partly endorses the transparency provisions but demands amendments to Article 18(4)(q) requiring direct parliamentary ratification of national plans before Commission approval, addressing Fitto’s concern about sidelined legislatures.  \nECR insists the issue must revise delegated acts to impose binding 48-hour disclosure deadlines for Commission findings, citing Zīle’s critique of delayed assessments undermining accountability.  \nECR objects to the absence of audit protocols for stakeholder consultations, proposing mandatory quarterly reports to Parliament on civil society engagement metrics.  \nECR warns the translation framework fails to guarantee real-time access, requiring a centralized portal with machine-translated drafts within 24 hours of submission.  \nECR highlights inconsistency with subsidiarity principles, noting the issue’s centralized reporting overlooks constitutional ratification procedures in member states."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.9487179487179487,
        "choice": 9,
        "stance": "GUE_NGL totally agrees the issue’s insistence on democratic accountability and stakeholder inclusion, perfectly aligning with their commitment to grassroots participation and anti-elitist economic justice.  \nGUE_NGL perfectly aligns with the demand for robust parliamentary scrutiny, viewing it as essential to prevent national governments from treating recovery funds as partisan tools rather than public goods.  \nGUE_NGL emphasizes the critical need for accessible translations and preliminary findings, ensuring marginalized communities can engage meaningfully with recovery processes as required by their egalitarian principles.  \nGUE_NGL strongly agrees the issue’s focus on social expenditure methodology, seeing it as a safeguard against austerity-driven reforms that contradict solidarity-based recovery.  \nGUE_NGL highlights the urgency of binding stakeholder consultations, particularly for regions like Greece where exclusion of local actors undermines the RRF’s transformative potential."
      }
    ],
    "resolution": "The European Parliament raised the critical need for enhanced transparency, democratic accountability, and parliamentary scrutiny in implementing the Recovery and Resilience Facility (RRF), emphasizing the Commission’s obligation to regularly inform Parliament on the status of national recovery and resilience plans, including reforms and investments aligned with the RRF’s six pillars and 11 assessment criteria. It highlighted that 18 Member States had submitted their plans by the resolution’s adoption, with the Commission required to assess each within two months, and urged timely approval of delegated acts on the recovery scoreboard and social expenditure methodology before the summer recess. Parliament stressed the importance of accessible, comparable information formats, translations of national documents, and preliminary findings on milestones and targets prior to their formal assessment. It called for robust stakeholder consultations at national levels, particularly involving local authorities, civil society, and social partners, as mandated by Article 18(4)(q) of the RRF Regulation, and insisted on full transparency in the Commission’s dialogue with Parliament to uphold democratic legitimacy and citizen ownership of the RRF. The resolution also reminded the Council to share relevant preparatory discussions with Parliament and urged the Commission to maintain an open, constructive approach throughout the recovery and resilience dialogue.",
    "total_score": 0.8551136363636364,
    "total_choice": 8,
    "party_num": 2,
    "id": 56,
    "parliament_terms": "9th_datas",
    "seat_weights": [
      0.1,
      0.9
    ],
    "veto_party_name": "ECR"
  }
]