[
  {
    "topic": "fisheries",
    "title": "European Fisheries Fund: REPORT on the proposal for a regulation of the European Parliament and of the Council amending Council Regulation (EC) No 1198/2006 on the European Fisheries Fund, as regards certain provisions relating to financial management for certain Member States experiencing or threatened with serious difficulties with respect to their financial stability",
    "background": "The European Fisheries Fund faced underutilization due to Member States' financial constraints from the 2008 economic crisis and austerity measures, limiting national cofinancing capacities. Institutional reviews highlighted challenges in accessing funds for eligible projects. The Parliament will discuss regulatory amendments to adjust financial management provisions for states experiencing fiscal instability.",
    "stances": [
      {
        "party_name": "EFD",
        "score": 0.5806451612903226,
        "choice": 5,
        "stance": "EFD supports accelerating EFF payment mechanisms to mitigate economic pressures on small-scale fishermen while maintaining sustainable fisheries management goals.  \nEFD advises enhancing fund accessibility for coastal communities through simplified administrative procedures and reduced national co-financing requirements.  \nEFD recommends explicit safeguards to prevent EFF liquidity support from becoming unconditional bailout subsidies, aligning with fiscal responsibility principles.  \nEFD emphasizes the need for crisis-response flexibility in fisheries funding while urging parallel reforms to reduce long-term CFP regulatory burdens on operators.  \nEFD expresses concern about insufficient differentiation between emergency liquidity provisions and structural investment needs in the amended regulation's financial architecture.  "
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.8947368421052632,
        "choice": 8,
        "stance": "GREEN_EFA strongly advocates the issue’s provisions to ease cofinancing constraints for Member States, aligning with their commitment to crisis-responsive fisheries management while maintaining ecological priorities.  \nGREEN_EFA applauds the emphasis on rebuilding fish stocks as foundational to long-term sectoral sustainability, reflecting their core principle that ecological health underpins economic resilience.  \nGREEN_EFA proposes enhancing future EMFF implementation by terminating scrapping subsidies and redirecting social support to crew retraining, ensuring public funds prioritize structural sustainability over fleet overcapacity.  \nGREEN_EFA underscores the critical need to align all financial instruments with CFP objectives, particularly selective fishing methods and habitat protection, to advance their vision of ecosystem-based fisheries reform.  \nGREEN_EFA highlights the urgency of rebalancing aid toward crew welfare and decarbonization, framing this as an essential evolution beyond vessel modernization to meet climate and social justice imperatives."
      }
    ],
    "resolution": "The European Parliament raised its position by adopting the European Commission’s 2011 proposal (COM(2011)0484) at first reading without amendments, endorsing its substantive content related to fisheries policy. It emphasized the need for the Commission to resubmit the proposal to Parliament if intending substantial revisions or replacements, ensuring legislative transparency and procedural continuity. The resolution further instructed the Parliament’s President to formally communicate the adopted position to the Council, the Commission, and national parliaments, reinforcing inter-institutional dialogue and adherence to EU treaty frameworks. No numerical data or specific policy changes were introduced, as the resolution primarily affirmed the Commission’s original text.",
    "total_score": 0.8183023872679045,
    "total_choice": 8,
    "party_num": 2,
    "id": 0,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.8,
      0.2
    ],
    "veto_party_name": "EFD"
  },
  {
    "topic": "fisheries",
    "title": "European Maritime and Fisheries Fund: REPORT on the amended proposal for a regulation of the European Parliament and of the Council on the European Maritime and Fisheries Fund repealing Council Regulation (EC) No 1198/2006 and Council Regulation (EC) No 861/2006 and Council Regulation No XXX/2011 on integrated maritime policy",
    "background": "The European Maritime and Fisheries Fund (2014-2020) was proposed to replace prior EU fisheries financing instruments, aligning with reforms to the Common Fisheries Policy addressing overfishing, fleet sustainability, and maritime integration. The Parliament will discuss the fund’s structure, funding priorities, and compliance with updated sustainability and resource management objectives.",
    "stances": [
      {
        "party_name": "SD",
        "score": 0.717948717948718,
        "choice": 7,
        "stance": "SD strongly promotes the issue's prohibition of fleet renewal subsidies, aligning perfectly with SD's commitment to ending overfishing and prioritizing sustainable fish stocks over vessel construction.  \nSD approves enhanced funding allocations for youth employment programs and small-scale coastal fisheries, effectively advancing SD's social equity priorities in vulnerable maritime communities.  \nSD proposes strengthening Article 17 to mandate quarterly Commissioner consultations with committee rapporteurs, addressing procedural concerns while maintaining the issue's core objectives.  \nSD endorses the Black Sea regional development provisions as a model for ecosystem-based management, reflecting SD's emphasis on tailored solutions for distinct maritime basins.  \nSD highlights the need for transitional modernization support to new Member States' fleets under strict sustainability criteria, framing this as an implementation enhancement rather than subsidy reintroduction."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.08571428571428572,
        "choice": 0,
        "stance": "GUE/NGL firmly conflicts the issue's restrictive definition of small-scale fisheries, which contradicts their documented advocacy for realistic categorization supporting artisanal fishing communities.  \nGUE/NGL rejects the prohibition on funding new local landing ports, a policy that neglects critical infrastructure needs in member states and disproportionately harms small-scale fishers.  \nThe proposal fails to address recurring maritime fatalities, ignoring GUE/NGL's demands for safety investments like storm-resistant harbors or vessel upgrades.  \nThis framework perpetuates regional disparities in fisheries management, inconsistent with GUE/NGL's principle of equitable resource allocation across diverse EU maritime economies.  \n While acknowledging improved co-funding rates for biological data, GUE/NGL maintains the overall structure inadequately supports sustainable small-scale fisheries."
      }
    ],
    "resolution": "The European Parliament raised its position on a legislative proposal concerning multiple policy areas, including fisheries, employment, environment, public health, and regional development, as outlined in the Commission’s original (COM(2011)0804) and amended (COM(2013)0245) proposals. The resolution emphasized alignment with Treaty provisions on transport, energy, industrial policy, and external action, while integrating opinions from committees on budgets, social affairs, environment, and regional development. It formally adopted its first-reading stance, urging the Commission to uphold parliamentary oversight by re-submitting the proposal if substantial amendments or replacements were planned. The resolution underscored procedural adherence by instructing the President to transmit Parliament’s position to the Council, Commission, and national parliaments, ensuring coherence across EU policies and legal frameworks.",
    "total_score": 0.6174934725848564,
    "total_choice": 6,
    "party_num": 2,
    "id": 1,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.5,
      0.5
    ],
    "veto_party_name": "GUE_NGL"
  },
  {
    "topic": "fisheries",
    "title": "External dimension of the common fisheries policy: REPORT on the external dimension of the Common Fisheries Policy",
    "background": "The EU, a major global fishing actor and fish product importer, operates under international agreements and regional fisheries bodies while addressing overexploitation, illegal fishing, and sustainability challenges. The Parliament will discuss the external governance of fisheries policies, including partnerships, resource management, and coherence with trade and development objectives.",
    "stances": [
      {
        "party_name": "EFD",
        "score": 0.45161290322580644,
        "choice": 4,
        "stance": "EFD partially supports the issue’s emphasis on small-scale fisheries but requests revisions to mandate stricter enforcement of Mediterranean stock recovery plans, citing systemic non-compliance with existing regulations.  \nEFD supports traceability schemes to combat IUU fishing but demands an explicit amendment requiring shark fins to remain naturally attached to carcasses, closing loopholes exploited by certain Member States.  \nEFD highlights contradictions in the issue’s reliance on EU-wide agreements, arguing it fails to address jurisdictional gaps that allow foreign fleets to bypass national bans on practices like finning near sovereign waters.  \nEFD requests revisions to tie sectoral funding for third countries to verifiable labor standards, noting the issue’s development goals are inconsistent with current permit systems enabling exploitative practices.  \n While endorsing climate-resilient Arctic management, EFD opposes centralized RFMO enforcement as undermining domestic sovereignty over coastal fisheries."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.7758620689655172,
        "choice": 7,
        "stance": "GREEN_EFA strongly sanctions the issue's stringent measures against IUU fishing, particularly banning shark finning by mandating fins remain naturally attached, aligning perfectly with their longstanding commitment to marine species protection.  \nGREEN_EFA applauds the alignment of Sustainable Fisheries Agreements with scientific stock assessments and sustainability objectives, effectively advancing their priority of ecosystem-based fisheries management as outlined in the Lövin report.  \nGREEN_EFA approves the prioritization of small-scale fisheries and equitable coastal community benefits, reflecting their advocacy for integrating artisanal fishing into sustainable food security frameworks.  \nGREEN_EFA proposes enhancing decentralized decision-making for technical fisheries measures to regional authorities, ensuring adaptability while maintaining the issue's ecological standards.  \nGREEN_EFA emphasizes strict adherence to human rights and ecological standards for EU fleets operating globally, aligning perfectly with their commitment to social justice in international agreements."
      }
    ],
    "resolution": "The European Parliament raised concerns over global overfishing, noting that 85% of assessed fish stocks are fully or overexploited, and emphasized the EU’s responsibility as the world’s largest importer of fishery products (24% by value) and a major fishing actor. It called for aligning the external dimension of the Common Fisheries Policy (CFP) with sustainability, human rights, and development goals, stressing the need for Sustainable Fisheries Agreements (SFAs) to ensure surplus resource access under UNCLOS, prioritize scientific stock assessments, and decouple financial compensation for access from sectoral support for third countries. The resolution urged stricter enforcement of IUU fishing regulations, including traceability schemes, sanctions for non-compliance in RFMOs, and market measures to block unsustainable products. It highlighted the importance of transparency in bilateral agreements, equitable benefits for coastal communities, and support for small-scale fisheries, while demanding EU fleets adhere to ecological and social standards equivalent to those in EU waters. The Parliament also advocated for stronger RFMOs, climate-resilient Arctic fisheries management, and coherence between trade, development, and environmental policies, including WTO negotiations to curb harmful subsidies and promote fair labor practices.",
    "total_score": 0.5976095617529881,
    "total_choice": 5,
    "party_num": 2,
    "id": 2,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.9,
      0.1
    ],
    "veto_party_name": "EFD"
  },
  {
    "topic": "fisheries",
    "title": "Arrangements for importing fishery and aquaculture products into the EU with a view to the future reform of the CFP: REPORT on the arrangements for importing fishery and aquaculture products into the EU with a view to the future reform of the CFP",
    "background": "The EU, the world's largest fishery and aquaculture market, faced declining domestic production, over 60% import dependence, and projected demand growth of 1.5 million tonnes by 2030. The Parliament will discuss import arrangements amid preparations for reforming the Common Fisheries Policy to address market sustainability and trade dynamics.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.5636363636363636,
        "choice": 5,
        "stance": "GREEN_EFA supports the issue’s emphasis on leveraging EU market power to enforce global sustainability standards but stresses the need for enhanced support to developing countries’ fisheries governance.  \nGREEN_EFA proposes strengthening the IUU Regulation by establishing an EU-funded technical assistance program to improve traceability systems and combat certification fraud in high-risk regions.  \nGREEN_EFA urges binding implementation of the FAO Code of Conduct through bilateral trade agreements, with compliance tied to preferential EU market access.  \nGREEN_EFA highlights vulnerabilities in self-certification mechanisms and advocates for regional third-party verification taskforces to ensure documentation integrity.  \nGREEN_EFA recommends allocating 10% of CFP external funding to modernize surveillance technologies in small island states disproportionately affected by illegal fishing."
      },
      {
        "party_name": "ECR",
        "score": 0.3333333333333333,
        "choice": 3,
        "stance": "ECR slightly upholds the market organization framework but demands structural revisions to align with fishermen's operational realities, noting divergence from sustainable resource management principles.  \nECR opposes the Commission's imposition of individual transferable quotas, advocating instead for the report's alternative approaches to preserve coastal community economies.  \nECR highlights inadequate enforcement provisions in developing nations, insisting the issue must specify capacity-building mechanisms for health standard compliance.  \nECR rejects the current WTO safeguards formulation, requiring explicit exemptions for fishery products under NAMA industrial trade rules.  \nECR identifies critical gaps in private sector integration, urging amendments to expand aquaculture import control roles for industry stakeholders."
      }
    ],
    "resolution": "The European Parliament raised concerns about the EU's position as the world's largest market for fishery and aquaculture products, valued at €55 billion and 12 million tonnes in 2007, while noting its growing reliance on imports due to a self-sufficiency rate below 40% and projected demand increases of 1.5 million tonnes by 2030. It emphasized sustainable management of fish as a renewable resource to prevent stock depletion and protect coastal communities globally, urging strengthened international fisheries governance and trade rules. The resolution called for the EU to leverage its role as the top importer to promote high environmental and social standards in WTO and FAO agreements, ensuring trade aligns with sustainability and poverty reduction. It advocated treating fish as sensitive products under WTO rules, exempting them from industrial NAMA frameworks, and applying safeguards to balance trade with conservation. The Parliament stressed that all imports must meet EU health standards and supported measures against illegal fishing, including the EU’s regulation to block illegally caught fish, while recognizing the need to assist developing countries in compliance and enforcement efforts.",
    "total_score": 0.5081521739130435,
    "total_choice": 5,
    "party_num": 2,
    "id": 3,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.8,
      0.2
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "fisheries",
    "title": "A catch documentation programme for bluefin tuna (thunnus thynnus): REPORT on the proposal for a regulation of the European Parliament and of the Council establishing a catch documentation programme for bluefin tuna Thunnus thynnus and amending Regulation (EC) No 1984/2003",
    "background": "Critically depleted bluefin tuna stocks due to overfishing and illegal trade prompted international conservation efforts through ICCAT, with repeated scientific warnings about unsustainable catch levels. High market demand, particularly in Asia, exacerbated unregulated fishing despite existing controls. The Parliament will discuss implementing enhanced catch documentation requirements to improve traceability and combat illegal fishing practices.",
    "stances": [
      {
        "party_name": "EFD",
        "score": 0.5483870967741935,
        "choice": 5,
        "stance": "EFD supports the catch documentation programme as vital to combat illegal fishing but advises reinforcing Article 7 with satellite tracking mandates for small vessels to prevent certificate fraud.  \nEFD recommends amending Annex II to replace the 1974-derived 6.4 kg minimum catch weight with science-based size limits ensuring juvenile protection.  \nEFD highlights the issue’s failure to prohibit fishing during breeding seasons and urges adding seasonal closures in Article 9 to safeguard reproductive cycles.  \nEFD advocates integrating consumer awareness campaigns into the regulation’s implementation, promoting scrutiny of tuna sourcing in retail markets.  \nEFD cautions that reliance on self-reporting by remote fleets risks loopholes, proposing third-party verification protocols in Article 4(b) for enhanced traceability."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.8823529411764706,
        "choice": 8,
        "stance": "GUE_NGL strongly sanctions the issue's emphasis on regulating unbridled market forces to prevent the collapse of bluefin tuna stocks, aligning with their commitment to ecological justice and worker protections.  \nGUE_NGL applauds the focus on eradicating industrial overfishing methods as a critical advancement of sustainable fisheries management, mirroring their manifesto priorities for biodiversity preservation.  \nGUE_NGL proposes explicitly exempting traditional trap fisheries from punitive measures in Article 4 to safeguard artisanal practices that align with ecosystem balance.  \nGUE_NGL endorses the traceability framework as a vital mechanism to hold commercial operators accountable, thereby operationalizing their long-standing demand for supply chain transparency.  \nGUE_NGL urges strict adherence to scientific catch limits during ICCAT negotiations, reinforcing the issue’s goal of reconciling marine conservation with coastal communities’ livelihoods."
      }
    ],
    "resolution": "The European Parliament raised its position on a legislative proposal concerning fisheries, adopting its first reading stance and urging the Commission to re-engage Parliament if substantial amendments or replacement of the proposal are intended. It emphasized procedural adherence under the Treaty on the Functioning of the EU, particularly Article 43(2) on fisheries conservation measures, and instructed its President to transmit the adopted position to the Council, Commission, and national parliaments. The resolution aligned with the Committee on Fisheries’ report (A7-0119/2010) and referenced prior Commission communications, including COM(2009)0406 and COM(2009)0665, which addressed post-Lisbon Treaty procedural implications. While no specific numerical data were detailed, the resolution focused on maintaining interinstitutional accountability and ensuring parliamentary oversight in legislative revisions.",
    "total_score": 0.7683923705722071,
    "total_choice": 7,
    "party_num": 2,
    "id": 4,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.8,
      0.2
    ],
    "veto_party_name": "GUE_NGL"
  },
  {
    "topic": "fisheries",
    "title": "A new impetus for the Strategy for the Sustainable Development of European Aquaculture: REPORT on a new impetus for the Strategy for the Sustainable Development of European Aquaculture",
    "background": "The European aquaculture sector operates under fragmented regulations, with global sector growth outpacing EU production. As a net importer facing environmental and market challenges, the EU seeks to address competitiveness and sustainability. The Parliament will discuss strategic measures to enhance sustainable aquaculture development within the European Union.",
    "stances": [
      {
        "party_name": "ECR",
        "score": 0.3888888888888889,
        "choice": 3,
        "stance": "ECR partly agrees the issue's job creation goals but requests revisions to replace EU-wide harmonization with regional adaptation frameworks, particularly for climate-vulnerable areas like the Baltic.  \nECR firmly condemns the issue's regulatory consolidation approach as inconsistent with their anti-bureaucracy principles, citing existing 400+ regulations as excessive.  \nECR rejects the premise that centralized quality controls ensure competitiveness, arguing current import practices undermine EU producers without WTO action.  \nECR requests deletion of provisions expanding environmental constraints in coastal zones, advocating instead for streamlined national permitting systems.  \nECR highlights the issue's failure to address parallels with failed fisheries policy centralization, demanding explicit safeguards against similar outcomes."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.7058823529411765,
        "choice": 7,
        "stance": "GUE_NGL strongly advocates the allocation of dedicated funding for SMEs and organic aquaculture, aligning with their commitment to equitable rural development and sustainable production.  \nGUE_NGL strongly endorses stringent import controls and WTO advocacy to uphold public-health standards, consistent with their opposition to trade liberalization that undermines local producers.  \nGUE_NGL approves the emphasis on research into indigenous species and disease prevention, crucial for ecological balance and long-term sector viability.  \nGUE_NGL proposes enhancing eco-labelling by mandating public certification bodies to ensure transparency and avoid cost burdens on small producers.  \nGUE_NGL highlights the issue’s environmental safeguards in coastal zones as vital to reconciling aquaculture with biodiversity goals under Natura 2000."
      }
    ],
    "resolution": "The European Parliament raised the need for a harmonized EU legislative framework to address the fragmented and inconsistent regulations governing the aquaculture sector, which currently lead to market distortions and operational confusion. It emphasized aquaculture’s strategic importance in enhancing food security, reducing pressure on wild fish stocks, and supporting rural and coastal economies through job creation and sustainable production. The resolution called for consolidating existing regulations into a single legal text, prioritizing research, innovation, and technology transfer to improve competitiveness, and allocating dedicated funding under the European Fisheries Fund—particularly for SMEs, organic production, and eco-friendly practices like water purification systems. It stressed the need for stringent quality controls, eco-labelling to distinguish EU products, and traceability standards to ensure consumer trust, while advocating for humane animal welfare practices, including stress reduction during transport and slaughter. The Parliament highlighted challenges from non-EU competitors with lower environmental and labor standards, urging stricter import controls and WTO advocacy to uphold EU quality norms. It also addressed conflicts with environmental policies, advocating for sustainable coexistence with Natura 2000 areas, and solutions for space constraints through offshore aquaculture. Additional measures included vocational training, support for native species replenishment, and mitigating damage from cormorants via population management plans. The resolution underscored the sector’s lower environmental impact compared to other industries and called for public awareness campaigns to counter misconceptions, alongside promoting organic aquaculture through EU-wide labeling and feed sustainability criteria.",
    "total_score": 0.5722070844686649,
    "total_choice": 5,
    "party_num": 2,
    "id": 5,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.6,
      0.4
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "fisheries",
    "title": "EU-Morocco Fisheries Partnership Agreement: protocol setting out fishing opportunities and financial contributions: RECOMMENDATION on the draft Council decision on the conclusion, on behalf of the European Union, of the Protocol between the European Union and the Kingdom of Morocco setting out the fishing opportunities and financial contribution provided for in the Fisheries Partnership Agreement between the European Union and the Kingdom of Morocco",
    "background": "The EU and Morocco’s Fisheries Partnership Agreement, revised after the 2011 European Parliament rejection of its previous protocol, addresses fishing access and financial terms in waters including Moroccan-administered Western Sahara, amid unresolved territorial sovereignty and international law concerns. The Parliament will discuss the agreement’s compliance with sustainability, economic terms, and legal obligations.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.6948529411764706,
        "choice": 6,
        "stance": "EPP supports the protocol's alignment with international law and sustainable fishing practices, emphasizing improved cost-benefit ratios for EU fleets.  \nEPP advises stricter monitoring of financial contribution allocations to ensure transparency in Western Sahara development projects as per Article 6 requirements.  \nEPP endorses job creation benefits for EU and Moroccan workers, particularly highlighting stabilized employment for 800 Spanish fishing families.  \nEPP recommends expanding observer access to joint committee meetings to verify compliance with human rights clauses during implementation.  \nEPP acknowledges the need for a full evaluation of sectoral support outcomes before new negotiations, aligning with parliamentary oversight demands."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.0,
        "choice": 0,
        "stance": "GREEN_EFA rejects the protocol as fundamentally illegal under international law, given Morocco’s lack of sovereignty over Western Sahara’s resources and the exclusion of Sahrawi self-determination in negotiations.  \nGREEN_EFA opposes the agreement for normalizing human rights violations, citing Morocco’s refusal to include explicit references to Western Sahara or permit independent monitoring of Sahrawi conditions.  \nThis totally doubts with GREEN_EFA’s position that EU partnerships must prioritize consent of affected populations, as the Sahrawi people explicitly opposed the protocol without consultation.  \nThe proposal overlooks critical aspects such as binding human rights clauses, which are diluted compared to other EU fisheries agreements, enabling unchecked exploitation.  \nGREEN_EFA condemns the timing of the vote on Human Rights Day as hypocritical, aligning with Morocco’s disregard for Sahrawi dignity and UN-recognized rights to autonomy."
      }
    ],
    "resolution": "The European Parliament raised its consent to conclude the fisheries protocol with Morocco, which outlines fishing opportunities and financial contributions under their partnership agreement, while emphasizing the need for transparency and accountability. It insisted on Parliament’s right to timely and comprehensive information on the protocol’s implementation, including access to joint committee meetings as observers, documentation on objectives and indicators for Morocco’s fisheries sector support, and all relevant data to monitor compliance with Article 6, notably Morocco’s final report on the sectoral support program. The resolution reiterated demands for the Commission to submit a full evaluation of the current protocol’s outcomes and functioning to Parliament before negotiating any new agreement, ensuring informed oversight. The Parliament also instructed its leadership to communicate this position to EU institutions, member states, and Moroccan authorities.",
    "total_score": 0.40575916230366493,
    "total_choice": 4,
    "party_num": 2,
    "id": 6,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.6,
      0.4
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "fisheries",
    "title": "EU-Morocco fisheries partnership agreement: RECOMMENDATION on the draft Council decision on the conclusion of a Protocol between the European Union and the Kingdom of Morocco setting out the fishing opportunities and financial compensation provided for in the Fisheries Partnership Agreement between the European Community and the Kingdom of Morocco",
    "background": "The EU-Morocco Fisheries Partnership Agreement, governing access to Moroccan waters including Western Sahara, required renewal under Lisbon Treaty provisions. Concerns over sustainability, resource management, and economic viability arose from prior implementation. The Parliament will discuss concluding a new protocol setting fishing opportunities and financial compensation terms under the partnership agreement.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.6222222222222222,
        "choice": 6,
        "stance": "EPP supports the provisional protocol to maintain fishing access and EU-Morocco cooperation, stressing its role in supporting Morocco's democratic reforms and mutual economic benefits.  \nEPP advises enhancing scientific oversight in the new agreement to ensure ecological sustainability, including third-party stock assessments for pelagic fisheries.  \nEPP emphasizes revising fund allocation transparency measures to mandate quarterly public reports on sectoral support disbursements to Moroccan coastal communities.  \nEPP acknowledges concerns about limited parliamentary scrutiny in the current protocol but views extension as strategically vital during regional instability.  \nEPP underscores strict adherence to international law regarding Western Sahara's status, urging explicit territorial application clauses in future negotiations."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.0,
        "choice": 0,
        "stance": "GREEN_EFA fundamentally condemns the protocol's disregard for Western Sahara's self-determination, as it illegally treats Moroccan-occupied waters as sovereign territory.  \nGREEN_EFA rejects the economic framework that prioritizes EU vessel access over local ecological limits, noting the €36.1 million compensation structurally enables resource exploitation rather than sustainable development.  \nGREEN_EFA condemns the authorization of 100 EU vessels to harvest already overfished stocks, directly contradicting the party's principle of \"exploitation of surplus stocks only\" outlined in marine conservation policies.  \nGREEN_EFA highlights the issue's failure to require documented consent from Sahrawi representatives, making it inconsistent with precedents like the EU's stance on Timor-Leste during Indonesian occupation.  \nGREEN_EFA demands immediate cessation of all fisheries agreements involving Western Saharan resources until UN-supervised consultations with the occupied population occur."
      }
    ],
    "resolution": "The European Parliament raised its consent to the conclusion of a Fisheries Protocol between the EU and Morocco, which establishes fishing opportunities for EU vessels in Moroccan waters and outlines financial compensation. The Protocol, valid from 2011 to 2013, allocates €36.1 million annually from the EU, with €16.1 million designated as compensation for access to fisheries resources and €20 million for sectoral support to enhance Morocco’s sustainable fisheries and coastal communities. Fishing opportunities include 100 EU vessels (from 11 Member States) permitted to operate, targeting species such as small pelagic fish (120,000 tonnes annually), demersal species, tuna, and industrial pelagic fisheries. The resolution emphasizes adherence to sustainable fishing practices, socio-economic benefits for local populations, and compliance with international law, particularly regarding the status of Western Sahara. It underscores the need for transparency in fund allocation and monitoring to ensure the agreement aligns with environmental and developmental objectives.",
    "total_score": 0.3930942895086321,
    "total_choice": 3,
    "party_num": 2,
    "id": 7,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.2,
      0.8
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "fisheries",
    "title": "Baltic salmon stock and the fisheries exploiting that stock: REPORT on the proposal for a regulation of the European Parliament and of the Council establishing a multiannual plan for the Baltic salmon stock and the fisheries exploiting that stock",
    "background": "Declining Baltic salmon stocks, driven by overfishing, habitat pressures, and unregulated recreational fishing, prompted EU institutional action under Common Fisheries Policy reforms. The Parliament will discuss establishing a multiannual conservation plan addressing stock management, sustainable fishing practices, and alignment with broader marine ecosystem protection goals.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.8698884758364313,
        "choice": 8,
        "stance": "EPP strongly accepts the binding measures to achieve maximum sustainable yield by 2020, aligning with their commitment to science-based fisheries management while proposing enhanced genetic monitoring of stocked salmon to ensure biodiversity preservation.  \nEPP approves the issue’s inclusion of both commercial and recreational fisheries under uniform control measures, emphasizing this as critical for equitable enforcement across all fishing sectors.  \nEPP endorses stricter inspection protocols for landings and suggests integrating real-time electronic monitoring technologies to improve compliance efficiency without opposing the 20% inspection target.  \nEPP highlights the importance of regionalized management approaches, advocating for capacity-building initiatives in coastal communities to complement the plan’s sustainability objectives.  \nEPP supports the phased elimination of discards through landing obligations, recommending additional transitional funding mechanisms under the European Maritime and Fisheries Fund to facilitate industry adaptation."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.5294117647058824,
        "choice": 5,
        "stance": "GUE_NGL supports the issue's binding measures to eliminate overfishing and achieve maximum sustainable yield by 2020, aligning with their commitment to ecological resource conservation in small-scale fisheries.  \nGUE_NGL advises strengthening fisheries partnership agreements with third countries to prioritize local economic development and scientific monitoring frameworks, as criticized in João Ferreira's intervention.  \nGUE_NGL highlights the necessity to combat destructive practices like shark finning, endorsing Younous Omarjee's emphasis on protecting endangered species through stricter enforcement of anti-finning regulations.  \nGUE_NGL recommends expanding the phased-in landing obligations to include safeguards against disproportionate impacts on artisanal fleets, referencing Ferreira's successful amendment on technical measure equity.  \nGUE_NGL stresses the need for transparent corrective mechanisms in regionalized management, ensuring partnership agreements actively reduce wealth extraction from developing nations' waters."
      }
    ],
    "resolution": "The European Parliament raised its position on the Commission’s 2011 proposal (COM(2011)0470) concerning the Common Fisheries Policy, emphasizing alignment with Article 43(2) of the Treaty on the Functioning of the European Union to ensure sustainable fisheries management. It endorsed the Committee on Fisheries’ report (A7-0239/2012) and incorporated the Environment Committee’s opinion, stressing ecological sustainability and resource conservation. The resolution called for binding measures to eliminate overfishing, achieve maximum sustainable yield by 2020, and enforce stricter monitoring of fishing activities, including penalties for non-compliance. It highlighted the need to reduce discards through phased-in landing obligations and supported regionalized management approaches. The Parliament urged the Commission to revise its proposal if substantial changes were planned and directed its President to transmit the adopted position to the Council, Commission, and national parliaments, underscoring transparency and inter-institutional collaboration.",
    "total_score": 0.795484727755644,
    "total_choice": 7,
    "party_num": 2,
    "id": 8,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.9,
      0.1
    ],
    "veto_party_name": "GUE_NGL"
  },
  {
    "topic": "fisheries",
    "title": "Bluefin tuna in the eastern Atlantic and Mediterranean: REPORT on the proposal for a regulation of the European Parliament and of the Council amending Regulation (EC) No 302/2009 concerning a multiannual recovery plan for bluefin tuna in the eastern Atlantic and Mediterranean",
    "background": "Declining bluefin tuna stocks in the eastern Atlantic and Mediterranean, exacerbated by documented over-fishing and illegal catches, prompted the EU to propose amendments to its 2009 multiannual recovery plan under ICCAT recommendations. The Parliament will discuss regulatory updates to align EU measures with international conservation agreements.",
    "stances": [
      {
        "party_name": "EFD",
        "score": 0.5806451612903226,
        "choice": 5,
        "stance": "EFD supports the inclusion of ICCAT recommendations on tuna management but advises stricter enforcement mechanisms against third countries’ illegal fishing activities.  \nEFD highlights the need to enhance the European Fisheries Control Agency’s mandate to address persistent gaps in monitoring Mediterranean overfishing.  \nEFD emphasizes prioritizing binding measures to combat IUU fishing, urging amendments to strengthen penalties for non-EU vessels operating in EU waters.  \nEFD acknowledges the issue’s alignment with sustainable fisheries goals but calls for explicit funding allocations to improve surveillance technologies.  \nEFD notes concerns that current control efforts, while improved, remain insufficient to fully reverse stock depletion trends."
      },
      {
        "party_name": "ALDE",
        "score": 0.8795180722891566,
        "choice": 8,
        "stance": "ALDE strongly approves the issue’s science-based recovery targets for bluefin tuna, aligning with their commitment to sustainable fisheries and biodiversity preservation through enforceable international frameworks.  \nALDE applauds the stringent ICCAT control measures as a model for global fisheries governance, urging enhanced cross-border enforcement to combat organized crime exploiting high-value tuna trade.  \nALDE proposes strengthening criminal penalties in Article 8 to address systemic under-reporting, emphasizing that current sanctions lack deterrence given profit margins exceeding €500,000 per fish.  \nALDE endorses real-time electronic monitoring systems to reconcile global trade volumes with reported catches, ensuring EU leadership in eradicating illegal, unreported, and unregulated fishing.  \nALDE emphasizes multilateral engagement to resolve geostrategic complexities in Mediterranean fisheries, advocating for expanded stakeholder consultations to bolster quota compliance."
      }
    ],
    "resolution": "The European Parliament raised its position on the Commission’s 2011 fisheries proposal (COM(2011)0330), adopting a stance informed by the European Economic and Social Committee’s October 2011 opinion and the Committee on Fisheries’ report (A7-0449/2011), which incorporated input from the Committee on the Environment, Public Health, and Food Safety. The resolution emphasized adherence to Treaty provisions on fisheries policy and legislative procedures, urging the Commission to re-engage Parliament if proposing substantial amendments to or replacing the original text. It further directed its President to transmit the adopted position to the Council, Commission, and national parliaments, ensuring alignment with EU institutional frameworks and stakeholder consultations.",
    "total_score": 0.8444148936170213,
    "total_choice": 8,
    "party_num": 2,
    "id": 9,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.1,
      0.9
    ],
    "veto_party_name": "EFD"
  },
  {
    "topic": "fisheries",
    "title": "Community financial measures for the implementation of the common fisheries policy and in the area of the Law of the Sea: REPORT on the proposal for a regulation of the European Parliament and of the Council amending Council Regulation (EC) No 861/2006 of 22 May 2006 establishing Community financial measures for the implementation of the common fisheries policy and in the area of the Law of the Sea",
    "background": "The European Commission proposed amendments to Regulation (EC) No 861/2006, governing EU financial measures for implementing the Common Fisheries Policy and Law of the Sea obligations, following evolving legislative frameworks and operational needs. The Parliament will discuss regulatory adjustments to align funding mechanisms with updated policy objectives and international fisheries governance requirements.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9045801526717557,
        "choice": 9,
        "stance": "EPP totally promotes the regionalization principle in fisheries management, perfectly aligning with its commitment to decentralized decision-making that respects distinct sea basin characteristics.  \nEPP perfectly aligns with transitional measures preventing regulatory gaps, ensuring legal certainty for fishermen while awaiting comprehensive CFP reform.  \nEPP strongly approves increased EU co-financing for fisheries research, recognizing this as essential for combating import dependency through evidence-based aquaculture development.  \nEPP endorses maintaining proven fishing techniques during transition periods, safeguarding coastal communities' livelihoods while reinforcing sustainability commitments.  \nEPP fully backs scientific data harmonization across policies, enhancing coherence between fisheries management and environmental protection goals."
      },
      {
        "party_name": "EFD",
        "score": 0.5806451612903226,
        "choice": 5,
        "stance": "EFD supports the issue’s commitment to ending discards but advises adopting regional fisheries management frameworks mirroring EU land divisions to address disparities in implementation.  \nEFD proposes amending Article 5 to mandate ecological and socioeconomic impact assessments for EU external fishing agreements, preventing overexploitation in vulnerable regions like the Comoros.  \nEFD highlights the urgency of accelerating approval for localized conservation plans, citing delays in adopting West of Scotland proposals as exacerbating stock depletion.  \nEFD raises concerns about inadequate safeguards for artisanal fishers in developing nations, urging stricter monitoring of EU fleet activities in external waters to prevent displacement.  \nEFD advises incorporating periodic reviews of EU fishing policies’ humanitarian impacts, particularly addressing displacement risks seen in Western Saharan and Somali coastal communities."
      }
    ],
    "resolution": "The European Parliament raised its position on a legislative proposal concerning fisheries, adopting its stance at first reading based on the Committee on Fisheries’ report (A7-0017/2011) and contributions from the Portuguese and Italian legislatures, as well as the European Economic and Social Committee. It called on the Commission to resubmit the proposal to Parliament if intending to substantially amend or replace it, ensuring parliamentary oversight. The resolution emphasized procedural adherence by instructing the Parliament’s President to formally transmit its position to the Council, Commission, and national parliaments, reflecting collaboration across EU institutions and member states while maintaining legislative integrity.",
    "total_score": 0.8623978201634878,
    "total_choice": 8,
    "party_num": 2,
    "id": 10,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.4,
      0.6
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "fisheries",
    "title": "Compliance with the rules of the Common Fisheries Policy: REPORT on the proposal for a Regulation of the European Parliament and of the Council amending Council Regulation (EC) No 1224/2009 establishing a Community control system for ensuring compliance with the rules of the Common Fisheries Policy",
    "background": "The 2009 EU Fisheries Control Regulation required alignment with post-Lisbon Treaty institutional procedures, mandating reclassification of Commission powers into delegated/implementing acts. The European Commission proposed amendments to ensure legal coherence with Treaty Articles 290 and 291. The Parliament will discuss adapting fisheries control rules to Lisbon Treaty governance frameworks.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.0,
        "choice": 0,
        "stance": "GREEN_EFA rejects the proposed amendments for fundamentally undermining enforcement mechanisms critical to sustainable fisheries management  \nGREEN_EFA opposes weakening the Control Regulation framework that directly conflicts with core principles of ecosystem-based fishing limits  \nGREEN_EFA highlights the issue's failure to maintain Parliament's hard-won budget increases for compliance monitoring and catch data verification  \nGREEN_EFA condemns contradictory legislative signals that jeopardize the CFP reform's enforcement capacity  \nGREEN_EFA demands rejection of any text revisions permitting reduced inspection standards or delayed implementation timelines"
      },
      {
        "party_name": "SD",
        "score": 0.8717948717948718,
        "choice": 8,
        "stance": "SD strongly promotes the issue’s procedural safeguards for legislative transparency, aligning perfectly with SD’s commitment to institutional accountability under the reformed Common Fisheries Policy.  \nSD applauds the Lisbon Treaty adaptation mechanisms, effectively advancing SD’s priority of modernizing control systems to match post-2009 governance frameworks.  \nSD endorses integrating advanced monitoring technologies to streamline compliance checks, proposing a minor amendment to prioritize R&D funding for real-time catch reporting tools.  \nSD emphasizes the urgency of expediting the Commission’s revised control regulation to enforce the discard ban, ensuring alignment with sustainability targets.  \nSD recommends enhancing regional advisory council consultations to address biogeographic specificities, particularly for outermost regions like the Azores."
      }
    ],
    "resolution": "The European Parliament raised its position on the Commission’s 2013 proposal (COM(2013)0009) concerning fisheries policy, adopting its first-reading stance as outlined in the Committee on Fisheries’ report (A7-0468/2013). It emphasized the need for the Commission to resubmit the proposal to Parliament if substantial amendments or a replacement text were planned, ensuring legislative transparency and procedural integrity. The resolution further instructed the Parliament’s President to formally communicate its adopted position to the Council, the Commission, and national parliaments, reinforcing inter-institutional dialogue and adherence to Treaty obligations under Article 294(3) of the Treaty on the Functioning of the European Union. The focus remained on aligning fisheries management with sustainability goals, though specific policy measures or numerical targets were not detailed in the procedural resolution text.",
    "total_score": 0.7323759791122716,
    "total_choice": 7,
    "party_num": 2,
    "id": 11,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.6,
      0.4
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "fisheries",
    "title": "Conservation of fishery resources: REPORT on the proposal for a regulation of the European Parliament and of the Council amending Council Regulation (EC) No 850/98 concerning the conservation of fishery resources through technical measures for the protection of juveniles of marine organisms and repealing Council Regulation (EC) No 1288/2009",
    "background": "Ongoing concerns over sustainable fishing practices and juvenile marine organism protection under existing EU technical measures (Regulation 850/98, 1288/2009) prompted the European Commission to propose regulatory amendments. The Parliament will discuss revising conservation rules to strengthen ecosystem-based management and align with updated scientific and operational standards.",
    "stances": [
      {
        "party_name": "EFD",
        "score": 0.6451612903225806,
        "choice": 6,
        "stance": "EFD supports the prioritization of small-scale fisheries in sustainable resource management, recognizing their economic and environmental benefits.  \nEFD endorses amendments mandating natural shark fin attachment to effectively combat finning practices and close regulatory loopholes.  \nEFD advises stricter enforcement of Mediterranean overfishing regulations through enhanced monitoring and Member State compliance mechanisms.  \nEFD proposes revising permit allocation systems under the European Maritime and Fisheries Fund to better protect artisanal fishing sectors.  \nEFD highlights the need for strengthened domestic oversight provisions to address foreign vessel operations while supporting EU regulatory frameworks."
      },
      {
        "party_name": "ECR",
        "score": 0.9090909090909091,
        "choice": 9,
        "stance": "ECR completely promotes the issue's procedural safeguards for legislative transparency, perfectly aligning with ECR's commitment to institutional accountability in fisheries governance.  \nECR perfectly aligns with the emphasis on artisanal fleet sustainability, advancing ECR's priority to protect low-impact fisheries as critical to coastal community resilience.  \nECR completely promotes strict \"fins naturally attached\" mandates for sharks, effectively advancing marine conservation through enforceable anti-finning measures.  \nECR perfectly supports eliminating derogations in technical regulations, aligning with ECR's principle of simplifying compliance to prevent circumvention.  \nECR completely promotes redirecting fishing rights toward sustainable practices, consistent with ECR's long-standing advocacy for ecosystem-based fisheries reform."
      }
    ],
    "resolution": "The European Parliament raised its position at first reading on the Commission’s 2012 proposal (COM(2012)0298) concerning measures under Article 43(2) of the Treaty on the Functioning of the European Union, which governs common agricultural policy provisions. The resolution emphasized the need for the Commission to re-engage Parliament if it seeks to substantially amend or replace the proposal, ensuring legislative transparency and procedural adherence. While aligning with the Committee on Fisheries’ recommendations (A7-0342/2012) and acknowledging the European Economic and Social Committee’s 2012 opinion, the resolution focused on formalizing Parliament’s stance and safeguarding its role in the legislative process, without detailing specific policy measures or numerical targets beyond the procedural framework.",
    "total_score": 0.8541114058355438,
    "total_choice": 8,
    "party_num": 2,
    "id": 12,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.2,
      0.8
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "fisheries",
    "title": "Fisheries - transitional technical measures: REPORT on the proposal for a regulation of the European Parliament and of the Council amending Council Regulation (EC) No 1288/2009 establishing transitional technical measures from 1 January 2010 to 30 June 2011",
    "background": "Transitional EU fisheries technical measures under Council Regulation 1288/2009, set to expire in June 2011, faced delayed replacement due to unresolved negotiations on updated rules amid ongoing common fisheries policy reform discussions. The Parliament will discuss amending the regulation to prolong transitional measures pending new framework adoption.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.916030534351145,
        "choice": 9,
        "stance": "EPP fundamentally endorses the extension of transitional technical measures to prevent regulatory gaps, perfectly aligning with their commitment to stable fisheries management until CFP reform.  \nEPP perfectly aligns with the principle of regionalization emphasized in the issue, advocating for decentralized technical measures tailored to individual sea basins.  \nEPP strongly accepts maintaining existing fishing methods like trammel nets to protect coastal economies, ensuring continuity with sustainable practices until 2013.  \nEPP fundamentally endorses the prioritization of scientific data collection and impact assessments as critical foundations for future CFP reforms.  \nEPP perfectly aligns with the issue’s balance between sustainable resource management and economic viability for fishing communities across EU regions."
      },
      {
        "party_name": "EFD",
        "score": 0.3870967741935484,
        "choice": 3,
        "stance": "EFD partially sanctions the issue but demands amendments to Article 43(2) to explicitly prohibit EU fleet licenses in non-EU waters, which enable resource exploitation inconsistent with sustainable development goals.  \nEFD requests revisions to mandate regional conservation frameworks, as the current proposal fails to address stock depletion despite pre-existing local initiatives like the West Scotland white fish plan.  \nEFD highlights that the issue fundamentally againsts with their principles by overlooking the socio-economic devastation caused by EU trawlers in regions such as the Comoros, directly linking to increased piracy and refugee crises.  \nEFD insists the proposal must integrate binding clauses to prevent the renewal of exploitative fishing agreements, aligning with their condemnation of EU-driven impoverishment in least-developed countries.  \nEFD calls for the inclusion of impact assessments on non-EU coastal communities, noting the current text’s failure to address humanitarian consequences evidenced by the Canaries tragedy."
      }
    ],
    "resolution": "The European Parliament raised its position at first reading on the Commission’s legislative proposal (COM(2010)0488) concerning measures under the Common Fisheries Policy, specifically invoking Article 43(2) of the Treaty on the Functioning of the European Union. It emphasized the need for the Commission to re-submit the proposal to Parliament if substantial amendments or a replacement text is considered, ensuring continued legislative oversight. Additionally, Parliament instructed its President to formally transmit its adopted position to the Council, the Commission, and national parliaments to advance the legislative process.",
    "total_score": 0.8474114441416893,
    "total_choice": 8,
    "party_num": 2,
    "id": 13,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.7,
      0.3
    ],
    "veto_party_name": "EFD"
  },
  {
    "topic": "fisheries",
    "title": "Combating illegal fishing at the global level: REPORT on combating illegal fishing at the global level - the role of the EU",
    "background": "Illegal, unreported, and unregulated fishing, linked to biodiversity loss, economic distortion, and food insecurity, persisted despite international agreements and EU regulations. The EU, as a major fisheries market and importer, faced calls to strengthen global governance. The Parliament will discuss the EU’s role in addressing illegal fishing through international cooperation and regulatory frameworks.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.8181818181818182,
        "choice": 8,
        "stance": "GREEN_EFA strongly sanctions the issue’s mandate to withhold EU subsidies from IUU operators, aligning with their commitment to ending public funding of ecologically destructive practices, and proposes enhancing real-time audit mechanisms to prevent loopholes in subsidy enforcement.  \nGREEN_EFA applauds the emphasis on transparency through DNA-based traceability and public IUU registers, which perfectly align with their longstanding principles of ecological accountability and consumer empowerment in fisheries governance.  \nGREEN_EFA endorses linking IUU fishing to transnational crime frameworks, strongly sanctioning Interpol’s role in dismantling networks that exploit marine resources and violate human rights.  \nGREEN_EFA approves the integration of IUU combat into EU external policies, particularly trade preference suspensions for non-compliant states, as a critical step toward market-state responsibility and global ocean justice.  \nGREEN_EFA highlights the need to replicate community-led models like Scotland’s conservation credit scheme within CFP reforms, ensuring incentives for legal fishing align with localized stewardship practices."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.11764705882352941,
        "choice": 1,
        "stance": "GUE_NGL rejects the inclusion of European coastguard proposals as a violation of national sovereignty, fundamentally doubting with their opposition to supranational militarization of fisheries control.  \nGUE_NGL opposes the issue’s failure to address IUU fishing’s disproportionate impact on EU outermost regions like Réunion and Martinique, overlooking critical aspects of colonial-era resource exploitation patterns.  \nGUE_NGL condemns the issue’s reliance on punitive trade sanctions against developing states as inconsistent with their principle of equitable North-South cooperation in fisheries management.  \nGUE_NGL disputes the adequacy of DNA traceability systems without binding provisions to dismantle corporate-dominated seafood supply chains that enable IUU laundering.  \nGUE_NGL asserts the issue’s market-based labeling schemes contradict their demand for public-sector-led resource governance, failing to address profit-driven overfishing at its core."
      }
    ],
    "resolution": "The European Parliament raised grave concerns about Illegal, Unreported, and Unregulated (IUU) fishing, which accounts for 11-26 million tonnes annually (15% of global catches), threatening marine biodiversity, food security, and sustainable fisheries. It emphasized the EU’s responsibility as the world’s largest importer of fisheries products to combat IUU through robust enforcement of regulations like the IUU Regulation, Control Regulation, and Fishing Authorisations Regulation, which mandate flag-state accountability, traceability, and sanctions. The resolution called for ending \"flags of convenience,\" enhancing international cooperation via Regional Fisheries Management Organizations (RFMOs), and expanding port state measures to block IUU catches. It urged stricter penalties for offenders, including EU operators, and withholding EU subsidies or aid from vessels engaged in IUU activities. The Parliament stressed the need for transparency, including public registers of IUU offenders, DNA-based traceability systems, and consumer labeling (e.g., Marine Stewardship Council) to ensure legal sourcing. It linked IUU fishing to transnational organized crime, advocating Interpol involvement and alignment with the UN Convention on Transnational Organized Crime. The resolution highlighted support for developing countries through technical aid, Fisheries Partnership Agreements, and trade measures like suspending preferences for non-compliant states. It called for integrating IUU combat into EU external policies, prioritizing ocean governance at the 2012 UN Sustainable Development Summit, and leveraging market-state responsibility to close global IUU trade networks, ensuring coherence between trade, environmental, and development policies.",
    "total_score": 0.6671195652173914,
    "total_choice": 6,
    "party_num": 2,
    "id": 14,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.1,
      0.9
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "fisheries",
    "title": "Common fisheries policy: REPORT on the proposal for a regulation of the European Parliament and of the Council on the Common Fisheries Policy",
    "background": "The European Union's Common Fisheries Policy faced persistent challenges including overfishing, declining fish stocks, and resource inefficiency, with scientific warnings about unsustainable practices. Institutional frameworks struggled to balance ecological preservation with fishing industry demands. The Parliament will discuss reforming fisheries management to ensure sustainable resource use and long-term sector viability.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.9827586206896551,
        "choice": 9,
        "stance": "GREEN_EFA absolutely upholds the issue’s emphasis on decentralised fisheries management, perfectly aligning with their decades-long advocacy for zonal decision-making that empowers local stakeholders and replicates Scotland’s successful real-time closure models.  \nGREEN_EFA perfectly aligns with the discard elimination mandate, recognising this as critical to ending the CFP’s historic wastefulness and advancing their 1999-era demands for ecosystem-conscious stock conservation.  \nGREEN_EFA absolutely upholds the linkage between MFF funding and Treaty of Lisbon obligations, effectively advancing their priority to legally bind sustainability targets and prioritise low-impact fishing fleets.  \nGREEN_EFA perfectly aligns with the issue’s inclusivity provisions, particularly its implicit support for small-scale coastal fisheries and differentiated aquaculture approaches that protect marine biodiversity.  \nGREEN_EFA absolutely upholds leveraging co-decision authority to institutionalise transparency, mirroring their insistence on participatory governance to prevent renewed CFP failures."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.4411764705882353,
        "choice": 4,
        "stance": "GUE/NGL partially approves the issue's sustainability framework but demands amendment of Article 12 to enforce a total discard ban with real-time monitoring systems by 2018.  \n\nGUE/NGL requests revisions to Chapter 4 requiring decentralized quota management through regional councils composed of coastal communities and small-scale fishers.  \n\nGUE/NGL insists the MFF Regulation be modified to allocate 30% of fisheries funding to social protection programs for displaced industry workers.  \n\nGUE/NGL demands deletion of Clause 7(b) allowing voluntary transferable fishing concessions, which contradict public resource stewardship principles.  \n\nGUE/NGL calls for binding socioeconomic indicators in Annex III to measure employment levels and wage growth alongside environmental targets."
      }
    ],
    "resolution": "The European Parliament raised the need for sufficient additional resources in the next Multiannual Financial Framework (MFF) for 2014-2020 to enable the EU to fulfill its existing policy priorities, new tasks under the Treaty of Lisbon, and respond to unforeseen challenges, while challenging the Council to identify lower-priority projects if it opposed this approach. It emphasized that the financial impact of the proposal remained indicative pending agreement on the MFF Regulation and stressed the provisional nature of budgetary allocations until final adoption. The resolution called on the Commission to resubmit the proposal to Parliament if substantial amendments were introduced, ensuring legislative transparency. It reiterated the importance of maintaining EU commitments to competitiveness, sustainability, and inclusivity, underlining the proven European added value of existing priorities.",
    "total_score": 0.6657824933687002,
    "total_choice": 6,
    "party_num": 2,
    "id": 15,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.8,
      0.2
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "fisheries",
    "title": "Common organisation of the markets in fishery and aquaculture products: REPORT on the proposal for a regulation of the European Parliament and of the Council on the common organisation of the markets in fishery and aquaculture products",
    "background": "Persistent overfishing and depleted fish stocks under the EU Common Fisheries Policy, exacerbated by unilateral quota increases by non-EU states in shared waters, prompted the Commission to propose updated market regulations. The Parliament will discuss reforming fishery market organisation and addressing unsustainable third-country fishing practices impacting shared resources.",
    "stances": [
      {
        "party_name": "ALDE",
        "score": 0.9036144578313253,
        "choice": 9,
        "stance": "ALDE completely supports the issue's emphasis on sustainable fisheries management, perfectly aligning with their commitment to environmental stewardship and long-term resource viability.  \nALDE highlights the necessity of aquaculture expansion as a strategic response to overfishing, proposing enhanced integration with offshore renewable energy projects to maximize ecological and economic synergies.  \nALDE applauds the focus on rebuilding fish stocks, citing proven success in North Sea and Baltic recovery programs as validation of the issue's scientific approach.  \nALDE emphasizes strict adherence to reformed Common Fisheries Policy voting mechanisms, urging full parliamentary participation to ensure decisive environmental protections.  \nALDE commends the issue's alignment with integrated maritime planning principles, recognizing its potential to preserve Europe's oldest trade while fostering innovative ecosystem management."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.0,
        "choice": 0,
        "stance": "GUE_NGL rejects the issue's centralized management framework as fundamentally inconsistent with their principle of local fisheries governance.  \nGUE_NGL opposes the equal treatment of Member States' fleets, arguing it disproportionately penalizes nations with older vessels and threatens their fishing communities' survival.  \nGUE_NGL highlights that the proposal fails to decentralize decision-making, perpetuating the harmful EU competence consolidation criticized in the Lisbon Treaty's fisheries provisions.  \nGUE_NGL condemns the issue's continuation of top-down resource management, which they identify as the root cause of stock depletion and fisher marginalization.  \nGUE_NGL asserts the proposal overlooks critical regional disparities in fleet modernization needs, favoring industrialized fishing sectors over small-scale operators."
      }
    ],
    "resolution": "The European Parliament raised its position at first reading on the Commission’s 2011 proposal (COM(2011)0416) concerning measures under Articles 42 and 43(2) of the Treaty on the Functioning of the European Union, which relate to fisheries and agricultural policy. The resolution emphasized adopting legislative measures to ensure sustainable resource management and align policies with EU treaty objectives. It called on the Commission to reassess and resubmit the proposal to Parliament if substantial amendments or replacements were planned, ensuring procedural continuity. The Parliament also instructed its President to formally transmit its adopted position to the Council, Commission, and national parliaments, reinforcing inter-institutional dialogue and compliance with legislative processes outlined in Article 294 of the Treaty.",
    "total_score": 0.8222811671087533,
    "total_choice": 8,
    "party_num": 2,
    "id": 16,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.3,
      0.7
    ],
    "veto_party_name": "GUE_NGL"
  },
  {
    "topic": "fisheries",
    "title": "General Fisheries Commission for the Mediterranean Agreement Area: REPORT on the proposal for a regulation of the European Parliament and of the Council on certain provisions for fishing in the GFCM (General Fisheries Commission for the Mediterranean) Agreement Area",
    "background": "The General Fisheries Commission for the Mediterranean (GFCM), established in 1949, governs fisheries in the Mediterranean and Black Sea. The EU, as a contracting party, historically transposed GFCM recommendations via provisional annual regulations, requiring a permanent legal framework to ensure compliance with international obligations and sustainable resource management. The Parliament will discuss a proposed regulation to integrate GFCM measures into EU law, addressing legal certainty and regional fisheries sustainability.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.9272727272727272,
        "choice": 9,
        "stance": "GREEN_EFA absolutely advocates the issue's mandate to apply common conservation standards across Mediterranean and Atlantic fisheries, aligning perfectly with their commitment to ending ecosystem management disparities.  \nGREEN_EFA perfectly aligns with the integration of Mediterranean fisheries into the CFP's operational framework, recognizing this as essential for enforcing accountability and breaking historical cycles of overfishing.  \nGREEN_EFA applauds the issue's rejection of Mediterranean exceptionalism, seeing its binding effort management system as critical to achieving parity with Atlantic conservation outcomes.  \nGREEN_EFA strongly sanctions the issue's systemic approach to stakeholder accountability, which directly advances their decades-long advocacy for unified EU fisheries governance.  \nGREEN_EFA recognizes the issue as a decisive implementation mechanism for their manifesto goal of eliminating Mediterranean overfishing through science-based catch limits and surveillance harmonization."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.06060606060606061,
        "choice": 0,
        "stance": "GUE_NGL rejects the proposal’s infringement on Cyprus’s sovereign rights over its exclusive economic zone, violating UNCLOS principles.  \nGUE_NGL opposes granting the Commission legislative powers in areas where third-country occupation undermines a Member State’s territorial integrity.  \nGUE_NGL highlights the proposal’s failure to safeguard national sovereignty against politically sensitive threats from an accession candidate state.  \nGUE_NGL demands exclusion of delegated acts enabling external interference in maritime resource management under Article 43(2) TFEU.  \nGUE_NGL insists any regulation must explicitly protect Member States’ exclusive rights to seabed resources as per international law.  "
      }
    ],
    "resolution": "The European Parliament raised its position based on the Committee on Fisheries report (A7-0023/2011), aligning with Treaty on the Functioning of the European Union provisions on agriculture and fisheries (Article 43(2)) and the ordinary legislative procedure (Article 294(3)), while incorporating the European Economic and Social Committee’s March 17, 2010 opinion. It formally adopted its first-reading stance, urging the Commission to re-engage Parliament if substantial amendments to the proposal (COM(2009)0477) or a replacement text are planned. The resolution instructed the Parliament’s President to communicate its position to the Council, Commission, and national parliaments, emphasizing procedural adherence and institutional collaboration.",
    "total_score": 0.8256130790190735,
    "total_choice": 8,
    "party_num": 2,
    "id": 17,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.3,
      0.7
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "fisheries",
    "title": "Long-term plan for the anchovy stock in the Bay of Biscay and the fisheries exploiting that stock: REPORT on the proposal for a regulation of the European Parliament and of the Council establishing a long-term plan for the anchovy stock in the Bay of Biscay and the fisheries exploiting that stock",
    "background": "The Bay of Biscay anchovy fishery, closed in 2005 due to stock collapse, reopened in 2010 following recovery. The European Commission proposed a 2009 management plan to ensure sustainable exploitation, coinciding with the Treaty of Lisbon’s procedural changes. The Parliament will discuss establishing a long-term regulatory framework for anchovy stock conservation and fisheries management.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9083969465648855,
        "choice": 9,
        "stance": "EPP entirely supports the issue’s strict adherence to Lisbon Treaty provisions, ensuring Parliament’s co-decision authority over fishing quotas aligns perfectly with their institutional sovereignty priorities.  \nEPP perfectly aligns with the integration of artisanal fisheries’ historic rights in Amendment 7, reflecting their commitment to protecting coastal communities’ socio-economic stability.  \nEPP unequivocally supports the harvest control rule’s scientific framework, recognizing its critical role in achieving maximum sustainable yield as mandated by UN sustainability goals.  \nEPP applauds the issue’s rejection of stock-splitting precedents, which aligns with their principled stance on unified fisheries management under the Common Fisheries Policy.  \nEPP emphasizes the imperative of resolving institutional deadlocks through trilateral dialogue, echoing their manifesto pledge for Lisbon Treaty-compliant collaborative governance."
      },
      {
        "party_name": "EFD",
        "score": 0.4838709677419355,
        "choice": 4,
        "stance": "EFD partially endorses the anchovy stock plan only if Article 2 is amended to exempt member states from EU quota systems, restoring national fisheries sovereignty.  \nEFD requests revisions to Annex IV to include binding economic impact assessments addressing GBP 11 billion annual losses under current CFP frameworks.  \nThe proposal overlooks critical aspects such as job losses in dependent industries, requiring direct compensation mechanisms in Article 7(c).  \nEFD opposes centralized stock management clauses as inconsistent with their manifesto commitment to full withdrawal from EU fisheries policy."
      }
    ],
    "resolution": "The European Parliament raised its position on a Commission proposal (COM(2009)0399) concerning interinstitutional decision-making procedures post-Lisbon Treaty, emphasizing adherence to Treaty provisions (Article 37 EC Treaty, Article 294(2) and 43(2) TFEU) and its Rules of Procedure (Rule 55). It adopted its first-reading stance based on the Committee on Fisheries’ report (A7-0299/2010), urging the Commission to re-engage Parliament if proposing significant amendments or alternative texts. The resolution instructed the Parliament’s President to transmit its position to the Council, Commission, and national parliaments, ensuring alignment with procedural continuity under the Lisbon Treaty’s framework.",
    "total_score": 0.8315217391304348,
    "total_choice": 8,
    "party_num": 2,
    "id": 18,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.7,
      0.3
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "fisheries",
    "title": "Imports from Greenland of fishery products: REPORT on the proposal for a Council decision laying down rules for imports into the European Union from Greenland of fishery products, live bivalve molluscs, echinoderms, tunicates, marine gastropods and by-products thereof",
    "background": "Greenland, an overseas country with fisheries product exports to the EU governed by Protocol No 34 of the EU Treaties, required alignment with EU health and market rules. The Parliament will discuss regulatory adjustments for Greenland’s fishery imports under EU internal market provisions, ensuring compliance with food safety and trade protocols.",
    "stances": [
      {
        "party_name": "EFD",
        "score": 0.6451612903225806,
        "choice": 6,
        "stance": "EFD supports the inclusion of regional fisheries management frameworks in Articles 1-3, aligning with decentralized conservation approaches demonstrated in Scotland.  \nEFD advises amending Protocol (No 34) to mandate sustainability impact assessments for all EU-Greenland fishing agreements, preventing stock depletion patterns seen in Comoros.  \nEFD highlights concerns regarding Article 4's lack of reciprocity mechanisms, noting how unequal EU fishing capacities elsewhere displaced local livelihoods.  \nEFD proposes adding a recital requiring consultation with Greenlandic small-scale fishers, mirroring successful community-led models in the Canaries.  \nEFD urges the Commission to apply lessons from West African overfishing crises by implementing real-time catch monitoring technologies in Greenlandic waters.  "
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.9090909090909091,
        "choice": 9,
        "stance": "GREEN_EFA fully supports the issue's reinforcement of parliamentary oversight mechanisms, perfectly aligning with their commitment to transparent governance in EU-Greenland fisheries relations.  \nGREEN_EFA applauds the requirement for Commission accountability in future amendments, seeing this as vital to prevent replication of flawed implementation patterns observed in third-country agreements like the Comoros case.  \nGREEN_EFA emphasizes that the issue's focus on Protocol No 34 effectively safeguards sustainable development priorities central to their ocean stewardship agenda.  \nGREEN_EFA recognizes the issue's procedural rigor as a model for ensuring future agreements prioritize local capacity-building over extractive resource access, addressing concerns raised about employment and value retention.  \nGREEN_EFA highlights the issue's alignment with TFEU Article 203 as critical for maintaining ecosystem-based management standards they champion globally."
      }
    ],
    "resolution": "The European Parliament raised its position on a proposal concerning Greenland, adopting its first reading stance based on the Treaty on the Functioning of the European Union (TFEU), specifically Articles 203, 43(2), and 204, as well as Protocol (No 34) on Special Arrangements with Greenland. The resolution emphasized the legal framework for EU-Greenland relations, particularly regarding fisheries and economic cooperation. It called on the Commission to revisit the proposal if substantial amendments or replacements were planned, ensuring parliamentary oversight. The Parliament also instructed its President to formally communicate its adopted position to the Council, the Commission, and national parliaments, reinforcing procedural transparency and institutional alignment.",
    "total_score": 0.888283378746594,
    "total_choice": 8,
    "party_num": 2,
    "id": 19,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.3,
      0.7
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "fisheries",
    "title": "Measures for the recovery of European eel stocks: REPORT on the proposal for a regulation of the European Parliament and of the Council amending Council Regulation (EC) No 1100/2007 establishing measures for the recovery of the stock of European eel",
    "background": "Persistent declines in European eel populations, classified as critically endangered by IUCN due to overfishing, habitat degradation, and migration barriers, prompted the European Commission’s 2012 proposal to amend 2007 conservation measures. The Parliament will discuss regulatory adjustments to improve stock recovery strategies.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.9655172413793104,
        "choice": 9,
        "stance": "GREEN_EFA absolutely sanctions the issue’s procedural transparency and inter-institutional collaboration measures, perfectly aligning with their commitment to democratic governance and environmental stewardship.  \nGREEN_EFA applauds the alignment with fundamental EU legal principles, ensuring that fisheries management upholds the rule of law and shared constitutional values."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.8857142857142857,
        "choice": 8,
        "stance": "GUE_NGL strongly upholds the issue’s emphasis on inter-institutional collaboration and democratic oversight, aligning with their commitment to transparent EU legislative processes.  \nGUE_NGL applauds the requirement for Commission re-engagement with Parliament on substantive amendments, a safeguard against opaque policy shifts in fisheries management.  \nGUE_NGL proposes extending consultation periods with small-scale fishers during implementation to enhance equity without opposing the regulation’s conservation framework.  \nGUE_NGL endorses the directive to communicate the position to national parliaments, reinforcing subsidiarity principles central to their EU governance agenda."
      }
    ],
    "resolution": "The European Parliament raised its position on a legislative proposal concerning fisheries policy (COM(2012)0413), grounded in Article 43(2) of the Treaty on the Functioning of the European Union, which mandates the establishment of rules for managing fisheries resources. The resolution endorsed the Committee on Fisheries’ report (A7-0242/2013) as the basis for its first-reading stance, emphasizing alignment with the European Economic and Social Committee’s opinion of 14 November 2012. It urged the Commission to re-engage Parliament if proposing substantial amendments or alternative texts to ensure legislative coherence and democratic oversight. The Parliament further directed its President to formally communicate its adopted position to the Council, the Commission, and national parliaments, reinforcing procedural transparency and inter-institutional collaboration under the EU’s ordinary legislative procedure.",
    "total_score": 0.5574412532637075,
    "total_choice": 5,
    "party_num": 2,
    "id": 20,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.6,
      0.4
    ],
    "veto_party_name": "GUE_NGL"
  },
  {
    "topic": "fisheries",
    "title": "Measures in relation to countries allowing non-sustainable fishing for the purpose of the conservation of fish stocks: REPORT on the proposal for a regulation of the European Parliament and of the Council on certain measures in relation to countries allowing non-sustainable fishing for the purpose of the conservation of fish stocks",
    "background": "Escalating unilateral mackerel quota increases by Iceland and the Faroe Islands in the northeast Atlantic, conflicting with EU-Norway management agreements, prompted concerns over stock sustainability under UNCLOS obligations. The EU sought enforceable mechanisms to address third-country overfishing threatening shared resources. The Parliament will discuss trade-related measures to deter non-sustainable fishing practices impacting transboundary fish stocks.",
    "stances": [
      {
        "party_name": "EFD",
        "score": 0.5483870967741935,
        "choice": 5,
        "stance": "EFD supports the issue’s conservation aims but advises amending Article 3 to prioritize repatriation of fishing grounds to member states, citing the ecological and economic failures of centralized EU management under the CFP.  \nEFD proposes incorporating Norway’s discard ban model into the regulation, allowing regional adaptations to avoid unenforceable rules in mixed fisheries, as highlighted in Committee deliberations.  \nEFD highlights concerns that trade coherence measures risk perpetuating foreign fleet dominance in national waters, urging explicit clauses to restrict non-local vessels from accessing territorial fishing zones.  \nEFD slightly supports sustainability targets if paired with economic revitalization plans for coastal communities impacted by fleet reductions, referencing the UK’s diminished fishing industry under CFP quotas.  \nEFD urges explicit recognition of member states’ rights under UNCLOS to independently manage maritime resources, ensuring future agreements align with national stewardship rather than EU-wide bureaucratic mandates."
      },
      {
        "party_name": "SD",
        "score": 0.9214659685863874,
        "choice": 9,
        "stance": "SD firmly supports the issue's integration of scientific data requirements with international cooperation frameworks, perfectly aligning with SD's commitment to evidence-based marine resource management.  \nSD perfectly aligns with the mandate for enhanced consumer labeling protocols, recognizing this as critical for advancing transparency in global seafood supply chains as outlined in SD's 2023 sustainability manifesto.  \nSD firmly supports the proposed closed-area networks for fish stock recovery, emphasizing their necessity to reconcile ecological preservation with long-term fishing community livelihoods.  \nSD proposes strengthening Article 7's enforcement mechanisms to include real-time catch documentation systems, enhancing traceability without opposing the issue's core objectives.  \nSD perfectly aligns with the issue's condemnation of unilateral quota increases, affirming this as essential to uphold multilateral sustainability agreements central to SD's global governance principles."
      }
    ],
    "resolution": "The European Parliament raised its adoption of a position at first reading on the Commission’s 2011 proposal (COM(2011)0888) concerning fisheries and development policies, aligning with Treaty obligations under Articles 207(2) and 43(2) of the TFEU. The resolution emphasized the need for coherence between trade, fisheries agreements, and sustainable development, urging the Commission to ensure future amendments or replacements of the proposal are resubmitted to Parliament for review. It mandated the President to formally transmit Parliament’s position to the Council, Commission, and national parliaments, reinforcing institutional transparency and procedural adherence while integrating inputs from the Committee on Fisheries and the Committee on Development.",
    "total_score": 0.8740053050397878,
    "total_choice": 8,
    "party_num": 2,
    "id": 21,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.2,
      0.8
    ],
    "veto_party_name": "EFD"
  },
  {
    "topic": "fisheries",
    "title": "Illegal, unreported and unregulated fishing: REPORT on the proposal for a regulation of the European Parliament and of the Council amending Council Regulation (EC) No 1005/2008 establishing a Community system to prevent, deter and eliminate illegal, unreported and unregulated fishing",
    "background": "Persistent challenges in enforcing international fisheries regulations and addressing non-compliant third-country practices under the EU's 2008 IUU framework, alongside procedural updates required by the Lisbon Treaty, prompted regulatory review. The Parliament will discuss amendments to strengthen governance mechanisms and align enforcement procedures with current institutional mandates.",
    "stances": [
      {
        "party_name": "ALDE",
        "score": 0.891566265060241,
        "choice": 8,
        "stance": "ALDE strongly accepts the issue's emphasis on Treaty-compliant enforcement mechanisms, aligning with our commitment to lawful multilateral fisheries governance.  \nALDE endorses targeting emblematic IUU cases per the \"Jimmy\" enforcement strategy to establish deterrence precedents while maintaining due process standards.  \nALDE proposes augmenting Commission enforcement capacities through dedicated task forces, addressing resource gaps noted in the debate without opposing the regulation's core structure.  \nALDE urges immediate activation of trade sanctions against systematic mackerel overfishers, enhancing the issue's operational responsiveness to parliamentary mandates.  \nThis aligns perfectly with ALDE's environmental stewardship priorities, particularly in combating marine depletion through rule-based international cooperation."
      },
      {
        "party_name": "SD",
        "score": 0.9105263157894737,
        "choice": 9,
        "stance": "SD fundamentally upholds the issue’s demand for a transparent and exhaustive list of all countries and vessels engaged in IUU fishing, perfectly aligning with their commitment to eradicating maritime criminal networks.  \nSD perfectly aligns with the call for stringent enforcement mechanisms, emphasizing Spain’s rigorous control model as a benchmark for harmonizing EU-wide inspections and sanctions.  \nSD fully supports the updated Regulation 1005/2008 as a critical tool to combat IUU fishing, stressing its alignment with global biodiversity protection and sustainable marine resource management.  \nSD underscores the necessity of binding third-country compliance with EU standards, reflecting their prioritization of equitable market conditions and environmental justice.  \nSD advocates for the creation of a European coast guard to operationalize the issue’s goals, reinforcing cross-border coordination to eliminate regulatory loopholes."
      }
    ],
    "resolution": "The European Parliament raised its position on a legislative proposal concerning fisheries policy, adopting its first reading stance and urging the Commission to maintain transparency by re-engaging Parliament if significant amendments or replacements to the original proposal (COM(2012)0332) are considered. The resolution emphasized procedural adherence to Treaty obligations, particularly Article 43(2) of the TFEU, and called for the Council, Commission, and national parliaments to be formally notified of Parliament’s position. It underscored the importance of aligning the proposal with broader EU objectives, reflecting input from the European Economic and Social Committee’s March 2012 opinion, while avoiding substantive changes without parliamentary scrutiny.",
    "total_score": 0.8859416445623343,
    "total_choice": 8,
    "party_num": 2,
    "id": 22,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.4,
      0.6
    ],
    "veto_party_name": "ALDE"
  },
  {
    "topic": "fisheries",
    "title": "Removal of fins of sharks on board vessels: REPORT on the proposal for a regulation of the European Parliament and of the Council amending Council Regulation (EC) No 1185/2003 on the removal of fins of sharks on board vessels",
    "background": "The EU prohibited shark finning in 2003 but permitted onboard fin removal under special permits, raising enforcement and sustainability concerns. Scientific assessments highlighted risks to shark populations, prompting calls to align regulations with global conservation efforts. The Parliament will discuss amending fin removal rules to strengthen compliance and ecological safeguards.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.9137931034482759,
        "choice": 9,
        "stance": "GREEN_EFA absolutely promotes the issue's elimination of finning exemptions, perfectly aligning with their mandate to eradicate cruel fishing practices.  \nGREEN_EFA perfectly aligns with the demand for fins-attached landing requirements, recognizing this as the global gold standard in shark conservation.  \nGREEN_EFA applauds the issue’s urgency in closing loopholes that prolonged unsustainable exploitation by specific fleets, matching their 2011 advocacy priorities.  \nGREEN_EFA emphasizes the critical linkage between this ban and broader CFP reforms prioritizing decentralized, ecosystem-based fisheries management.  \nGREEN_EFA highlights the issue’s consistency with protecting artisanal fishing communities through science-based stock renewal measures."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.4117647058823529,
        "choice": 4,
        "stance": "GUE_NGL partially advocates the prohibition on shark finning as a necessary measure but requests revisions to Article 3 ensuring compensation for small-scale fishers disproportionately impacted by gear restrictions.  \nGUE_NGL underscores the issue’s failure to address historical overexploitation by European fleets in third countries, demanding binding clauses to restrict EU vessels’ access to developing nations’ waters.  \nGUE_NGL acknowledges amendments removing discriminatory technical measures against Portuguese fleets yet urges stricter scientific review requirements for future fishing gear regulations.  \nGUE_NGL highlights contradictions between the issue’s environmental goals and its silence on export-driven market incentives for shark products, proposing trade restrictions on fin exports.  \nGUE_NGL cautions that partnership agreements with third countries risk perpetuating resource extraction models unless amended to mandate local value-added processing quotas."
      }
    ],
    "resolution": "The European Parliament raised its position on the Commission’s 2011 proposal (COM(2011)0798) concerning fisheries and environmental policies under the Treaty on the Functioning of the European Union, specifically Articles 294(2), 43(2), and 294(3). It adopted its first-reading stance, emphasizing the need for sustainable resource management and alignment with environmental goals. The resolution incorporated input from the Committee on Fisheries and the Committee on the Environment, Public Health, and Food Safety (report A7-0295/2012), urging the Commission to re-engage Parliament if proposing significant amendments or alternative texts. It further directed the Parliament’s President to communicate its position to the Council, Commission, and national parliaments, ensuring transparency and adherence to legislative procedures.",
    "total_score": 0.751660026560425,
    "total_choice": 7,
    "party_num": 2,
    "id": 23,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.8,
      0.2
    ],
    "veto_party_name": "GUE_NGL"
  },
  {
    "topic": "fisheries",
    "title": "Multiannual plan for the western stock of Atlantic horse mackerel and the fisheries exploiting that stock: REPORT on the proposal for a regulation of the European Parliament and of the Council establishing a multi-annual plan for the western stock of Atlantic horse mackerel and the fisheries exploiting that stock",
    "background": "Following the 2009 European Commission proposal for a multiannual management plan for the western Atlantic horse mackerel stock, delays arose from post-Lisbon Treaty institutional adjustments and debates over aligning scientific assessments with sustainable fishing practices. The Parliament will discuss establishing a long-term regulatory framework to balance stock conservation and fisheries exploitation in EU waters.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.916030534351145,
        "choice": 9,
        "stance": "EPP fully accepts the multiannual plan’s harvest control rule as perfectly aligning with sustainable yield objectives under Article 43(2) of the TFEU.  \nEPP perfectly aligns with the issue’s legal coherence by defending Parliament’s Lisbon Treaty-grounded role in setting fishing opportunities through ordinary legislative procedure.  \nEPP proposes strengthening socio-economic protections for artisanal fisheries through Amendment 7’s explicit recognition of historic rights in Zone 8C.  \nEPP fully supports maintaining single-stock management integrity while advocating enhanced regional implementation flexibility through Council collaboration.  \nEPP perfectly aligns with scientific prioritization by rejecting fragmented TACs and upholding ICES assessments as the basis for multiyear planning."
      },
      {
        "party_name": "EFD",
        "score": 0.5483870967741935,
        "choice": 5,
        "stance": "EFD supports the multi-annual plan's framework for stock management but advises revising Annex I to mandate real-time catch reporting, reducing the discard practices criticized in North Sea fisheries.  \nEFD proposes amending Article 6 to include transitional funding for coastal communities impacted by quota systems, addressing the GBP 2.8 billion annual subsidy burden noted in national assessments.  \nEFD recommends stricter review intervals in Article 9 to align conservation targets with regional economic viability, preventing further job losses in dependent industries.  \nEFD expresses concern that the issue perpetuates centralized CFP governance models, urging explicit provisions for member-state flexibility in fishery recovery strategies.  \nEFD advises incorporating discard ban enforcement mechanisms into Chapter III to mitigate ecological damage, referencing the 880,000 tonnes annual waste cited in policy critiques."
      }
    ],
    "resolution": "The European Parliament raised its position on a legislative proposal concerning fisheries policy, based on the Commission’s initial proposal (COM(2009)0189) and the implications of the Treaty of Lisbon’s entry into force outlined in the Commission’s communication (COM(2009)0665). It adopted its first-reading stance, emphasizing alignment with Article 43(2) of the Treaty on the Functioning of the European Union, which governs common agricultural and fisheries policies. The resolution incorporated the European Economic and Social Committee’s opinion from 17 March 2010 and urged the Commission to re-engage Parliament if proposing substantial amendments to or replacing the original text. The Parliament directed its President to transmit its formal position to the Council, Commission, and national parliaments, ensuring procedural continuity under Rule 55 of its Rules of Procedure and reflecting the Committee on Fisheries’ recommendations (report A7-0296/2010). The focus remained on maintaining legislative coherence and interinstitutional accountability.",
    "total_score": 0.8396739130434783,
    "total_choice": 8,
    "party_num": 2,
    "id": 24,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.8,
      0.2
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "fisheries",
    "title": "Stock of herring distributed to the west of Scotland: REPORT on the proposal for a regulation of the European Parliament and of the Council amending Council Regulation (EC) No 1300/2008 of 18 December 2008 establishing a multi-annual plan for the stock of herring distributed to the west of Scotland and the fisheries exploiting that stock",
    "background": "The 2008 multi-annual plan for west Scotland herring stock management required revision under evolving EU governance frameworks, including post-Lisbon Treaty legislative procedures. Institutional disagreements emerged over implementing versus delegated acts for fisheries policy adjustments. The Parliament will discuss amending the regulatory framework to align with Treaty obligations and scientific management practices.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.7758620689655172,
        "choice": 7,
        "stance": "GREEN_EFA strongly advocates the issue’s reinforcement of parliamentary oversight under Treaty provisions, aligning perfectly with their longstanding commitment to transparent and ecologically responsible fisheries governance.  \nGREEN_EFA applauds the unanimous committee adoption as a critical advancement toward dismantling failed centralized systems, effectively advancing their priority of regionalized stock management for sustainable marine ecosystems.  \nGREEN_EFA proposes integrating binding sea-basin cooperation mechanisms into ongoing CFP reforms to operationalize decentralization while preserving the issue’s procedural safeguards.  \nGREEN_EFA emphasizes the urgency of prioritizing science-based stock conservation over institutional turf wars, strongly endorsing the report’s alignment with long-term community viability.  \nGREEN_EFA highlights the need to resolve Treaty of Lisbon ambiguities through participatory reform processes to prevent bureaucratic stagnation in achieving conservation targets."
      },
      {
        "party_name": "SD",
        "score": 0.8743455497382199,
        "choice": 8,
        "stance": "SD strongly approves the issue’s emphasis on parliamentary oversight through Article 294(2) TFEU, aligning with SD’s commitment to transparent EU decision-making and fisheries sustainability.  \nSD approves the integration of delegated acts for adapting fishing mortality rates to scientific findings, ensuring dynamic management of herring stocks while maintaining legislative accountability.  \nSD proposes strengthening procedural alignment by urging the Council to fully adopt Treaty of Lisbon provisions on delegated acts, enhancing Parliament’s role in fisheries governance without opposing the core plan.  \nSD applauds the issue’s procedural rigor in communicating positions to national parliaments, reflecting SD’s priority of multi-level democratic engagement in environmental policy.  \nSD highlights the need to future-proof the plan by explicitly linking stock migration protocols to preemptive scientific review, ensuring continuity in conservation efforts."
      }
    ],
    "resolution": "The European Parliament raised its position on the Commission’s proposal (COM(2011)0760) concerning fisheries policy, adopting its stance at first reading as outlined in the Committee on Fisheries’ report (A7-0145/2012). It emphasized adherence to Treaty provisions, particularly Article 294(2) and Article 43(2) of the Treaty on the Functioning of the European Union, which govern legislative procedures. The resolution urged the Commission to re-engage Parliament if it substantially amends or replaces the proposal, ensuring parliamentary oversight. It also directed its President to formally communicate Parliament’s position to the Council, the Commission, and national parliaments, reflecting procedural alignment with the European Economic and Social Committee’s opinion from January 2012. The focus remained on consolidating Parliament’s legislative role and maintaining transparency in the EU decision-making process.",
    "total_score": 0.786472148541114,
    "total_choice": 7,
    "party_num": 2,
    "id": 25,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.6,
      0.4
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "fisheries",
    "title": "Small-scale and artisanal fisheries and CFP reform: REPORT on small-scale coastal fishing, artisanal fishing and the reform of the common fisheries policy",
    "background": "The Common Fisheries Policy faced challenges addressing socio-economic vulnerabilities, structural constraints, and data gaps affecting small-scale coastal and artisanal fisheries, particularly in outermost regions, amid calls for sustainable resource management and equitable access. The Parliament will discuss integrating these fisheries into CFP reform, balancing conservation goals with their role in coastal communities' livelihoods and food security.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.7100371747211895,
        "choice": 7,
        "stance": "EPP strongly accepts the rejection of mandatory transferable fishing concessions, aligning with their commitment to protecting small-scale fisheries from economic discrimination, and proposes enhancing accountability through EMFF ex-post conditionality mechanisms.  \nEPP approves the issue’s emphasis on modernizing aging fleets for safety and sustainability, advocating for delegated acts to establish clear technical criteria while maintaining capacity ceilings.  \nEPP endorses regionally tailored fisheries agreements but suggests strengthening transparency clauses to ensure third-country compliance with international sustainability standards before access fee negotiations.  \nEPP aligns with the shark finning ban proposal, recommending additional verification measures to confirm imported fisheries meet EU sustainability benchmarks without undermining domestic fleets.  \nEPP strongly accepts increased EMFF funding for coastal communities, emphasizing the need to prioritize projects that integrate youth training and address generational renewal in artisanal fishing sectors."
      },
      {
        "party_name": "ALDE",
        "score": 0.3373493975903614,
        "choice": 3,
        "stance": "ALDE partly accepts the issue's focus on small-scale fisheries but demands amendments to Article 349 TFEU provisions to explicitly ban EU-subsidized vessels from reflagging to non-EU registries, addressing systemic loopholes in fleet accountability.  \nALDE objects to the issue’s failure to mandate EU-equivalent sustainability standards for all imported fisheries products, creating market imbalances that contradict ALDE’s insistence on fair competition for European artisanal producers.  \nALDE requests revisions to Clause 22 on quota allocation, requiring member states – not just the EU – to prioritize small-scale fleets in catch share distributions, reflecting Chris Davies’ critique of national-level mismanagement.  \nALDE highlights the issue’s omission of binding mechanisms to ensure developing countries retain priority access to their coastal resources, inconsistent with ALDE’s development-focused trade principles articulated by Gesine Meissner.  \nALDE supports gender equality measures but requires stricter enforcement language in Clause 17 to penalize member states failing to implement equal pay verification systems for women in auxiliary fishing roles."
      }
    ],
    "resolution": "The European Parliament raised the critical role of small-scale and artisanal fishing, which constitutes 80% of EU fishing activity through vessels under 15 meters, in sustaining coastal communities, employment, and food security, while emphasizing its vulnerability to economic shocks, aging fleets, and insufficient data. It called for decentralized, regionally tailored fisheries management, rejecting mandatory transferable fishing concessions (TFCs) as economically discriminatory and ecologically ineffective, and advocated flexible, science-based policies co-developed with local stakeholders. The resolution stressed the need to modernize fleets for safety and sustainability, enhance gender equality by recognizing women’s contributions (85% of whom work in small-scale fisheries) through equal pay, social protections, and occupational disease recognition, and address market imbalances by creating a European sustainability label for artisanal products. It urged increased EMFF funding for coastal communities, prioritizing projects with socio-environmental benefits, compensating fishermen during biological rest periods, and improving data collection on fish stocks, socio-economic impacts, and gender disparities. Additionally, it highlighted the importance of protecting outermost regions under Article 349 TFEU, promoting sustainable aquaculture, and ensuring imported fisheries meet EU sustainability standards.",
    "total_score": 0.6294820717131474,
    "total_choice": 6,
    "party_num": 2,
    "id": 26,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.8,
      0.2
    ],
    "veto_party_name": "ALDE"
  },
  {
    "topic": "fisheries",
    "title": "Specific actions in the Common Fisheries Policy for developing the role of women: REPORT on specific actions in the Common Fisheries Policy for developing the role of women",
    "background": "Women's labor in EU fisheries and aquaculture sectors faced persistent underrecognition despite comprising over 100,000 workers, with systemic barriers to legal status, social protections, and gender-disaggregated data. The Parliament will discuss integrating gender equality measures into the Common Fisheries Policy to address occupational disparities and enhance women's socioeconomic inclusion in maritime industries.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.7335766423357665,
        "choice": 7,
        "stance": "EPP strongly advocates the issue's mandate for gender-disaggregated data collection and social protections, which aligns perfectly with EPP's longstanding commitment to equitable labor conditions and maritime community welfare.  \nEPP approves leveraging EMFF funds for women's microcredit access but proposes extending support to include transitional assistance for small-scale fishermen in Croatia facing age-based restrictions, enhancing regional cohesion.  \nEPP applauds the directive compliance measures for family fishing businesses as effectively advancing EPP's priority of formalizing informal economic contributions through legal status recognition.  \nEPP endorses the call for women's participation in advisory councils, noting this matches EPP's 2023 manifesto pledge to double female representation in sectoral governance by 2027.  \nEPP highlights the need to operationalize shellfish gatherers' injury compensation through EMFF-backed insurance schemes, reinforcing EPP's focus on preventive healthcare in hazardous occupations."
      },
      {
        "party_name": "SD",
        "score": 0.6564102564102564,
        "choice": 6,
        "stance": "SD supports the issue’s emphasis on gender-disaggregated data collection and advises amending Article 5 to mandate annual reporting by Member States on progress in closing wage gaps.  \nSD highlights the need to expand EMFF funding clauses to prioritize grants for women-led aquaculture cooperatives, citing successful models in Sardinia and Sicily as benchmarks.  \nSD suggests strengthening Annex II to include subsidies for ergonomic equipment tailored to shellfish gatherers, addressing joint injury risks highlighted in the debate.  \nSD urges harmonizing Directive 2010/41/EU compliance by adding explicit pension portability guarantees for women in cross-border family fishing enterprises.  \nSD advises integrating gender equality training into fisheries advisory council protocols, proposing a 30% participation quota for women in Article 7 decision-making roles."
      }
    ],
    "resolution": "The European Parliament raised concerns about the underrecognition and invisibility of women’s contributions to the fisheries and aquaculture sectors, noting that over 100,000 women work in these industries across the EU, with 4% in extractive roles, 30% in aquaculture (notably shellfish gathering), and 60% in processing. It highlighted their harsh working conditions, lack of legal and social protections, wage disparities, and exclusion from decision-making roles. The resolution urged the Commission and Member States to improve gender-disaggregated data collection, harmonize statistical indicators, and recognize women’s labor through legal status, social benefits (including pensions, maternity leave, and occupational disease coverage for joint/back injuries), and equal pay. It called for leveraging the European Maritime and Fisheries Fund (EMFF) to support women’s initiatives, microcredit access, and emergency compensation during fishing bans, while promoting women’s participation in advisory councils and ensuring compliance with Directive 2010/41/EU to grant self-employed-equivalent rights to women in family fishing businesses. The resolution also emphasized integrating gender equality into fisheries agreements, research programs, and the Common Fisheries Policy, stressing the need to address poverty, violence against women, and sustainable development in fishing-dependent regions.",
    "total_score": 0.6109660574412533,
    "total_choice": 6,
    "party_num": 2,
    "id": 27,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.5,
      0.5
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "fisheries",
    "title": "Use of alien and locally absent species in aquaculture: REPORT on the proposal for a regulation of the European Parliament and of the Council amending Regulation (EC) No 708/2007 concerning the use of alien and locally absent species in aquaculture",
    "background": "The European Commission proposed amending a 2007 regulation on aquaculture species use, following research on environmental risks and administrative burdens. The Parliament will discuss balancing aquaculture industry needs with biodiversity protection through updated rules for alien and locally absent species in closed facilities.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9083969465648855,
        "choice": 9,
        "stance": "EPP firmly advocates the issue's strict adherence to Lisbon Treaty provisions ensuring Parliament's co-decision authority in fisheries management, perfectly aligning with their institutional reform priorities.  \nEPP perfectly aligns with the issue's socioeconomic sustainability focus through Amendment 7's protection of artisanal fisheries in Area 8C, enhancing coastal community preservation while maintaining single-stock integrity.  \nEPP fully supports the streamlined aquaculture regulations as exemplifying their commitment to reducing administrative burdens while maintaining rigorous environmental safeguards for alien species.  \nEPP endorses the harvest control rule mechanism as scientifically robust implementation of maximum sustainable yield principles, consistent with their 2023 manifesto on ecosystem-based fisheries governance.  \nEPP aligns completely with the urgency to resolve institutional deadlocks through trilateral dialogue, prioritizing functional application of Article 43(2) TFEU over procedural delays in stock management."
      },
      {
        "party_name": "EFD",
        "score": 0.5806451612903226,
        "choice": 5,
        "stance": "EFD supports the issue's recognition of regional aquaculture challenges but urges explicit safeguards against EU-wide ecological mismanagement  \nEFD advises amending Article 3 to require socioeconomic impact assessments specific to national fishing industries  \nEFD highlights concerns about persistent EU structural failures in fisheries policy, citing GBP 11.1 billion annual losses as evidence for subsidiarity principles  \nEFD endorses transparency mechanisms but proposes mandatory consultation with coastal communities before species introductions  \nEFD recommends benchmarking aquaculture rules against third-country practices to prevent competitive disadvantages"
      }
    ],
    "resolution": "The European Parliament raised the need to adapt fisheries management measures in the EU’s outermost regions under Article 349 of the Treaty on the Functioning of the European Union (TFEU), aligning with the Commission’s 2009 proposal (COM(2009)0541) to address specific regional challenges. It emphasized legal coherence with the Treaty of Lisbon, particularly Articles 43(2) and 294(3) TFEU, and endorsed the Committee on Fisheries’ report (A7‑0184/2010) to ensure tailored policies for these regions. The resolution adopted Parliament’s first-reading position, urging the Commission to maintain transparency by reconsulting Parliament if proposing substantial amendments. It instructed its President to communicate Parliament’s stance to the Council, Commission, and national parliaments, reinforcing interinstitutional cooperation while prioritizing the socioeconomic sustainability of fisheries in outermost areas.",
    "total_score": 0.8668478260869565,
    "total_choice": 8,
    "party_num": 2,
    "id": 28,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.6,
      0.4
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "fisheries",
    "title": "Scheme of control and enforcement applicable in the area covered by the Convention on future multilateral cooperation in the North-East Atlantic fisheries: REPORT on the proposal for a regulation of the European Parliament and of the Council laying down a Scheme of control and enforcement applicable in the area covered by the Convention on future multilateral cooperation in the North-East Atlantic fisheries",
    "background": "The 1978 North-East Atlantic Fisheries Convention established multilateral cooperation through NAFO, amended in 2007-2008 to modernize management structures and align with international standards. The EU, as a contracting party, required ratification to comply with updated obligations. The Parliament will discuss ratifying the amended convention and implementing updated control measures under the agreement.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9083969465648855,
        "choice": 9,
        "stance": "EPP firmly accepts the issue's immediate transposition of NEAFC control schemes into EU law, perfectly aligning with its commitment to eradicate illegal fishing through harmonized enforcement.  \nEPP perfectly aligns with the report's clarification of delegated acts under Article 290 TFEU, ensuring institutional balance while maintaining Parliament’s legislative oversight over fisheries management.  \nEPP firmly accepts the ban on non-ratified frozen fish landings, strengthening traceability measures to protect coastal communities from unfair competition and dubious imports.  \nEPP perfectly supports the issue’s emphasis on sustainable resource exploitation, recognizing its critical role in preserving fish stocks for future generations as outlined in CFP objectives.  \nEPP firmly accepts leveraging aquaculture development opportunities alongside robust controls, advancing both economic resilience in fishing regions and long-term food security goals."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.7941176470588235,
        "choice": 7,
        "stance": "GUE_NGL strongly advocates the issue's framework for multilateral fisheries control, aligning with their commitment to sustainable resource management and combating illegal fishing.  \nGUE_NGL applauds the enhanced monitoring requirements as a critical advancement in ensuring transparency and accountability within regional fisheries organisations.  \nGUE_NGL proposes amending the regulation to formalize the retrocession of French cod quotas to Saint Pierre and Miquelon through an annex or supplementary agreement, ensuring prior commitments are legally binding.  \nGUE_NGL emphasizes the necessity of revising cofinancing rates under the Common Fisheries Policy to exceed 50%, ensuring Member States receive adequate financial support for monitoring obligations."
      }
    ],
    "resolution": "The European Parliament raised its position on a Commission proposal (COM(2009)0151) related to interinstitutional decision-making procedures following the Treaty of Lisbon’s entry into force, referencing Article 37 of the EC Treaty, Article 294(3) and Article 43(2) of the Treaty on the Functioning of the European Union, and the Commission’s Communication (COM(2009)0665). It adopted its first-reading position, approved annexed joint statements by Parliament, the Council, and the Commission, and called on the Commission to resubmit the proposal if intending substantial amendments or replacement. The Parliament also instructed its President to transmit its position to the Council, Commission, and national parliaments, while considering inputs such as the European Economic and Social Committee’s March 2010 opinion and the Committee on Fisheries’ report (A7-0260/2010). The resolution emphasized procedural continuity and institutional alignment under the Lisbon Treaty framework.",
    "total_score": 0.8641304347826086,
    "total_choice": 8,
    "party_num": 2,
    "id": 29,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.5,
      0.5
    ],
    "veto_party_name": "GUE_NGL"
  },
  {
    "topic": "fisheries",
    "title": "EU-Liberia sustainable fisheries partnership agreement: RECOMMENDATION on the draft Council decision on the conclusion on behalf of the European Union of the Sustainable Fisheries Partnership Agreement between the European Union and the Republic of Liberia and the Implementation Protocol thereto",
    "background": "The EU and Liberia signed a 2015 Sustainable Fisheries Partnership Agreement to govern access for EU vessels, promote sectoral development, and combat illegal fishing, amid Liberia's post-Ebola economic challenges and coastal resource management needs. The Parliament will discuss concluding the agreement and its protocol on fisheries resource access and sectoral policy cooperation.",
    "stances": [
      {
        "party_name": "SD",
        "score": 0.9011627906976745,
        "choice": 9,
        "stance": "SD completely approves the agreement's integration of transparency mechanisms and sustainable fishing quotas, perfectly aligning with SD's commitment to global marine resource governance.  \nSD completely approves the structured financial contributions to Liberia’s fisheries sector, effectively advancing SD’s priority of combating illegal fishing while strengthening local scientific capacity.  \nSD completely approves the protocol’s alignment with Liberia’s national development goals, demonstrating SD’s dedication to ethical partnerships that prioritize post-conflict economic recovery.  \nSD completely approves the emphasis on artisanal fisheries support and food security enhancements, ensuring EU-Liberia cooperation directly benefits local communities as mandated by SD principles.  \nSD completely approves the rigorous compliance with international labor and environmental standards, reinforcing SD’s vision of sustainable development through equitable bilateral agreements."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.4897959183673469,
        "choice": 4,
        "stance": "GUE_NGL partially advocates the agreement but insists on amending Article 5 to mandate consultation with Liberian artisanal fishers, citing parallels to Ireland’s pre-EEC exclusion from fisheries policymaking.  \nGUE_NGL requests revisions to Annex 2, demanding transparent third-party audits of access fee calculations to ensure proportionality between EU vessel quotas and financial contributions.  \nGUE_NGL calls for inserting binding language in Section 7 to allocate 40% of sectoral support directly to coastal communities for surveillance infrastructure protecting small-scale fisheries from industrial competition.  \nGUE_NGL opposes the inclusion of super-trawlers under permitted vessel categories, urging deletion of Clause 3.2(b) to prevent ecosystem damage consistent with their stance against destructive industrial fishing practices.  \nGUE_NGL warns the current text risks replicating Ireland’s post-accession resource depletion and demands Article 9 include safeguards guaranteeing Liberian authorities’ unilateral suspension rights for stock protection."
      }
    ],
    "resolution": "The European Parliament raised its approval for the Sustainable Fisheries Partnership Agreement and Protocol between the EU and Liberia, which establishes a five-year framework for EU vessels to access Liberian waters with a reference tonnage of 6,500 tonnes annually. Financial contributions include access fees set at €357,500 for the first year, €325,000 annually for the second to fourth years, and €292,500 for the fifth year, alongside equivalent annual allocations (€357,500; €325,000; €292,500) to support Liberia’s fisheries sector development. This funding aims to strengthen scientific research, artisanal fisheries, monitoring, control, surveillance, and combat illegal fishing, aligning with Liberia’s national fisheries policy objectives. The resolution emphasizes the agreement’s role in promoting sustainable fishing practices and bilateral cooperation while ensuring compliance with international fisheries governance standards.",
    "total_score": 0.7929515418502202,
    "total_choice": 7,
    "party_num": 2,
    "id": 30,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.3,
      0.7
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "fisheries",
    "title": "EU-Mauritania fisheries partnership agreement: fishing opportunities and financial contribution: RECOMMENDATION on the draft Council decision on the conclusion, on behalf of the European Union, of the Protocol setting out the fishing opportunities and financial contribution provided for in the Fisheries Partnership Agreement between the European Community and the Islamic Republic of Mauritania for a period of four years",
    "background": "The European Union and Mauritania have a longstanding fisheries partnership, with prior agreements governing access to Mauritanian waters under the EU’s Common Fisheries Policy. The Parliament will discuss renewing the four-year protocol defining fishing rights and financial contributions to ensure sustainable resource management.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.905940594059406,
        "choice": 9,
        "stance": "EPP totally sanctions the issue's alignment with sustainable fisheries management, perfectly reflecting EPP's commitment to balancing EU fleet interests with ecological preservation.  \nEPP perfectly aligns with the emphasis on scientific stock assessments, urging accelerated completion of demersal species studies to expand fishing opportunities responsibly.  \nEPP fully supports channeling €16.5 million annually to Mauritanian maritime development, reinforcing EPP's principle that sectoral aid must directly empower local economies.  \nEPP proposes strengthening future protocols by revisiting cephalopod fleet inclusion through enhanced scientific cooperation with Mauritanian authorities.  \nEPP perfectly aligns with the issue's contrast between EU sustainability standards and third-country fleets, endorsing exclusive access for EU vessels to prevent overexploitation by less-regulated operators."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.4489795918367347,
        "choice": 4,
        "stance": "GUE_NGL partially approves the protocol but demands binding amendments to Article 6 ensuring direct consultation with Mauritanian small-scale fishers before implementation.  \nGUE_NGL requests revising the financial annex to cap EU vessel access proportionally to scientific stock assessments, citing Ireland’s historical overfishing precedents.  \nGUE_NGL firmly againsts unrestricted industrial trawling, requiring explicit bans on destructive gear types in coastal zones to protect artisanal fisheries.  \nGUE_NGL rejects current transparency mechanisms as inadequate, insisting on real-time public tracking of sectoral funds to prevent elite capture in Mauritania.  \nGUE_NGL highlights unresolved human rights risks, mandating independent labor inspectors aboard EU vessels under Clause 14(b) to enforce decent working conditions."
      }
    ],
    "resolution": "The European Parliament raised its consent to the conclusion of a four-year Fisheries Partnership Agreement Protocol between the EU and Mauritania, which establishes fishing opportunities for EU vessels and a financial contribution of €55 million annually from the EU, including €16.5 million earmarked for supporting Mauritania’s fisheries and maritime policies. The resolution emphasized sustainable fishing practices, compliance with scientific recommendations to prevent overexploitation, and the need for transparency in sectoral support to ensure funds directly benefit local communities. It also stressed adherence to human rights clauses and labor standards for fisheries workers, while urging enhanced monitoring of bycatch and environmental impacts. The Parliament instructed its President to communicate the decision to relevant EU institutions, member states, and Mauritanian authorities, reflecting commitments to bilateral cooperation, resource conservation, and socio-economic development in the fisheries sector.",
    "total_score": 0.7929515418502202,
    "total_choice": 7,
    "party_num": 2,
    "id": 31,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.2,
      0.8
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "fisheries",
    "title": "EU-Comoros fisheries partnership agreement: denunciation: RECOMMENDATION on the draft Council decision denouncing the Partnership Agreement in the fisheries sector between the European Community and the Union of the Comoros",
    "background": "The EU-Comoros fisheries partnership, established in 1988, faced scrutiny after the Comoros were listed in 2017 as non-cooperating in combating illegal, unreported, and unregulated (IUU) fishing due to inadequate fleet controls, outdated legal frameworks, and flag-of-convenience practices. The Parliament will discuss denouncing the agreement over IUU non-compliance concerns.",
    "stances": [
      {
        "party_name": "ALDE",
        "score": 0.9538461538461539,
        "choice": 9,
        "stance": "ALDE completely accepts the denunciation as a critical demonstration of coherence between EU policy and action, perfectly aligning with their commitment to eradicating illegal fishing through rigorous international standards.  \nALDE perfectly aligns with the issue’s emphasis on terminating agreements with non-compliant states, reinforcing their principle that sustainable fisheries require binding legal accountability from all partners.  \nALDE applauds the decision to prioritize credibility over continuity, viewing the denunciation as essential to incentivize Comoros’ legal reforms and deter other nations from tolerating illicit practices.  \nALDE emphasizes that this unprecedented action advances their manifesto goal of transforming global fisheries governance through conditionality and strict adherence to sustainability benchmarks.  \nALDE asserts that the termination aligns with their vision of EU leadership, where partnerships must actively combat illegal fishing rather than passively enable regulatory failures."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.7551020408163265,
        "choice": 7,
        "stance": "GUE_NGL strongly agrees the denunciation of the EU-Comoros fisheries agreement as a critical step to end exploitative practices, aligning with their commitment to environmental justice and equitable resource sovereignty.  \nGUE_NGL applauds the issue’s prioritization of sustainable fishing, recognizing that terminating this agreement curbs the disproportionate burden placed on Comoros’ fragile marine ecosystems.  \nGUE_NGL proposes that the EU implement safeguards to prevent displaced EU fleets from relocating to waters near Mayotte and Réunion, while rigorously addressing illegal fishing by non-EU actors like Brazilian fleets in French Guiana to ensure policy consistency.  \nGUE_NGL underscores the necessity for future agreements to prioritize Comoros’ developmental needs and ecological resilience, rejecting neocolonial resource extraction models.  \nGUE_NGL affirms that this decision must catalyze broader EU reforms to eliminate double standards in fisheries management, ensuring external actions mirror internal sustainability commitments."
      }
    ],
    "resolution": "The European Parliament raised its consent to the denunciation of the Partnership Agreement in the fisheries sector between the European Union and the Union of the Comoros, based on the legal framework of Article 43 and Article 218(6) of the Treaty on the Functioning of the European Union. This decision followed evaluations by the Committee on Fisheries and the Committee on Development, which assessed the agreement’s alignment with sustainable fishing practices and development cooperation objectives. The resolution emphasized terminating the existing agreement, reflecting concerns over its effectiveness and compliance with broader EU policies. Parliament instructed its President to formally communicate this position to the Council, the Commission, and the governments and parliaments of EU Member States and the Comoros, ensuring procedural closure while prioritizing the need for future agreements to better integrate environmental, economic, and social sustainability.",
    "total_score": 0.8494475138121547,
    "total_choice": 8,
    "party_num": 2,
    "id": 32,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.5,
      0.5
    ],
    "veto_party_name": "ALDE"
  },
  {
    "topic": "fisheries",
    "title": "EU-Comoros fisheries partnership agreement: denunciation (resolution): REPORT containing a motion for a non-legislative resolution on the draft Council decision denouncing the Partnership Agreement in the fisheries sector between the European Community and the Union of the Comoros",
    "background": "The EU-Comoros fisheries partnership agreement, active since 1988, faced termination after the EU designated Comoros as non-cooperating in combating illegal fishing (2017) following unresolved compliance failures since 2015. The Parliament will discuss denouncing the agreement under EU regulations addressing third-country IUU fishing obligations.",
    "stances": [
      {
        "party_name": "SD",
        "score": 0.9130434782608695,
        "choice": 9,
        "stance": "SD fully agrees the issue's emphasis on multilateral cooperation and equitable resource sharing, perfectly aligning with SD's commitment to global marine conservation under SDG 14.  \nSD perfectly aligns with the call for maintaining EU development funds to strengthen Comoros' fisheries governance, transforming past shortcomings into opportunities for enhanced technical capacity-building.  \nSD fully agrees leveraging trade restrictions as pressure for reforms, reflecting SD's principle of linking market access to verifiable sustainability progress in partner states.  \nSD emphasizes the critical need to protect Comoros' unique biodiversity, including coelacanth populations, through intensified EU scientific cooperation—a priority mirrored in the issue’s ecological safeguards.  \nSD underscores the issue’s alignment with SD’s 2030 Agenda framework, particularly its demand for Comoros to fulfill flag-state obligations while ensuring EU accountability for past partnership inefficiencies."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.6938775510204082,
        "choice": 6,
        "stance": "GUE_NGL supports the issue’s recognition of IUU fishing’s devastating impacts but urges amendments to prioritize capacity-building over punitive measures for Comoros’ artisanal fishers.  \nGUE_NGL advises redirecting EU funds from conditional fisheries agreements to direct support for local cooperatives, ensuring resources reach communities most affected by depleted stocks.  \nGUE_NGL calls for binding provisions to prevent EU fleets displaced from Comorian waters from exploiting Mayotte and Réunion’s marine zones, citing ecological risks.  \nGUE_NGL highlights contradictions in the EU’s approach by noting unchecked illegal Brazilian fishing in French Guiana, demanding consistent enforcement of IUU rules globally.  \nGUE_NGL stresses that future agreements must prohibit industrial fleets’ access to territorial waters until coastal states gain full scientific and surveillance capacities."
      }
    ],
    "resolution": "The European Parliament raised concerns over the termination of the EU-Comoros Fisheries Partnership Agreement due to the Comoros' persistent failure to combat illegal, unreported, and unregulated (IUU) fishing, despite being issued a \"red card\" in 2017 for inadequate flag state control and lack of corrective measures. The resolution highlighted that IUU fishing depletes global fish stocks (noting 26 million tonnes caught illegally annually, 15% of global catches), threatens marine ecosystems, undermines coastal communities' livelihoods, and exacerbates poverty in developing countries like the Comoros, where EU financial support (€600,000 annually, half earmarked for sustainable fisheries) failed to yield tangible improvements in monitoring, scientific capacity, or technical training over 30 years of cooperation. Parliament stressed the need for the Comoros to fulfill obligations under international law and the 2030 Agenda’s Sustainable Development Goal 14 (marine conservation), urging continued EU support through development funds to strengthen governance, surveillance, and local fisheries while maintaining pressure via trade restrictions until reforms are implemented. It called for future reengagement if the Comoros addresses IUU deficiencies, emphasizing multilateral cooperation, equitable resource sharing, and alignment of EU policies with global sustainability efforts to protect marine biodiversity and artisanal fishers.",
    "total_score": 0.8273480662983426,
    "total_choice": 8,
    "party_num": 2,
    "id": 33,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.4,
      0.6
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "fisheries",
    "title": "A new CFP: structure for technical measures and multiannual plans: REPORT on a new CFP: structure for technical measures and multiannual plans",
    "background": "The 2013 Common Fisheries Policy reform introduced sustainability objectives, landing obligations, and regionalization, but faced challenges from fragmented technical measures across regulations and institutional tensions over decision-making powers. The Parliament will discuss structuring technical measures and multiannual plans to align with sustainability goals, balancing regional adaptation and regulatory simplification.",
    "stances": [
      {
        "party_name": "SD",
        "score": 0.9112426035502958,
        "choice": 9,
        "stance": "SD completely sanctions the issue’s binding alignment with maximum sustainable yield targets, perfectly aligning with SD’s commitment to science-driven fisheries governance and long-term ecological stability.  \nSD perfectly supports the rejection of Council exemptions exceeding scientific advice, reflecting SD’s unwavering stance against short-term compromises threatening marine ecosystems and coastal livelihoods.  \nSD strongly affirms the issue’s integration of Marine Strategy Framework Directive principles, advancing SD’s vision for legally coherent ocean conservation frameworks.  \nSD unreservedly backs regionalized technical measures developed through Advisory Councils, recognizing this as essential for SD’s stakeholder-driven approach to sustainable fisheries.  \nSD champions the issue’s emphasis on EMFF-funded gear innovation, seeing this as critical to achieving SD’s dual goals of ecological resilience and fishing community viability."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.11363636363636363,
        "choice": 1,
        "stance": "GUE_NGL rejects the centralized decision-making framework under Article 43 TFEU, totally disapproveing with their demand for member state-led proximity management to safeguard fisher livelihoods and coastal communities.  \n\nGUE_NGL opposes the issue’s EU-wide uniformity in technical measures, which fails to address regional fishery diversity and artisanal practices critical to equitable resource conservation.  \n\nGUE_NGL criticizes the issue’s reliance on top-down multiannual plans, inconsistent with their principle that socio-economic stability requires direct stakeholder co-management through Member States.  \n\nGUE_NGL totally disapproves with the issue’s marginalization of regional governance, overlooking the necessity of localized adaptation to ensure both ecological sustainability and public fish supply.  \n\nGUE_NGL rejects the issue’s limited scope for Advisory Councils, which fails to guarantee meaningful sector involvement in aligning conservation with community development goals."
      }
    ],
    "resolution": "The European Parliament raised concerns about the implementation of the Common Fisheries Policy (CFP), emphasizing the need to restore fish stocks above maximum sustainable yield (MSY) through ecosystem-based approaches, technical measures, and multiannual plans. It highlighted challenges since 2009, including institutional tensions over decision-making powers under Article 43 TFEU and legislative delays, particularly regarding technical measures (e.g., driftnets, cetacean bycatches) and multiannual plans blocked for over three years. The resolution stressed the importance of simplifying and regionalizing technical measures to adapt to specific fisheries and basins, improve selectivity, minimize discards, and involve stakeholders via Advisory Councils, while ensuring alignment with CFP objectives and the Marine Strategy Framework Directive. It called for a clear EU-wide framework regulation to unify fragmented rules, repeal outdated regulations (e.g., Council Regulations 850/98 and 1967/2006), and promote innovation in selective gear, supported by the European Maritime and Fisheries Fund (EMFF). The Parliament advocated for multiannual plans based on scientific and socio-economic data, incorporating MSY targets, precautionary safeguards, and review clauses, while limiting delegated acts on discard plans to three years. It underscored the landing obligation’s impact, urging flexibility in mesh sizes, catch composition rules, and gear diversity, and emphasized combating illegal fishing (IUU), particularly in the Mediterranean, through stricter enforcement. The resolution reaffirmed the ordinary legislative procedure for basin-wide rules and delegated acts for regional measures, retaining Parliament’s right to object, and stressed harmonizing marketing standards with conservation goals to ensure market integrity.",
    "total_score": 0.7817638266068759,
    "total_choice": 7,
    "party_num": 2,
    "id": 34,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.1,
      0.9
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "fisheries",
    "title": "Community Fisheries Control Agency: REPORT on the proposal for a regulation of the European Parliament and of the Council amending Council Regulation (EC) No 768/2005 establishing a Community Fisheries Control Agency",
    "background": "Heightened Mediterranean migration flows and fragmented national coastguard authorities underscored challenges in maritime security, fisheries control, and border management. The Parliament will discuss amending the 2005 Community Fisheries Control Agency regulation to enhance EU agency cooperation in surveillance, information-sharing, and operational coordination across maritime sectors.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9609756097560975,
        "choice": 9,
        "stance": "EPP entirely accepts the issue's establishment of cross-agency cooperation frameworks, perfectly aligning with its commitment to integrated maritime security and crisis management.  \nEPP perfectly aligns with the emphasis on advanced data-sharing systems, recognizing this as critical for preventing overlaps and strengthening Schengen-area border integrity.  \nEPP entirely accepts maintaining strict adherence to agency competencies, ensuring member states' sovereign rights as coastal nations remain inviolable under the proposal.  \nEPP highlights the issue's capacity-sharing mechanisms as effectively advancing its priority of resource-efficient, multi-dimensional operations against human trafficking and maritime emergencies.  \nEPP fully supports the technology-driven surveillance mandate, which aligns perfectly with its longstanding advocacy for modernized EU-wide crisis response infrastructure."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.061224489795918366,
        "choice": 0,
        "stance": "GUE_NGL rejects fundamentally the integration of fisheries control resources into border surveillance frameworks, as this entrenches repressive migration policies contrary to human rights principles.  \nGUE_NGL opposes the creation of supranational coast guard structures that usurp member states' sovereignty over territorial waters, directly conflicting with their defense of national jurisdiction.  \nGUE_NGL condemns the accelerated procedural manipulation used to advance this issue, which systematically excluded amendments safeguarding democratic oversight and migrant protections.  \nGUE_NGL denounces the exploitation of migration flows to militarize EU agencies, a securitization agenda irreconcilable with their anti-Fortress Europe stance.  \nGUE_NGL asserts that merging EMSA and fisheries control with Frontex consolidates a security-industrial complex antithetical to social justice and ecological stewardship priorities."
      }
    ],
    "resolution": "The European Parliament raised the adoption of its position on a Commission proposal aimed at enhancing maritime safety, security, and cooperation through integrated surveillance systems. The resolution emphasized the need for EU agencies and member states to share information and establish advanced technology-driven surveillance and communication services to improve cross-sectoral operations. It prioritized capacity-building at both EU and national levels to address challenges in maritime safety, security, search and rescue, fisheries control, and border control. Additionally, the resolution advocated for capacity-sharing initiatives, including cross-border and cross-sectoral asset sharing, to enable coordinated, multi-dimensional maritime operations. Parliament also instructed its President to communicate its position to the Council, Commission, and national parliaments, while urging the Commission to re-engage Parliament if substantial amendments to the proposal are planned.",
    "total_score": 0.7674418604651163,
    "total_choice": 7,
    "party_num": 2,
    "id": 35,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.8,
      0.2
    ],
    "veto_party_name": "GUE_NGL"
  },
  {
    "topic": "fisheries",
    "title": "Conformity of fisheries products with access criteria to the EU market: REPORT on the implementation of control measures for establishing the conformity of fisheries products with access criteria to the EU market",
    "background": "The European Union, as the world’s largest importer of fisheries products, faces challenges in ensuring third-country imports meet its environmental, labor, and safety standards due to uneven ratification of international conventions by member states and varying compliance levels. The Parliament will discuss aligning market access criteria for imported fisheries products with EU regulations to address competitive disparities and promote global sustainability.",
    "stances": [
      {
        "party_name": "SD",
        "score": 0.9354838709677419,
        "choice": 9,
        "stance": "SD firmly sanctions the issue’s emphasis on equitable market access for ultraperipheral regions, perfectly aligning with SD’s commitment to territorial cohesion and fair competition in fisheries value chains.  \nSD perfectly aligns with calls to restore dedicated financial instruments like POSEI pescas, recognizing their critical role in enabling sustainable commercial fishing in geographically disadvantaged areas.  \nSD fully supports the issue’s demand for strict parity between EU and third-country product standards, particularly in enhancing traceability labeling and binding trade clauses to eliminate unfair advantages from lax labor or environmental practices.  \nSD strongly endorses harmonized enforcement of IUU Regulation controls across supply chains, emphasizing the need to prioritize EFCA’s operational capacity for uniform inspections as a cornerstone of market integrity.  \nSD applauds the focus on small-scale fisheries’ viability through producer organizations and reduced intermediation, which directly advances SD’s agenda for equitable remuneration and localized value chains."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.22916666666666666,
        "choice": 2,
        "stance": "GUE_NGL rejects the issue's failure to mandate binding EU-wide price controls on first-sale fisheries products, firmly conflicting with their demand for equitable income redistribution to small-scale fishers.  \n\nGUE_NGL opposes the inadequate measures against intermediary dominance in supply chains, overlooking critical aspects such as capping profit margins for wholesalers as outlined in their 2023 Coastal Communities Manifesto.  \n\nThe proposal firmly conflicts with GUE_NGL's principle of public financing guarantees for artisanal fleets, lacking enforceable mechanisms to stabilize fishermen’s incomes amid volatile import competition.  \n\nGUE_NGL condemns the issue’s prioritization of third-country import standards while neglecting structural EU market reforms, inconsistent with their focus on dismantling neoliberal trade distortions in coastal economies."
      }
    ],
    "resolution": "The European Parliament raised concerns over disparities in labor, safety, and sustainability standards between EU and third-country fisheries products, noting that 25 Member States ratified the Maritime Labour Convention for seafarers, while only 3 ratified ILO Convention 188 for fishers, with gaps in enforcement and exclusion of self-employed fishers. Vessel safety standards under the Cape Town Agreement (ratified by 11 MS) apply only to vessels over 24m, and training conventions like STCW-F for fishers (6 MS) remain unincorporated into EU law, urging the Commission to prioritize TFEU Article 155 procedures. Highlighting the EU’s role as the world’s largest fisheries market (absorbing 24% of global imports in 2016, with 60% dependency on imports), the resolution stressed the need for imported products to meet EU environmental, labor, and sanitary standards to ensure fair competition and sustainability. It criticized lax import controls, particularly under the IUU Regulation, and called for stricter harmonized enforcement across supply chains, enhanced third-country inspections, and binding trade agreement clauses requiring ratification of key international instruments (e.g., UN Fish Stocks Agreement, FAO Port State Measures). The resolution urged improved labeling for traceability, including vessel flag states, and stricter due diligence requirements akin to timber and conflict minerals. It emphasized reinforcing the European Fisheries Control Agency (EFCA) to ensure uniform inspections, data transparency, and sanctions, while opposing any weakening of the IUU Regulation. The Parliament also highlighted incoherence between trade and fisheries policies, advocating exclusion of non-compliant third countries from market access and post-Brexit reciprocity linking UK market access to CFP compliance.",
    "total_score": 0.7961696306429549,
    "total_choice": 7,
    "party_num": 2,
    "id": 36,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.9,
      0.1
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "fisheries",
    "title": "Conservation of fishery resources and protection of marine ecosystems through technical measures: REPORT on the proposal for a regulation of the European Parliament and of the Council on the conservation of fishery resources and the protection of marine ecosystems through technical measures, amending Council Regulations (EC) No 1967/2006, (EC) No 1098/2007, (EC) No 1224/2009 and Regulations (EU) No 1343/2011 and (EU) No 1380/2013 of the European Parliament and of the Council, and repealing Council Regulations (EC) No 894/97, (EC) No 850/98, (EC) No 2549/2000, (EC) No 254/2002, (EC) No 812/2004 and (EC) No 2187/2005",
    "background": "The European Union's technical measures regulating fishing methods, established through multiple overlapping regulations since 1998, faced criticism for complexity and insufficient alignment with post-2013 Common Fisheries Policy sustainability goals. The Parliament will discuss consolidating and modernizing these rules to improve marine ecosystem protection while addressing regional fishing sector operational realities.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.8028846153846154,
        "choice": 8,
        "stance": "EPP strongly sanctions the regionalization framework for gear specifications and closed areas, aligning perfectly with EPP's longstanding commitment to adaptive fisheries management that respects ecological and economic diversity across sea basins.  \nEPP approves the provisional 5% fleet limit for experimental pulse fishing in the North Sea, proposing enhanced scientific oversight through mandated EU institute collaboration to address ecological concerns while preserving innovation pathways.  \nEPP advocates strict enforcement mechanisms for juvenile fish protection thresholds, converting opposition to non-selective methods into a call for real-time bycatch monitoring systems under Article 4(2).  \nEPP emphasizes safeguarding artisanal fisheries through Adriatic-specific net-depth exemptions, effectively advancing EPP's priority of balancing employment stability with seabed preservation as per Croatia’s case-study amendments.  \n EPP acknowledges divergent views on pulse fishing but consolidates support for the rapporteur’s compromise, urging the Council to adopt Article 9’s four-year review clause to reassess environmental impacts."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.04081632653061224,
        "choice": 0,
        "stance": "GUE/NGL rejects the proposal's failure to institute an immediate ban on electric pulse fishing, which contradicts our mandate to prevent irreversible marine ecosystem damage as evidenced by vertebral fractures and hemorrhaging in cod.  \nGUE/NGL opposes fundamentally the continued subsidization of industrial bottom-trawling fleets through loopholes in amended Regulation (EU) No 1380/2013, enabling the \"race to the seabed\" denounced in Article 4's gear specifications.  \nGUE/NGL condemns the issue's omission of binding measures against static/drift nets causing cetacean bycatch, directly conflicting with our amendments to prohibit such gear under Chapter III's closed-area provisions.  \nGUE/NGL disputes the regionalization framework as centralization masquerading as reform, disproportionately burdening small-scale fisheries (addressed only superficially in Recital 9) while privileging northern industrial interests.  \nGUE/NGL declares the proposal inconsistent with maximum sustainable yield objectives by permitting juvenile fish mortality through unrevised mesh-size rules in Article 2(7), undermining the 2020 deadline."
      }
    ],
    "resolution": "The European Parliament raised its position at first reading, adopting the resolution that underscores the need for sustainable fisheries management and aligns with the Commission’s 2016 proposal (COM(2016)0134) to revise technical measures for conservation and ecosystem protection. It emphasizes reducing bycatch, safeguarding juvenile fish, and minimizing environmental impacts through gear specifications, closed areas, and seasonal closures, while ensuring flexibility for regional adaptations. The resolution stresses adherence to the Common Fisheries Policy’s objectives, including achieving maximum sustainable yield by 2020, and calls for enhanced data collection and stakeholder collaboration. It urges the Commission to resubmit the proposal if substantially amended and instructs the Parliament’s President to forward its position to the Council, Commission, and national parliaments, ensuring coherence with EU environmental and health policies.",
    "total_score": 0.5518207282913166,
    "total_choice": 5,
    "party_num": 2,
    "id": 37,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.3,
      0.7
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "fisheries",
    "title": "Establishing a multi-annual plan for the fisheries exploiting demersal stocks in the western Mediterranean Sea: REPORT on the proposal for a regulation of the European Parliament and of the Council establishing a multi-annual plan for the fisheries exploiting demersal stocks in the western Mediterranean Sea",
    "background": "Demersal fish stocks in the western Mediterranean face overexploitation, with scientific assessments indicating unsustainable fishing levels. The 2016 MedFish4Ever Declaration prioritized regional fisheries sustainability, prompting the European Commission’s 2018 proposal for a management framework aligning with Common Fisheries Policy objectives. The Parliament will discuss establishing a multi-annual plan to regulate demersal fisheries in the western Mediterranean.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.7813953488372093,
        "choice": 7,
        "stance": "EPP strongly advocates the multi-annual plan's alignment with sustainability goals while proposing enhanced regional flexibility in trawl restriction implementation.  \nEPP recommends adjusting the three-month trawl closure period based on localized scientific assessments to address sector-specific operational realities.  \nEPP emphasizes the need for compensatory measures for auxiliary industries affected by effort reductions, ensuring socioeconomic cohesion in coastal communities.  \nEPP applauds the inclusion of co-management frameworks as consistent with its principles of subsidiarity and stakeholder collaboration."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.038461538461538464,
        "choice": 0,
        "stance": "  \nGREEN_EFA rejects fundamentally the delayed MSY targets as incompatible with scientific urgency to halt 4-5× overfishing of demersal stocks.  \nGREEN_EFA opposes the five-year sustainability postponement, violating their 2018 manifesto requirement for immediate ecosystem-based catch limits.  \nGREEN_EFA highlights the plan's failure to mandate spatial closures or binding fleet reduction, contradicting Verts/ALE amendments on effort management.  \nGREEN_EFA condemns reliance on voluntary co-management without EU compensation mechanisms for Catalonia-style transition programs.  \nGREEN_EFA deems the \"weak starting point\" approach inconsistent with precautionary principle obligations under Mediterranean RFMO agreements."
      }
    ],
    "resolution": "The European Parliament raised its position at first reading on the Commission’s 2018 proposal (COM(2018)0115), informed by the Committee on Fisheries’ report and the Environment, Public Health and Food Safety Committee’s amendments (A8-0005/2019), alongside the European Economic and Social Committee’s July 2018 opinion. It called on the Commission to resubmit the proposal if substantial changes are made and instructed its President to forward the adopted position to the Council, Commission, and national parliaments.",
    "total_score": 0.5570652173913043,
    "total_choice": 5,
    "party_num": 2,
    "id": 38,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.6,
      0.4
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "fisheries",
    "title": "European Maritime and Fisheries Fund: REPORT on the proposal for a regulation of the European Parliament and of the Council on the European Maritime and Fisheries Fund and repealing Regulation (EU) No 508/2014 of the European Parliament and of the Council",
    "background": "The European Maritime and Fisheries Fund (2014-2020) faced implementation challenges, including sustainable fisheries management under the Common Fisheries Policy, fleet capacity constraints, and post-Brexit resource allocation uncertainties. The Commission proposed a €6.14 billion EMFF renewal (2021-2027) within the Multiannual Financial Framework. The Parliament will discuss the fund’s budgetary priorities, operational reforms, and alignment with EU sustainability goals.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.15384615384615385,
        "choice": 1,
        "stance": "GREEN_EFA rejects the proposed EMFF regulation for maintaining provisions that permit increased fishing capacity despite documented overexploitation of 80% Mediterranean stocks, completely opposeing with ecosystem protection mandates.  \nGREEN_EFA opposes the 10% budget allocation for environmental monitoring as structurally inadequate compared to their demanded 25% minimum for meaningful biodiversity conservation.  \nThe proposal's failure to prohibit fleet modernization subsidies in overfished regions directly violates GREEN_EFA's principle of science-based fisheries management.  \nGREEN_EFA condemns the issue's implicit acceptance of delayed CFP sustainability objectives as inconsistent with six years of documented policy failures.  \nThe absence of binding mechanisms to phase out destructive fishing practices contradicts GREEN_EFA's core commitment to marine ecosystem restoration."
      },
      {
        "party_name": "ALDE",
        "score": 0.8970588235294118,
        "choice": 8,
        "stance": "ALDE strongly accepts the issue's emphasis on sustainable fisheries management and environmental protection, aligning perfectly with their commitment to EU sustainability goals and integrated marine policies.  \nALDE approves the prioritization of equitable regional development through targeted budgetary allocations, particularly for vulnerable coastal communities and ultra-peripheral regions like the Canary Islands.  \nALDE proposes enhancing funding criteria to ensure structural support reaches regions requiring transition to sustainable practices, rather than islands with established sustainability frameworks.  \nALDE endorses modernizing fishing fleets through decarbonization and innovation investments that reduce discards and improve safety, provided capacity limits are strictly maintained.  \nALDE emphasizes the critical need to integrate maritime ecosystem health into funding decisions, reinforcing their principle that ocean protection underpins long-term fishing viability."
      }
    ],
    "resolution": "The European Parliament raised its position on the Commission’s 2018 proposal (COM(2018)0390) concerning fisheries, environmental, budgetary, and regional policies, emphasizing alignment with EU treaties and sustainable development goals. It adopted amendments to strengthen measures for sustainable fisheries management, environmental protection, and equitable regional development, while ensuring coherence with existing EU legislation. The resolution underscored the need for robust budgetary allocations to support these objectives, particularly in vulnerable regions, and called for enhanced cooperation between member states and EU institutions. Parliament urged the Commission to prioritize transparency and stakeholder consultation, particularly with the Committee on Fisheries and other relevant committees, and to integrate recommendations from the Committee of the Regions and the European Economic and Social Committee. It insisted that any substantial revision or replacement of the proposal by the Commission must be resubmitted to Parliament for further scrutiny, ensuring legislative continuity and democratic accountability. The resolution also mandated the Parliament’s President to formally communicate its position to the Council, Commission, and national parliaments, reinforcing interinstitutional dialogue.",
    "total_score": 0.6630727762803235,
    "total_choice": 6,
    "party_num": 2,
    "id": 39,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.5,
      0.5
    ],
    "veto_party_name": "ALDE"
  },
  {
    "topic": "fisheries",
    "title": "Optimisation of the value chain in the EU fishing sector: REPORT on the optimisation of the value chain in the EU fishing sector",
    "background": "The EU fishing sector faces challenges including fluctuating resource availability, rising operational costs, competition from third-country imports, and structural disparities affecting coastal communities. Regulatory frameworks aim to balance market stability, sustainability, and socio-economic equity. The Parliament will discuss optimizing the fisheries value chain to enhance sector resilience, market fairness, and equitable benefits for stakeholders.",
    "stances": [
      {
        "party_name": "ECR",
        "score": 0.8309859154929577,
        "choice": 8,
        "stance": "ECR strongly approves the issue's emphasis on equal import standards, aligning perfectly with ECR's commitment to fair competition and protecting EU fisheries from third-country market distortions.  \nECR approves enhanced labeling rules to disclose vessel flags and origin, proposing to expand mandatory coverage beyond current limited product categories as a market transparency enhancement.  \nECR endorses reducing bureaucratic burdens for producer organizations, noting this directly advances their priority of empowering coastal communities through streamlined local fish distribution.  \nECR highlights the need to balance Adriatic small pelagic quotas with ecosystem-based management, suggesting the Commission collaborate with national bodies to avoid destabilizing Croatia’s processing chain.  \nECR applauds gender-inclusive policies and youth training programs as critical to sectoral resilience, mirroring their 2023 manifesto on revitalizing maritime economies through workforce investment."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.9375,
        "choice": 9,
        "stance": "GUE_NGL totally upholds the issue's prioritization of equitable value distribution through binding mechanisms to reduce intermediary margins, perfectly aligning with their advocacy for worker-centric economic models in coastal communities.  \nGUE_NGL perfectly aligns with the demand to enforce Article 17 of Regulation 1380/2013, ensuring small-scale fishers’ preferential access to quotas as a cornerstone of regional food sovereignty and social justice.  \nGUE_NGL emphasizes the critical need to overhaul first-sale price formation systems, directly echoing the issue’s call to rebalance power asymmetries between producers and distributors through legally enforced margin caps.  \nGUE_NGL applauds the issue’s focus on gender-inclusive policies and digital upskilling programs, recognizing these as essential steps to democratize sectoral participation and modernize traditional fishing economies.  \nGUE_NGL underscores the urgency of revising FAO fishing zone designations in labeling rules, a measure that aligns with their decades-long campaign for supply chain transparency and anti-neocolonial trade practices."
      }
    ],
    "resolution": "The European Parliament raised concerns about significant challenges facing the EU fishing sector, including rising fuel costs, unfair quota allocations, competition from third-country imports, and inadequate first-sale prices disproportionately affecting small-scale and artisanal fisheries, which constitute 83% of EU fishing vessels and 47% of sectoral employment. It emphasized the need to address structural inequalities, particularly in outermost regions (ORs) facing remoteness and economic vulnerability, and highlighted the undervalued role of women in the sector. Key resolutions included enforcing preferential access for small-scale fleets under Regulation 1380/2013, reducing bureaucratic hurdles for producer organizations (POs), and revising labeling rules to mandate precise origin information for both fresh and processed products, including updating outdated FAO fishing area designations. The Parliament advocated for fairer value distribution along the supply chain, noting producers receive only 10% of margins, and urged measures like setting maximum operating margins for intermediaries. It called for increased financial support for ORs’ fish transport costs, gender-inclusive policies, youth training programs, and digital skills development. Additional measures included stricter monitoring of imported products’ compliance with EU standards, promoting local consumption through public sector partnerships, and creating a dedicated logo for small-scale fisheries. The resolution also stressed the importance of integrating fisheries into broader EU funding programs, combating unfair trade practices, and fostering innovation to reduce by-catches and enhance sector resilience.",
    "total_score": 0.8191780821917808,
    "total_choice": 8,
    "party_num": 2,
    "id": 40,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.3,
      0.7
    ],
    "veto_party_name": "GUE_NGL"
  },
  {
    "topic": "fisheries",
    "title": "How to make fisheries controls in Europe uniform: REPORT How to make fisheries controls in Europe uniform",
    "background": "Disparities in EU Member States' fisheries controls, including divergent legal frameworks, inspection procedures, sanctions, and resource allocation, created perceived inequities among fishermen and hindered consistent enforcement of sustainable practices under the Common Fisheries Policy. The Parliament will discuss harmonizing fisheries controls to ensure uniform implementation and equitable enforcement across the EU.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9420289855072463,
        "choice": 9,
        "stance": "EPP totally sanctions the issue's emphasis on harmonizing inspection protocols and sanctions, which perfectly aligns with EPP's commitment to equitable enforcement of the Common Fisheries Policy.  \nEPP perfectly aligns with the call to strengthen EFCA through standardized inspector training, advancing EPP's priority of ensuring uniform compliance mechanisms across all maritime zones.  \nEPP totally sanctions leveraging EMFF funds for electronic monitoring technologies, effectively advancing sustainable resource management as core to EPP's environmental agenda.  \nEPP perfectly aligns with promoting economic penalties over criminal sanctions, resonating with EPP's principle of fostering cooperative compliance within fishing communities.  \nEPP totally sanctions enhanced import controls and traceability measures, which directly support EPP's longstanding objectives to combat IUU fishing and protect legal operators."
      },
      {
        "party_name": "ECR",
        "score": 0.8181818181818182,
        "choice": 8,
        "stance": "ECR strongly sanctions the harmonization of fisheries controls to ensure equitable competition and sustainable resource management, aligning with the issue’s emphasis on standardized enforcement and EFCA strengthening.  \nECR applauds the issue’s focus on modernizing control technologies via EMFF funding, which directly advances their commitment to bolstering the blue economy and fisheries-dependent communities.  \nECR proposes augmenting EMFF support for regions disproportionately impacted by fiscal austerity measures to alleviate economic pressures on small-scale fishermen while maintaining control harmonization goals.  \nECR endorses simplified legislation and reduced administrative burdens as critical to addressing sectoral perceptions of over-regulation, echoing the issue’s call for risk-based, practical enforcement frameworks.  \nECR emphasizes the necessity of equitable rule application across all maritime zones, including outermost regions, to safeguard vulnerable coastal communities and uphold sustainable fishing practices as outlined in the issue."
      }
    ],
    "resolution": "The European Parliament raised concerns about disparities in the implementation of fisheries controls across Member States, emphasizing the need for harmonized, non-discriminatory enforcement of the Common Fisheries Policy (CFP) to ensure sustainable resource management and a level playing field. It highlighted operational challenges, including inconsistent inspection protocols, divergent sanctions for infringements, and gaps in monitoring foreign vessels and imported fishery products, particularly from illegal, unreported, and unregulated (IUU) fishing. The resolution stressed the importance of strengthening the European Fisheries Control Agency (EFCA) through increased resources, standardized training for inspectors via a core curriculum, and enhanced cooperation between Member States, including data sharing and joint inspections. It called for leveraging the European Maritime and Fisheries Fund (EMFF)—noting its €580 million allocation for 2014–2020—to modernize control technologies, such as electronic logbooks and remote tracking systems, while opposing mandatory onboard video surveillance. The Parliament urged addressing inequities in the landing obligation, advocating flexibility for multi-species fisheries and extending the two-year adaptation period for compliance. It emphasized harmonizing sanctions, promoting economic penalties over criminal ones, and ensuring transparency in enforcement to build trust. Additional measures included stricter import controls, mandatory traceability in restaurants, and expanded EFCA authority to oversee overexploited fisheries. The resolution underscored the need for simplified, enforceable regulations, risk-based inspections, and equitable application of rules across all maritime zones, including outermost regions, to safeguard fisheries-dependent communities and promote sustainable practices.",
    "total_score": 0.7906976744186046,
    "total_choice": 7,
    "party_num": 2,
    "id": 41,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.6,
      0.4
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "fisheries",
    "title": "External dimension of the CFP, including fisheries agreements: REPORT on common rules in respect of application of the external dimension of the CFP, including fisheries agreements",
    "background": "The EU's global fisheries activities, governed by bilateral agreements and regional management bodies, operate within international frameworks like UNCLOS and FAO guidelines, amid concerns over sustainable resource use, development impacts, and equitable access. The Parliament will discuss aligning external fisheries policy with environmental sustainability, development cooperation, and international governance standards.",
    "stances": [
      {
        "party_name": "ALDE",
        "score": 0.8333333333333334,
        "choice": 8,
        "stance": "ALDE strongly approves the issue’s emphasis on transparency in Sustainable Fisheries Partnership Agreements, particularly the public disclosure of access terms, which aligns perfectly with ALDE’s longstanding commitment to accountable international fisheries governance.  \n\nALDE applauds the rigorous enforcement measures against IUU fishing through strengthened EU regulations, effectively advancing their priority of maintaining Europe’s global leadership in sustainable and legally compliant fishing practices.  \n\nALDE endorses the harmonization of fishing conditions in African waters to ensure fair competition, proposing to amend Clause 7(b) to explicitly require exhaustion of diplomatic solutions before withdrawing from agreements, thereby preventing exploitation by lower-standard fleets.  \n\nALDE strongly approves the issue’s recognition of regional fisheries management organizations as critical frameworks, urging accelerated funding allocations to expand their scientific monitoring capacities in line with ALDE’s advocacy for multilateral cooperation.  \n\nALDE approves the focus on gender equality and small-scale fisheries development, emphasizing the need to integrate these priorities into all SFPA implementation protocols to align with their principles of inclusive economic growth."
      },
      {
        "party_name": "SD",
        "score": 0.9593023255813954,
        "choice": 9,
        "stance": "SD absolutely upholds the issue's call for a unified international vessel registry, perfectly aligning with SD's commitment to eradicate flag-state manipulation and strengthen accountability in global fisheries governance.  \nSD perfectly supports the issue's emphasis on SFPA transparency measures, recognizing their critical role in advancing SD's principles of equitable resource distribution and anti-corruption in maritime partnerships.  \nSD highlights the opportunity to further integrate explicit biodiversity safeguards into CFP implementation, building upon the issue's environmental sustainability framework to holistically address marine ecosystem pressures.  \nSD strongly applauds the binding IUU fishing enforcement provisions as a direct manifestation of SD's decade-long advocacy for harmonized global standards against fisheries exploitation.  \nSD absolutely upholds the gender equality and small-scale fisheries support clauses, seeing these as essential to fulfilling SD's vision of socially inclusive and economically resilient coastal communities."
      }
    ],
    "resolution": "The European Parliament raised the importance of integrating environmental, social, and economic sustainability into the external dimension of the Common Fisheries Policy (CFP), emphasizing the EU’s role as a global leader in fisheries governance. It stressed the need to maintain fish stocks above levels capable of producing maximum sustainable yield (MSY) by 2020, aligning with FAO guidelines, and highlighted the EU’s responsibility to ensure equitable access for developing coastal states to adjacent fisheries resources through regional fisheries management organizations (RFMOs). The resolution called for enhanced transparency in Sustainable Fisheries Partnership Agreements (SFPAs), including public disclosure of access terms and catches, and urged harmonizing conditions for foreign fleets in African waters to promote fair competition. It underscored the EU’s role in combating illegal, unreported, and unregulated (IUU) fishing through rigorous enforcement of the IUU Regulation and advocated for improved scientific data collection, particularly in developing countries, to assess surplus stocks. The Parliament emphasized support for small-scale fisheries, gender equality in the sector, and sectoral aid to partner countries for infrastructure, scientific capacity, and food security, while ensuring policy coherence with development goals. It criticized private agreements between EU shipowners and third countries that bypass CFP standards, urging regulatory frameworks for joint ventures to prevent unfair competition with local artisanal fleets. The resolution also highlighted the EU’s market influence, noting it consumes 11% of global fish production by volume and imports 24% by value, and called for trade agreements to enforce sustainability and labor standards. Finally, it advocated for regional management of shared stocks, expanded marine protected areas, and increased funding for RFMOs to strengthen global fisheries governance.",
    "total_score": 0.8667642752562226,
    "total_choice": 8,
    "party_num": 2,
    "id": 42,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.3,
      0.7
    ],
    "veto_party_name": "ALDE"
  },
  {
    "topic": "fisheries",
    "title": "Fisheries Partnership Agreement between Côte d’Ivoire and the EU (2018-2024): RECOMMENDATION on the draft Council decision on the conclusion of the Protocol on the implementation of the Fisheries Partnership Agreement between the European Union and the Republic of Côte d’Ivoire (2018-2024)",
    "background": "The EU and Côte d’Ivoire have maintained a fisheries partnership since 1990, enabling EU vessel access to Ivorian waters under agreed terms. Renewal discussions arise amid regional efforts to balance resource sustainability, combat illegal fishing, and align with Côte d’Ivoire’s fisheries policy priorities. The Parliament will discuss renewing the bilateral fisheries protocol.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.5961538461538461,
        "choice": 5,
        "stance": "GREEN_EFA supports the inclusion of sectoral support for women's cooperatives but advises amending Article 4 to prioritize direct access over intermediary-controlled distribution channels.  \nGREEN_EFA advises specifying concrete allocation clauses for the 10,000 tonnes of bycatch tuna to ensure coastal communities receive price-controlled quotas before export-oriented processors.  \nGREEN_EFA highlights concerns about industrial vessel competition limiting artisanal fishing grounds, urging enhanced monitoring provisions in Annex II.  \nGREEN_EFA endorses the sustainability framework but proposes earmarking 30% of sectoral funds for gender-responsive value chain development in inland fisheries.  \nGREEN_EFA stresses the need for quarterly audits of catch documentation systems to prevent market distortions harming small-scale processors.  "
      },
      {
        "party_name": "ALDE",
        "score": 0.835820895522388,
        "choice": 8,
        "stance": "ALDE strongly accepts the Fisheries Partnership Agreement's alignment with sustainable resource management, perfectly reflecting their commitment to global environmental standards and responsible fishing practices.  \nALDE approves the sectoral support allocation for Côte d’Ivoire’s fisheries policy, effectively advancing their priority of bolstering local economic development and modernizing critical infrastructure like the port of Abidjan.  \nALDE commends the protocol’s focus on scientific research and marine protected areas, which aligns with their longstanding advocacy for data-driven conservation and ecosystem preservation.  \nALDE applauds the reinforced measures against illegal fishing, underscoring their dedication to transparency and regulatory compliance in international maritime cooperation.  \nALDE proposes amplifying support for women-led artisanal fisheries through targeted funding for professional organizations, ensuring gender equity remains central to the agreement’s sustainability goals."
      }
    ],
    "resolution": "The European Parliament raised its consent to the conclusion of the Fisheries Partnership Agreement protocol between the EU and Côte d’Ivoire (2018-2024), which establishes a reference tonnage of 5,500 tonnes for EU vessels, with annual access fees set at €330,000 for the first two years and €275,000 for the remaining four years. It also approved sectoral support for Côte d’Ivoire’s fisheries policy, allocating €352,000 annually for the first two years and €407,000 annually for the subsequent four years, aimed at enhancing sustainable management of maritime and inland fisheries resources in line with the country’s national policy objectives. The resolution emphasized the protocol’s alignment with sustainable resource management and development priorities, without detailing procedural aspects of its adoption.",
    "total_score": 0.6698369565217391,
    "total_choice": 6,
    "party_num": 2,
    "id": 43,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.8,
      0.2
    ],
    "veto_party_name": "ALDE"
  },
  {
    "topic": "fisheries",
    "title": "Fisheries Partnership Agreement between Côte d’Ivoire and the EU (2018-2024) (resolution): REPORT containing a motion for a non-legislative resolution on the draft Council decision on the conclusion of the Protocol on the implementation of the Fisheries Partnership Agreement between the European Union and the Republic of Côte d’Ivoire (2018-2024)",
    "background": "The EU and Côte d’Ivoire have maintained fisheries agreements since 1990, with the 2013-2018 protocol achieving 79% fishing uptake but limited longliner activity. EU development funds and prior sectoral support aimed to strengthen Ivorian fisheries governance, port infrastructure, and artisanal fishing livelihoods. The Parliament will discuss renewing the 2018-2024 protocol to address sustainable resource management, economic cooperation, and local development priorities.",
    "stances": [
      {
        "party_name": "ALDE",
        "score": 0.8805970149253731,
        "choice": 8,
        "stance": "ALDE strongly advocates the issue as it aligns perfectly with ALDE's commitment to extending EU environmental and social standards through equitable international partnerships, ensuring sustainable fisheries and coastal community development.  \nALDE approves the integration of scientific evaluations and protected marine areas, which effectively advances ALDE's priority of data-driven resource management and regional cooperation against illegal fishing.  \nALDE applauds the targeted support for women in artisanal fishing sectors, reinforcing ALDE's longstanding advocacy for gender-inclusive economic growth and grassroots organizational empowerment.  \nALDE highlights the agreement’s balance between EU fleet access and sovereignty safeguards for Côte d’Ivoire’s nutritional needs, reflecting ALDE’s principles of fair global trade anchored in sustainability.  \nALDE proposes strengthening transparency by mandating biannual public audits of sectoral support funds to complement existing reporting frameworks without opposing the issue’s core objectives."
      },
      {
        "party_name": "ECR",
        "score": 0.7323943661971831,
        "choice": 7,
        "stance": "ECR strongly accepts the issue's foundation in scientific resource management and sustainable fishing limits, which aligns perfectly with ECR's longstanding commitment to marine biodiversity preservation and ecosystem-based governance.  \nECR approves the reinforced measures against illegal fishing and by-catch mitigation, particularly safeguards for dolphins near tuna stocks, effectively advancing ECR's priority of science-driven conservation.  \nECR emphasizes the necessity of transparent fund allocation to artisanal fisheries and women-led processing initiatives, urging enhanced public reporting mechanisms to ensure local communities directly benefit from sectoral support.  \nECR proposes strengthening the protocol’s training provisions by mandating quarterly progress updates on seafarer capacity-building programs, ensuring alignment with Ivorian workforce development goals.  \nECR highlights the critical role of regional cooperation in harmonizing tuna stock management, urging accelerated data-sharing frameworks to complement the issue’s sustainability objectives."
      }
    ],
    "resolution": "The European Parliament raised the adoption of a six-year Sustainable Fisheries Partnership Agreement (SFPA) and protocol between the EU and Côte d’Ivoire (2018-2024), aimed at promoting sustainable fisheries, enhancing cooperation, and supporting the development of Ivorian fishing communities. The agreement prioritizes access for EU vessels to surplus resources in Côte d’Ivoire’s exclusive economic zone (EEZ) without exceeding maximum sustainable yield, ensuring local nutritional needs and food security take precedence. It builds on a previous protocol (2013-2018), which achieved a 79% average uptake of fishing opportunities but saw underuse by longliners, and emphasizes alignment with Côte d’Ivoire’s Strategic Plan for Fisheries (PSDEPA) and Blue Growth Action Plan, requiring over €140 million for sectoral development. The EU’s €273 million multiannual contribution via the European Development Fund complements sectoral support targeting infrastructure, health, and artisanal fishing, with specific measures to improve conditions for women in fish processing, strengthen local fisheries organizations, and enhance monitoring against illegal fishing. The resolution calls for transparent use of funds, including public reporting on sectoral support outcomes, and urges adherence to ILO standards, particularly Convention No. 188, to ensure fair labor conditions for Ivorian seamen, who should constitute 20% of EU vessel crews. It stresses the need for improved data collection on catches and resource sustainability, regular joint scientific evaluations, and regional cooperation to harmonize fisheries management. Parliament further demands annual reports to ensure accountability and alignment with Côte d’Ivoire’s sovereignty over resources, while advocating for local job creation, investment in the blue economy, and equitable distribution of by-catch to empower artisanal fishers and coastal communities.",
    "total_score": 0.720108695652174,
    "total_choice": 7,
    "party_num": 2,
    "id": 44,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.3,
      0.7
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "fisheries",
    "title": "Management of fishing fleets in the outermost regions: REPORT on the management of the fishing fleets in the Outermost Regions",
    "background": "The EU's outermost regions face structural challenges due to remoteness, economic dependence on fisheries, aging fleets, and underutilized marine resources, recognized under Article 349 TFEU. The Parliament will discuss adapting fishing fleet management to address these regions' unique geographic and socioeconomic realities within EU fisheries policy frameworks.",
    "stances": [
      {
        "party_name": "ALDE",
        "score": 0.8360655737704918,
        "choice": 8,
        "stance": "ALDE strongly upholds the issue's emphasis on modernizing OR fishing fleets through EU funding, aligning perfectly with ALDE's commitment to sustainable development and regional empowerment through targeted infrastructure investments.  \nALDE approves the focus on energy-efficient vessel upgrades as effectively advancing ALDE's priority of environmental responsibility while enhancing maritime safety and employment stability in vulnerable communities.  \nALDE proposes commissioning a comprehensive impact study on recreational fishing's ecological effects in ORs, reinforcing the issue's data-driven approach without challenging its core objectives.  \nALDE strongly endorses the issue's recognition of ORs' unique geographic and economic contexts, urging strict application of Article 349 TFEU to ensure policy coherence with ALDE's regional fairness principles.  \nALDE applauds the call for a dedicated fisheries fund modeled on the POSEI scheme, which directly aligns with ALDE's longstanding advocacy for tailored financial instruments in peripheral EU regions."
      },
      {
        "party_name": "ECR",
        "score": 0.029411764705882353,
        "choice": 0,
        "stance": "ECR rejects the issue for failing to extend Article 349 TFEU derogations to Mediterranean islands, contradicting their demand for parity between outermost regions and disadvantaged EU islands.  \nECR opposes the issue’s narrow focus on OR-exclusive EEZ access, which overlooks critical needs of Greek and Croatian island fisheries facing similar geographic and economic isolation.  \nThe proposal absolutely disapproves with ECR’s insistence on amending Mediterranean fishing regulations to permit traditional small-scale practices, a priority omitted in the issue’s framework.  \nECR condemns the lack of provisions for EU-funded fleet modernization in non-OR islands, inconsistent with their advocacy for state-backed upgrades to ensure safety and competitiveness.  \nThe issue’s silence on tailored CFP adjustments for Mediterranean states disregards ECR’s call for sector-specific interventions aligned with regional socio-economic vulnerabilities."
      }
    ],
    "resolution": "The European Parliament raised concerns about the unique challenges faced by the EU’s outermost regions (ORs) in fisheries management, emphasizing their geographic remoteness, socio-economic vulnerabilities, and high unemployment (up to 60% youth unemployment in some regions). It highlighted the ORs’ reliance on small-scale, traditional fishing fleets, which are often outdated, posing safety risks and hindering competitiveness, and noted that their exclusive economic zones (EEZs)—covering 2.5 million km², equivalent to the EU’s continental EEZs—are under pressure from illegal, unreported, and unregulated (IUU) fishing and external fleets. The resolution stressed the need for tailored policies under Article 349 TFEU, which permits derogations from EU rules to address OR-specific challenges, and criticized the Common Fisheries Policy (CFP) and European Maritime and Fisheries Fund (EMFF) for insufficient flexibility to support OR fisheries, despite existing measures like 100% EMFF subsidies for additional costs and a 35% increase in aid intensity for certain projects. It called for enhanced scientific data collection to inform sustainable fishing opportunities, exclusive access for OR-registered vessels in OR waters, modernization of aging fleets (without increasing capacity), and the creation of a dedicated fisheries fund modeled on the POSEI agricultural scheme. The Parliament also urged stronger EU action against IUU fishing, improved synergies between EU funds to boost local economies, and impact assessments for fisheries agreements affecting ORs. Additionally, it emphasized food security through local fisheries and advocated for simplified regulations to facilitate access to funding and infrastructure investments.",
    "total_score": 0.5905172413793104,
    "total_choice": 5,
    "party_num": 2,
    "id": 45,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.9,
      0.1
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "fisheries",
    "title": "Management, conservation and control measures applicable in the Convention Area of the South Pacific Regional Fisheries Management Organisation: REPORT on the proposal for a regulation of the European Parliament and of the Council laying down management, conservation and control measures applicable in the Convention Area of the South Pacific Regional Fisheries Management Organisation (SPRFMO)",
    "background": "The European Union, a contracting party to the South Pacific Regional Fisheries Management Organisation (SPRFMO) since 2012, is obligated to integrate the organization's adopted conservation and management measures into EU law. The Parliament will discuss a Commission proposal to transpose SPRFMO's binding measures on sustainable fishing practices and control mechanisms in the South Pacific high seas.",
    "stances": [
      {
        "party_name": "ALDE",
        "score": 0.9523809523809523,
        "choice": 9,
        "stance": "ALDE absolutely agrees the issue's alignment with international fisheries law, ensuring EU vessels operate under identical sustainability standards as third-country fleets in the SPRFMO Convention Area.  \nALDE perfectly aligns with the prohibition on large-scale driftnets, proposing enhanced member state monitoring of vessels transiting the area to prevent potential misuse of restricted gear types.  \nThis issue effectively advances ALDE's priority of ecosystem-based management by mandating support for selective coastal fishing techniques that protect biodiversity while sustaining local livelihoods.  \nALDE celebrates the integration of artisanal fishing protections as critical to achieving the dual goals of ecological preservation and socioeconomic equity in Pacific coastal communities.  \nThe transparency provisions for Commission amendments resonate with ALDE's institutional reform agenda, ensuring parliamentary oversight maintains the issue's conservation integrity."
      },
      {
        "party_name": "ECR",
        "score": 0.875,
        "choice": 8,
        "stance": "ECR strongly endorses the binding implementation of scientific precautionary principles for seamount fisheries management, aligning with their commitment to ecosystem-based marine governance.  \nECR approves the standardized controls on demersal fishing gear to protect vulnerable benthic habitats, particularly endorsing restrictions around the Louisville Ridge's ecological hotspots.  \nECR proposes enhancing Article 6 transparency provisions to require public disclosure of corporate ownership structures for EU-flagged vessels operating in the Chilean jack mackerel fishery.  \nECR commends the issue's alignment with international obligations through measurable bycatch reduction targets for seabirds, reflecting their 2023 biodiversity action plan priorities.  \nECR emphasizes the need for ongoing scientific collaboration with SPRFMO members to ensure pelagic stock assessments account for transboundary migration patterns across the Tasman Sea."
      }
    ],
    "resolution": "The European Parliament raised concerns about the ecological impact of commercial fisheries in the South Pacific high seas, particularly targeting benthic, demersal, and pelagic species concentrated around nutrient-rich seamounts and ridges such as the Lord Howe Rise, South Tasman Rise, and Louisville Ridge. It highlighted that demersal fisheries, operating at depths up to 1,500 meters, primarily exploit orange roughy, oreos, alfonsino, and bluenose, while pelagic fisheries focus on jack mackerel, often associated with nutrient upwelling zones. The resolution noted the use of diverse fishing methods, including purse seining, pelagic and bottom trawling, longlining, and potting, and emphasized the need for sustainable management due to the interconnected ecosystems and shared species across these marine features. It urged the Commission to maintain transparency by re-engaging Parliament if proposing significant amendments to fisheries policies, ensuring alignment with ecological and conservation goals.",
    "total_score": 0.8683473389355743,
    "total_choice": 8,
    "party_num": 2,
    "id": 46,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.2,
      0.8
    ],
    "veto_party_name": "ALDE"
  },
  {
    "topic": "fisheries",
    "title": "Fisheries partnership agreement with Cape Verde: fishing opportunities and financial contribution (recommendation): RECOMMENDATION on the draft Council decision on the conclusion of the Protocol between the European Union and the Republic of Cape Verde setting out the fishing opportunities and the financial contribution provided for in the Fisheries Partnership Agreement between the European Union and the Republic of Cape Verde",
    "background": "The EU and Cape Verde have maintained a fisheries partnership since 1990, with successive protocols governing access to Cape Verdean waters. Renewed negotiations addressed EU fleet operations, financial compensation, and sustainable resource management amid concerns over shark bycatch and regional development priorities. The Parliament will discuss the proposed protocol’s terms for fishing access and financial contributions.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.9534883720930233,
        "choice": 9,
        "stance": "GREEN_EFA fully sanctions the stringent monitoring mechanism triggering immediate measures upon exceeding shark catch thresholds, perfectly aligning with the party's mandate for ecosystem-based fisheries management.  \nGREEN_EFA perfectly aligns with the protocol’s vessel reduction from 35 to 30 surface longliners, recognizing this as a critical step to mitigate bycatch risks and advance precautionary principles.  \nGREEN_EFA fully sanctions the joint EU-Cape Verde scientific study on shark populations, affirming its congruence with evidence-based policy-making priorities to inform conservation measures.  \nGREEN_EFA applauds the issue’s insistence on improved stock assessment frameworks and extended protocol durations, which directly advance the party’s advocacy for longitudinal ecological evaluations.  \nGREEN_EFA perfectly aligns with the €1,050,000 allocation for Cape Verde’s sectoral fisheries policy, underscoring its consistency with equitable partnership models that prioritize local capacity-building."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.391304347826087,
        "choice": 3,
        "stance": "GUE_NGL partially agrees the protocol's monitoring mechanisms but requests binding penalties for exceeding shark bycatch thresholds, as current adjustments fail to prevent ecosystem harm.  \nGUE_NGL fully disapproves allowing 30 EU longliners to operate, citing irreversible competition with Cape Verdean artisanal fleets and demanding a 50% vessel reduction.  \nThe issue overlooks critical aspects of illegal fishing enforcement, requiring a dedicated €500,000 allocation for coastal surveillance systems to protect local livelihoods.  \nGUE_NGL rejects the 30-40% shark catch triggers as incompatible with precautionary principles, insisting on an immediate 15% cap aligned with their 2022 Ocean Manifesto.  \nThis framework perpetuates resource extraction imbalances; GUE_NGL demands amended Article 7 to prioritize Cape Verdean vessel access to 80% of fishing zones."
      }
    ],
    "resolution": "The European Parliament raised its consent to a Fisheries Partnership Agreement protocol with Cape Verde, allocating €1,050,000 as financial compensation for EU access to fisheries resources, €1,050,000 to support Cape Verde’s sectoral fisheries policy, and €1,200,000 for vessel owner fees. It highlighted a new monitoring mechanism triggering additional measures if shark catches exceed 30% or 40% of total catches, noting concerns that EU longliners previously accounted for 83% shark catches (2011-2012) and urging strict adherence to adjustments if thresholds are met. The protocol reduces EU surface longliners from 35 to 30 to mitigate shark bycatch, while a joint EU-Cape Verde shark study aims to inform future conservation measures. Despite delays, sectoral support implementation was deemed satisfactory, though its impact is hard to isolate from other programs like the World Bank-funded WARFP-CV. While targeted species face no overexploitation risks, EU longliner practices—particularly regarding blue shark (70% of catches) and other fully exploited species—were criticized for conflicting with responsible fisheries principles. Public perception risks were flagged due to EU vessels targeting sharks instead of tuna or swordfish, potentially conflating blue shark (not endangered) with protected species. The resolution called for improved assessment frameworks, extended protocol durations for consistent evaluation, a compendium of legal fisheries texts, and finalized arrangements for Cape Verde’s fisheries policy implementation.",
    "total_score": 0.8100890207715133,
    "total_choice": 8,
    "party_num": 2,
    "id": 47,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.6,
      0.4
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "fisheries",
    "title": "Fisheries partnership agreement with Cape Verde: fishing opportunities and financial contribution (report): REPORT containing a motion for a non-legislative resolution on the draft Council decision on the conclusion of the Protocol between the European Union and the Republic of Cape Verde setting out the fishing opportunities and the financial contribution provided for in the Fisheries Partnership Agreement between the European Union and the Republic of Cape Verde",
    "background": "The EU and Cape Verde have maintained a fisheries partnership since 1990, with six protocols governing access and sectoral support. Cape Verde's economy, reliant on fisheries and tourism, faces developmental challenges. Under the 2013 Common Fisheries Policy, the EU prioritizes sustainable agreements. The Parliament will discuss ratifying a new protocol defining fishing access terms and financial contributions.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9068627450980392,
        "choice": 9,
        "stance": "EPP fundamentally sanctions the Protocol's science-based thresholds for shark catch monitoring, which perfectly align with its commitment to balancing ecological preservation with responsible fisheries under the Common Fisheries Policy.  \nEPP applauds the mandatory ICCAT compliance and scientific verification mechanisms as a direct advancement of its manifesto priorities for data-driven marine resource governance.  \nEPP emphasizes that quarterly catch reporting and pre-renewal implementation reviews resonate with its longstanding demand for executive accountability and procedural transparency in external fisheries agreements.  \nEPP recognizes the issue’s socioeconomic focus on Cape Verde’s coastal communities as a model demonstration of its \"sustainability-through-partnership\" doctrine for EU-third country fisheries cooperation.  \nEPP highlights the prohibition of shark finning practices and alignment with RFO recommendations as exemplary implementations of its environmental stewardship principles in global maritime engagements."
      },
      {
        "party_name": "EFDD",
        "score": 0.3333333333333333,
        "choice": 3,
        "stance": "EFDD partly agrees the monitoring mechanisms but demands binding amendments to Article 5 ensuring Cape Verde receives equitable compensation reflecting actual resource extraction levels  \nEFDD rejects the current financial contribution of €3.3 million as colonial exploitation inconsistent with SDG 14.6, requiring protocol renegotiation before ratification  \nEFDD opposes shark catch thresholds permitting commercial harvesting without explicit bans on finning practices prohibited under EU Regulation 2023/739  \nEFDD requests revision to Annex 2 mandating third-party verification of Madagascar's enforcement capacities before implementing increased EU access quotas  \nEFDD totally rejects with the issue's socioeconomic assumptions, citing peer-reviewed studies in Marine Policy (2022) documenting fleet displacement triggering illegal activities in Guinea-Bissau waters"
      }
    ],
    "resolution": "The European Parliament raised the adoption of a new Fisheries Partnership Agreement Protocol with Cape Verde aimed at enhancing sustainable fisheries cooperation, emphasizing environmental and socioeconomic sustainability under the Common Fisheries Policy. The protocol establishes a monitoring mechanism with thresholds triggering additional measures if shark catches exceed 30% or 40% of total catches, alongside quarterly data exchanges to ensure sustainable exploitation, particularly for blue shark and shortfin mako species (99% of EU fleet catches), deemed healthy by scientific assessments. It stresses adherence to ICCAT recommendations and mandates a science-based study to verify sustainable practices, with the Commission required to report findings to Parliament. The resolution highlights delays in sectoral support implementation and calls for standardized evaluation frameworks, while urging the Commission to regularly share Joint Committee minutes, multiannual sectoral programs, and annual updates on Cape Verde’s international fishing agreements to align with EU policies and prevent practices like shark finning. Parliament also demands timely reporting on protocol implementation before renewal negotiations and full transparency throughout the process.",
    "total_score": 0.8130563798219584,
    "total_choice": 8,
    "party_num": 2,
    "id": 48,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.4,
      0.6
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "fisheries",
    "title": "Fisheries partnership agreement with Guinea-Bissau: fishing opportunities and financial contribution (recommendation): RECOMMENDATION on the draft Council decision on the conclusion of the Protocol setting out the fishing opportunities and financial contribution provided for in the Fisheries Partnership Agreement between the European Community and the Republic of Guinea-Bissau",
    "background": "The EU and Guinea-Bissau have maintained a fisheries partnership since 1980, with protocols governing access and financial terms. Guinea-Bissau's economy relies heavily on fisheries, amid political instability and regional agreements with other coastal states. The Parliament will discuss renewing the protocol on fishing opportunities and financial contributions under the partnership framework.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.8676470588235294,
        "choice": 8,
        "stance": "EPP strongly agrees the protocol’s emphasis on transparency and scientific compliance, aligning perfectly with their commitment to sustainable fisheries governance and mutual economic benefit.  \nEPP approves the €3.5 million sectoral support allocation, highlighting its alignment with Guinea-Bissau’s development priorities and their manifesto focus on equitable partnerships.  \nEPP applauds the integration of human rights and anti-illegal fishing clauses, which reflect their 2023 priorities for ethical and environmentally responsible international agreements.  \nEPP emphasizes the agreement’s role in stabilizing local economies through structured resource access, strongly agreeing measures that balance EU fleet interests with community development.  \nEPP proposes formalizing parliamentary oversight in joint commission meetings to enhance accountability, suggesting minor procedural amendments to ensure continuous democratic engagement."
      },
      {
        "party_name": "ECR",
        "score": 0.046875,
        "choice": 0,
        "stance": "ECR rejects the agreement due to unresolved maritime boundary disputes with Senegal, creating legal risks for EU vessels operating under contested licenses.  \nECR opposes the protocol for failing to guarantee economic benefits will reach impoverished coastal communities, contradicting development solidarity principles.  \nThe proposal absolutely opposes with ECR's insistence on preemptive issue of territorial ambiguities to prevent recurring litigation.  \nECR condemns the omission of binding mechanisms to ensure sectoral funds directly uplift local artisanal fishers as governance standards require.  \nThis overlooks critical aspects of regional stability by ignoring unresolved \"grey zone\" waters that previously triggered EU court cases."
      }
    ],
    "resolution": "The European Parliament raised its consent to the conclusion of a five-year Fisheries Protocol between the EU and Guinea-Bissau, which allocates €9.14 million in EU funding, including €3.5 million for sectoral support to enhance sustainable fisheries management. The agreement grants EU vessels access to Guinea-Bissau’s waters, specifying annual fishing opportunities of 3,500 tonnes for tuna and 7,500 tonnes for demersal species, while emphasizing compliance with scientific recommendations, monitoring measures, and respect for local artisanal fishing zones. The resolution underscores the need for transparency in fund allocation, alignment with Guinea-Bissau’s development priorities, and adherence to human rights and governance standards. It instructs the Parliament’s President to communicate the decision to relevant EU institutions, member states, and Guinea-Bissau’s government and parliament.",
    "total_score": 0.6350148367952523,
    "total_choice": 6,
    "party_num": 2,
    "id": 49,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.3,
      0.7
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "fisheries",
    "title": "Fisheries partnership agreement with Guinea-Bissau: fishing opportunities and financial contribution (report): REPORT containing a motion for a non-legislative resolution on the draft Council decision on the conclusion of the Protocol setting out the fishing opportunities and financial contribution provided for in the Fisheries Partnership Agreement between the European Community and the Republic of Guinea Bissau",
    "background": "The EU and Guinea-Bissau established a fisheries partnership in 1980, with protocols granting EU vessels access to its waters. Economic reliance on EU financial contributions, challenges in sectoral cooperation, and concerns over illegal fishing and resource sustainability persisted. The Parliament will discuss renewing the protocol, balancing fishing access with sustainable development and governance.",
    "stances": [
      {
        "party_name": "SD",
        "score": 0.9069767441860465,
        "choice": 9,
        "stance": "SD totally accepts the issue's integration of democratic stability objectives with fisheries access, perfectly aligning with SD's commitment to linking EU resource partnerships with governance reforms in developing nations.  \nSD perfectly aligns with the emphasis on scientific stock assessments and surplus-based fishing limits, recognizing this as essential to fulfilling SD's environmental priorities for preventing overexploitation while maintaining EU fleet viability.  \nSD strongly promotes the conditional sectoral funding tied to institutional capacity-building, seeing this as effectively advancing SD's development agenda through vocational training and gender-inclusive processing infrastructure improvements.  \nSD applauds the binding IUU enforcement mechanisms via satellite monitoring and regional cooperation, which match SD's manifesto commitments to combat unfair competition from illegal catches while protecting artisanal fishers' livelihoods.  \nSD emphasizes the issue's alignment with Cotonou Agreement principles on human rights and rule of law, viewing this as critical to SD's vision of ethical fisheries diplomacy that addresses migration root causes through equitable economic development."
      },
      {
        "party_name": "ECR",
        "score": 0.046875,
        "choice": 0,
        "stance": "ECR rejects the agreement due to unresolved maritime boundary disputes with Senegal, creating legal uncertainty for EU vessels operating under conflicting EEZ claims.  \nECR opposes fundamentally the financial provisions failing to ensure direct economic benefits reach local communities, contradicting their principle of equitable development.  \nECR highlights the unresolved \"grey zone\" territorial waters issue as incompatible with legal security requirements, risking recurrent illegal detentions of EU fleets.  \nECR condemns the omission of binding mechanisms to verify Guinea-Bissau’s maritime jurisdiction clarity before granting access, violating sovereignty safeguards.  \nECR asserts the agreement’s structure perpetuates past failures in local value distribution, conflicting with their stance against exploitative resource partnerships.  "
      }
    ],
    "resolution": "The European Parliament raised concerns and outlined priorities regarding the EU-Guinea-Bissau Fisheries Partnership Agreement, emphasizing the need for sustainable, mutually beneficial cooperation. The resolution highlighted fishing opportunities granted to EU fleets, including 3,700 GRT for shrimp trawlers, 3,500 GRT for fin-fish/cephalopod trawlers, 28 tuna seiners/longliners, and 12 pole-and-line vessels, while stressing the importance of limiting access to surplus stocks to ensure ecological sustainability and local food security. It noted financial contributions under the Agreement as a significant part of Guinea-Bissau’s budget but criticized past suspensions of sectoral support due to poor aid uptake and insufficient local economic benefits, with only 148 local crew jobs and minimal processing infrastructure (one plant in 2010). The resolution urged enhanced transparency, accountability, and participation of artisanal fishing communities, advocating for technical assistance to strengthen institutional capacity, vocational training, gender inclusion (recognizing women’s roles in distribution and processing), and partnerships to boost local fisheries’ added value. It called for stricter measures against illegal, unreported, and unregulated (IUU) fishing, citing 58 non-compliant vessels in 2008–2009, and emphasized improved monitoring via satellite systems, logbooks, and regional cooperation. The Parliament demanded better data collection on catches and resource sustainability, regular Joint Committee oversight to address corruption risks, and alignment of sectoral support with development funds like the European Development Fund. It insisted on Guinea-Bissau’s compliance with EU health standards to facilitate trade and urged the Commission to ensure regular reporting, including annual assessments of the sectoral program and full implementation reviews before Protocol renewal.",
    "total_score": 0.6765578635014837,
    "total_choice": 6,
    "party_num": 2,
    "id": 50,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.5,
      0.5
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "fisheries",
    "title": "Fisheries partnership agreement with Madagascar: fishing opportunities and financial contribution: RECOMMENDATION on the draft Council decision on the conclusion, on behalf of the European Union, of the Protocol setting out the fishing opportunities and the financial contribution provided for in the Fisheries Partnership Agreement between the Republic of Madagascar and the European Community",
    "background": "The EU and Madagascar maintain a Fisheries Partnership Agreement regulating EU vessel access to Malagasy waters, part of broader EU fisheries agreements with coastal states under Common Fisheries Policy reforms. The Parliament will discuss renewing the protocol’s terms on fishing access quotas, financial contributions, and sustainable resource management.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.9534883720930233,
        "choice": 9,
        "stance": "GREEN_EFA firmly accepts the Madagascar Protocol's binding clauses to reduce shark bycatch, perfectly aligning with their marine biodiversity protection agenda.  \nGREEN_EFA applauds the mandated ex-post evaluation requirement as exemplifying their principles of scientific rigor and equitable resource sharing between EU fleets and coastal states.  \nGREEN_EFA recognizes the observer access for Parliament's Fisheries Committee as a model for transparent governance, mirroring their demands for real-time agreement oversight.  \nGREEN_EFA highlights the Protocol's alignment with reformed CFP ethics through Article 6 reporting, ensuring Madagascar's multi-annual support program directly combats illegal fishing risks.  \nGREEN_EFA affirms that the issue’s focus on cost-benefit analysis and license fairness operationalizes their manifesto pledge for fisheries partnerships benefiting both parties equally."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.10869565217391304,
        "choice": 1,
        "stance": "GUE_NGL rejects the Fisheries Partnership Agreement as it firmly doubts with their principle of protecting small-scale indigenous fisheries from destructive industrial competition.  \nGUE_NGL opposes the Protocol for failing to implement binding safeguards against large foreign trawlers that disproportionately extract resources vital to Madagascar’s artisanal fishers.  \nGUE_NGL highlights the issue’s failure to address power imbalances, enabling EU industrial fleets to replicate exploitative practices witnessed in Irish coastal waters.  \nGUE_NGL condemns the omission of mechanisms to prevent stock depletion by third-country vessels like those from Russia or China, which undermines the agreement’s sustainability claims.  \nGUE_NGL demands radical revisions to prioritize Madagascar’s local fishing communities over industrial profit-sharing frameworks benefiting EU vessel owners."
      }
    ],
    "resolution": "The European Parliament raised its consent to the Fisheries Partnership Agreement Protocol between the EU and Madagascar (15226/2014), which sets fishing opportunities and financial contributions, emphasizing improved transparency and accountability. It mandated the EU to transmit detailed information on joint scientific meetings (Article 7) and changes to fishing conditions (Article 8), including minutes, annual reports on the multi-annual support program (Article 6), and other relevant documents. Parliament secured observer access for its Fisheries Committee representatives to Joint Committee meetings to monitor implementation. The resolution required the EU to submit an ex-post evaluation before renewing the Protocol, analyzing fishing opportunity utilization, cost-benefit assessments, and operational constraints, and to assess the fairness of the agreement, including benefit-sharing between EU vessel owners and Madagascar. These measures aim to ensure sustainable fisheries cooperation and equitable outcomes under the Protocol.",
    "total_score": 0.8204747774480712,
    "total_choice": 8,
    "party_num": 2,
    "id": 51,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.7,
      0.3
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "fisheries",
    "title": "Landing obligation: REPORT on the proposal for a regulation of the European Parliament and of the Council amending Council Regulations (EC) No 850/98, (EC) No 2187/2005, (EC) No 1967/2006, (EC) No 1098/2007, No 254/2002, (EC) No 2347/2002 and (EC) No 1224/2009 and repealing (EC) No 1434/98 as regards the landing obligation",
    "background": "The European Union’s Common Fisheries Policy reforms introduced measures to eliminate discards, requiring alignment of existing technical conservation rules and control systems with the landing obligation. The Parliament will discuss amendments to fisheries regulations to address implementation challenges and ensure coherence with sustainability objectives under the revised policy framework.",
    "stances": [
      {
        "party_name": "EFDD",
        "score": 0.10526315789473684,
        "choice": 1,
        "stance": "EFDD rejects the partial landing obligation as fundamentally inadequate to dismantle the EU's collectivized fisheries mismanagement criticized in Article 49a removals.  \nEFDD opposes the 50kg exemption threshold for small-scale fisheries (Regulation 1224/2009 amendments), which creates loopholes undermining total discard elimination goals.  \nThis issue conflicts with EFDD's demand for full policy decentralization, perpetuating Spanish/French fleet dominance through unchanged quota systems under Regulation 850/98.  \nThe proposal overlooks critical structural reforms needed to replace \"impractical\" monitoring regimes (Article 25a revisions) with localized stewardship models.  \nEFDD condemns the retention of logbook rules (Article 14 of Regulation 1224/2009) as symptomatic of bureaucratic overreach antithetical to their anti-centralization principles."
      },
      {
        "party_name": "ALDE",
        "score": 0.9107142857142857,
        "choice": 9,
        "stance": "ALDE totally agrees the phased implementation framework, perfectly aligning with their commitment to balancing ecological sustainability with practical enforceability in fisheries management.  \nALDE highlights the issue’s retention of existing logbook rules under Article 14 of Regulation 1224/2009 as critical to maintaining legal clarity and preventing administrative overreach.  \nALDE applauds the simplified remote monitoring provisions in Article 25a, which align with their principle of subsidiarity by preserving member states’ flexibility in compliance verification.  \nALDE supports the elimination of separate storage requirements for undersized catches, recognizing this as a pragmatic step to reduce operational burdens while upholding conservation goals.  \nALDE emphasizes the necessity of transitional flexibility for small-scale fisheries, framing this as an enhancement opportunity to ensure stakeholder buy-in and long-term policy success."
      }
    ],
    "resolution": "The European Parliament raised substantive amendments to several EU fisheries regulations to enhance conservation and management, focusing on the Baltic Sea, Mediterranean, and deep-sea stocks. Key changes included deleting ambiguous provisions in Council Regulations 850/98 and 2187/2005 that required fishing vessel captains to hold sufficient quotas, deemed unenforceable. It opposed altering logbook rules under Article 14 of Regulation 1224/2009, arguing existing provisions should remain to avoid complicating the landing obligation. The Parliament simplified remote electronic monitoring requirements in Article 25a of Regulation 1224/2009, affirming member states’ autonomy in monitoring methods and clarifying that the regulation does not mandate widespread remote surveillance. It also proposed removing Article 49a of Regulation 1224/2009, which required separate storage for undersized catches, deeming it unnecessarily burdensome for fishermen and non-essential for enforcing landing obligations. The resolution addressed diverse fisheries, including small and large pelagic species, industrial fisheries (e.g., capelin, sandeel), Baltic salmon, and other Baltic fisheries, while referencing foundational regulations such as 1967/2006 (Mediterranean management), 1098/2007 (Baltic cod plan), and 2347/2002 (deep-sea access rules). The Parliament emphasized aligning technical measures with sustainability goals and simplifying compliance for stakeholders.",
    "total_score": 0.7759398496240602,
    "total_choice": 7,
    "party_num": 2,
    "id": 52,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.5,
      0.5
    ],
    "veto_party_name": "ALDE"
  },
  {
    "topic": "fisheries",
    "title": "Multi-annual plan for demersal stocks in the North Sea and the fisheries exploiting those stocks: REPORT on the proposal for a regulation of the European Parliament and of the Council on establishing a multi-annual plan for demersal stocks in the North Sea and the fisheries exploiting those stocks and repealing Council Regulation (EC) 676/2007 and Council Regulation (EC) 1342/2008",
    "background": "The European Commission proposed a multi-annual plan for North Sea demersal fisheries, replacing 2007 and 2008 regulations, amid Brexit-related uncertainties following the UK’s Article 50 notification. Existing Common Fisheries Policy frameworks required updated management to address sustainable exploitation and mixed fisheries challenges. The Parliament will discuss establishing a revised management framework for North Sea demersal stocks.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.061611374407582936,
        "choice": 0,
        "stance": "EPP rejects the inclusion of recreational fishing regulations as disproportionate bureaucratic overreach lacking legal justification under the Common Fisheries Policy framework.  \nEPP opposes setting catch limits without binding scientific assessments, contradicting Article 9(1) of the Basic Regulation requiring evidence-based management.  \nEPP entirely opposes with imposing stricter North Sea restrictions than Baltic equivalents, failing to balance marine conservation with coastal communities' economic survival.  \nEPP condemns the disregard for socioeconomic impacts on small-scale fisheries, violating the CFP's Article 9(4) requiring livelihood considerations.  \nEPP disputes the plan's urgency-driven timeline as undermining quality governance, despite Brexit pressures requiring durable legislative solutions."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.9148936170212766,
        "choice": 9,
        "stance": "GREEN_EFA firmly supports the issue's strict enforcement of FMSY limits, perfectly aligning with their foundational commitment to achieving maximum sustainable yield for long-term stock recovery.  \nGREEN_EFA perfectly aligns with the inclusion of recreational fisheries accountability measures, ensuring all sectors contributing to stock depletion bear proportional conservation responsibilities as mandated by the Common Fisheries Policy.  \nGREEN_EFA fully supports the issue's emphasis on regionalized governance, advocating for devolved decision-making frameworks that empower North Sea nations to collaborate effectively post-Brexit.  \n  \nGREEN_EFA strongly affirms the issue’s procedural continuity measures, ensuring transparent legislative adherence amid evolving post-Brexit fisheries dynamics."
      }
    ],
    "resolution": "The European Parliament raised its position on the Commission’s 2016 proposal (COM(2016)0493) concerning measures under Article 43(2) of the Treaty on the Functioning of the European Union, emphasizing the need to address implications of the United Kingdom’s withdrawal notification under Article 50 TEU on March 29, 2017. It endorsed the Committee on Fisheries’ report (A8-0263/2017), urging the Commission to maintain alignment with Parliament’s stance and to re-engage legislators if proposing substantial amendments to the original text. The resolution stressed procedural continuity by instructing the President to transmit Parliament’s adopted position to the Council, Commission, and national parliaments, ensuring transparency and adherence to legislative processes amid evolving post-Brexit dynamics.",
    "total_score": 0.5076923076923077,
    "total_choice": 5,
    "party_num": 2,
    "id": 53,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.3,
      0.7
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "fisheries",
    "title": "Multiannual plan for demersal stocks in the North Sea and the fisheries exploiting those stocks: REPORT on the proposal for a regulation of the European Parliament and of the Council on establishing a multi-annual plan for demersal stocks in the North Sea and the fisheries exploiting those stocks and repealing Council Regulation (EC) 676/2007 and Council Regulation (EC) 1342/2008",
    "background": "The European Commission proposed updating North Sea fisheries management to align with the 2013 Common Fisheries Policy, addressing sustainable exploitation amid Brexit's impact on shared stocks and existing regulations (EC 676/2007, EC 1342/2008). The Parliament will discuss a multi-annual plan for demersal stocks to balance ecological sustainability and regional fishing interests.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.004761904761904762,
        "choice": 0,
        "stance": "EPP rejects the inclusion of recreational fishing regulations in the North Sea plan due to disproportionate bureaucratic burdens and absence of impact assessment.  \nEPP opposes setting catch limit ranges without scientific justification, contradicting Article 9 of the CFP and undermining legal certainty for fisheries.  \nEPP completely disapproves with imposing stricter rules on North Sea fisheries than Baltic Sea regimes, risking coastal livelihoods and small-scale operations.  \nEPP condemns the proposal’s failure to address choke species interactions (e.g., cod/plaice) with flexible management, threatening practical fishery viability.  \nEPP highlights the issue’s disregard for proven stock recovery successes under existing plans, risking unnecessary disruption to sustainable practices."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.9,
        "choice": 9,
        "stance": "GREEN_EFA firmly supports the issue's strict adherence to maximum sustainable yield (FMSY) thresholds, perfectly aligning with their decades-long advocacy for science-based fisheries management that guarantees stock recovery and intergenerational equity.  \n\nGREEN_EFA perfectly aligns with the integration of recreational fisheries accountability measures, recognizing this as critical to achieving the Common Fisheries Policy’s sustainability goals and preventing sectoral overexploitation of demersal stocks.  \n\nGREEN_EFA fully supports the issue’s rejection of fishing mortality intervals exceeding FMSY, affirming this as essential to fulfilling the EU’s binding commitments under the reformed fisheries policy framework.  \n\nGREEN_EFA highlights the issue’s compatibility with regionalized decision-making structures, emphasizing that North Sea coastal states’ collaboration must prioritize ecological thresholds over short-term economic interests.  \n\nGREEN_EFA strongly endorses the issue’s systemic approach to multiannual planning, which effectively advances their core principle of treating marine ecosystems as non-negotiable foundations for coastal livelihoods."
      }
    ],
    "resolution": "The European Parliament raised its position on the Commission’s proposal (COM(2016)0493) concerning the United Kingdom’s withdrawal from the EU under Article 50, following the UK’s official notification on 29 March 2017. It referenced legal bases under the Treaty on the Functioning of the EU, including Articles 294(2), 294(3), and 43(2), and incorporated input from the European Economic and Social Committee’s opinion of 14 December 2016 and the Committee on Fisheries’ report (A8-0263/2017). The Parliament formally adopted its first-reading position, urging the Commission to resubmit the matter if it significantly alters or replaces its original proposal. It also directed its President to communicate this position to the Council, Commission, and national parliaments, ensuring alignment with procedural requirements under Rule 59 of its Rules of Procedure while emphasizing substantive decisions over procedural steps.",
    "total_score": 0.24246575342465754,
    "total_choice": 2,
    "party_num": 2,
    "id": 54,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.3,
      0.7
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "fisheries",
    "title": "Multiannual plan for fish stocks in the Western Waters and adjacent waters, and for fisheries exploiting those stocks: REPORT on the proposal for a Regulation of the European Parliament and of the Council establishing a multiannual plan for fish stocks in the Western Waters and adjacent waters, and for fisheries exploiting those stocks, amending Regulation (EU) 2016/1139 establishing a multiannual plan for the Baltic Sea, and repealing Regulations (EC) No 811/2004, (EC) No 2166/2005, (EC) No 388/2006, (EC) No 509/2007 and (EC) No 1300/2008",
    "background": "The EU’s 2013 Common Fisheries Policy reforms prioritized regionalized, science-based management, with existing multiannual plans adopted for the Baltic and North Sea. Declining stocks in Western Waters, overlapping national jurisdictions, and Brexit’s impact on shared fisheries necessitated updated frameworks. The Parliament will discuss establishing a multiannual plan to balance ecological sustainability and fishing sector viability.",
    "stances": [
      {
        "party_name": "ECR",
        "score": 0.7222222222222222,
        "choice": 7,
        "stance": "ECR strongly agrees the regionalization framework for Western Waters fisheries, aligning perfectly with ECR's longstanding commitment to tailored marine governance respecting basin-specific ecological and economic conditions.  \nECR applauds the integration of scientific advisory mechanisms into fishing opportunity decisions, effectively advancing ECR's priority of evidence-based resource management anchored in FMSY targets.  \nECR emphasizes the necessity to formally incorporate socioeconomic impact assessments for small-scale fisheries during implementation phases while maintaining full alignment with sustainability goals.  \nECR approves the sunset clause provision as a balanced mechanism to ensure periodic legislative review without undermining regulatory stability for fishing communities.  \nECR proposes enhancing Article 4's regional consultation protocols to explicitly include coastal municipalities and artisanal fishing representatives in advisory processes."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.020833333333333332,
        "choice": 0,
        "stance": "GUE_NGL fundamentally rejects the issue's perpetuation of centralized fisheries management models that disregard small-scale artisanal fleets' operational realities.  \nGUE_NGL opposes the artificial merger of distinct North/South Western Waters ecosystems as incompatible with context-sensitive resource governance.  \nThis proposal conflicts with GUE_NGL's demand for decentralized decision-making respecting regional socioeconomic specificities in Articles 4-7.  \nThe issue overlooks critical deficiencies in addressing gear-type diversity and coastal community viability through standardized FMSY thresholds.  \nGUE_NGL condemns the Commission's failure to rectify technocratic biases against localized knowledge systems in Annex III monitoring protocols."
      }
    ],
    "resolution": "The European Parliament raised concerns and established measures to enhance transparency and accountability in EU fisheries management, mandating the Commission to annually report on the alignment between scientific advice and Council decisions regarding fishing opportunities. It required the Commission to notify Parliament in advance of any Council decisions potentially leading to significant deviations (exceeding 20%) in fishing opportunities from newly established maximum sustainable yield (FMSY) targets. Additionally, a seven-year sunset clause was introduced for management provisions directly tied to updated scientific advice, ensuring legislators can review and amend the framework post-deadline. The resolution emphasized maintaining scientific integrity in decision-making, institutional oversight, and periodic evaluation of regulatory mechanisms, while instructing the Commission to re-engage Parliament if proposing substantial amendments to its original proposal.",
    "total_score": 0.592140921409214,
    "total_choice": 5,
    "party_num": 2,
    "id": 55,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.5,
      0.5
    ],
    "veto_party_name": "GUE_NGL"
  },
  {
    "topic": "fisheries",
    "title": "Multiannual plan for small pelagic stocks in the Adriatic Sea and the fisheries exploiting those stocks: REPORT on the proposal for a regulation of the European Parliament and of the Council  establishing a multi-annual plan for small pelagic stocks in the Adriatic Sea and the fisheries exploiting those stocks",
    "background": "Adriatic small pelagic stocks, vital for regional fisheries, faced overexploitation with scientific assessments indicating critically low biomass and high fishing mortality. Existing management under the General Fisheries Commission for the Mediterranean involved effort restrictions. The Parliament will discuss establishing an EU multiannual plan to ensure sustainable management of sardine and anchovy fisheries in the Adriatic Sea.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.8691588785046729,
        "choice": 8,
        "stance": "EPP strongly approves the establishment of a science-based management framework for Adriatic pelagic stocks, aligning perfectly with EPP's longstanding commitment to balancing ecological sustainability with the socio-economic stability of fishing communities.  \nEPP proposes enhancing stakeholder consultation mechanisms to ensure fishermen’s expertise directly informs quota adjustments, reflecting the need for practical input alongside scientific models.  \nEPP applauds the integration of EMFF-funded socio-economic measures to mitigate temporary fishing reductions, ensuring small-scale fisheries remain viable during stock recovery periods.  \nEPP emphasizes the necessity of maintaining regional flexibility in quota implementation, as highlighted by the need to align with Mediterranean General Fisheries Commission standards while achieving maximum sustainable yield.  \nEPP urges stricter adherence to democratic transparency in Commission amendments to avoid procedural conflicts, framing this as an enhancement opportunity to strengthen institutional trust."
      },
      {
        "party_name": "ALDE",
        "score": 0.07352941176470588,
        "choice": 0,
        "stance": "ALDE rejects the proposal's failure to incorporate long-term scientific solutions and sustainable job transition plans for Adriatic coastal communities, contradicting their commitment to balanced resource management.  \nALDE opposes the three-year management delay as inadequate for stock recovery, demanding immediate binding measures aligned with GFCM recommendations.  \nThe proposal totally disapproves with ALDE's principle of local stakeholder inclusion by disregarding the historic cross-border fishermen's agreement.  \nALDE criticizes the issue's environmental focus for neglecting socioeconomic impacts, undermining blue growth strategies in the Adriatic-Ionian macroregion.  \nThe omission of data-driven multiyear catch limits violates ALDE's evidence-based policymaking standards, requiring full scientific committee oversight amendments."
      }
    ],
    "resolution": "The European Parliament raised its position on the Commission’s 2017 proposal (COM(2017)0097) concerning fisheries and environmental policies, adopting amendments based on the Committee on Fisheries’ report (A8-0337/2018) and incorporating input from the Committee on the Environment, Public Health and Food Safety. The resolution emphasized the need for sustainable resource management and alignment with environmental goals, urging the Commission to resubmit the proposal if it undergoes substantial revisions. It also directed the Parliament’s President to transmit the adopted position to the Council, Commission, and national parliaments, ensuring continued legislative coherence and adherence to EU treaty obligations under Article 43(2) TFEU.",
    "total_score": 0.46467391304347827,
    "total_choice": 4,
    "party_num": 2,
    "id": 56,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.4,
      0.6
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "fisheries",
    "title": "Multiannual plan for the stocks of cod, herring and sprat in the Baltic Sea and the fisheries exploiting those stocks: REPORT on the proposal for a regulation of the European Parliament and of the Council establishing a multiannual plan for the stocks of cod, herring and sprat in the Baltic Sea and the fisheries exploiting those stocks, amending Council Regulation (EC) No 2187/2005 and repealing Council Regulation (EC) No 1098/2007",
    "background": "Declining cod, herring, and sprat stocks in the Baltic Sea due to overfishing and ecosystem pressures prompted EU commitments under the 2013 Common Fisheries Policy reform, requiring multiannual plans informed by scientific advice. The Parliament will discuss establishing a regional management plan balancing sustainable exploitation and ecosystem considerations for these fisheries.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.0,
        "choice": 0,
        "stance": "GREEN_EFA rejects the proposal's failure to mandate fishing limits aligned with scientific advice, totally doubting with their principle of ecosystem-based management.  \nGREEN_EFA opposes the omission of binding measures to address Baltic Sea pollution, inconsistent with their stance on holistic environmental protection.  \nGREEN_EFA condemns the plan's tolerance of short-term overfishing pressures, which overlooks critical warnings about cod stock collapse.  \nGREEN_EFA disputes the inadequate safeguards against destructive practices like oil drilling in sensitive marine areas, a direct contradiction to their 2023 Adriatic protection pledges.  \nGREEN_EFA highlights the issue's inconsistency with EU sustainability treaties by prioritizing interim catch quotas over long-term stock recovery."
      },
      {
        "party_name": "ALDE",
        "score": 0.819672131147541,
        "choice": 8,
        "stance": "ALDE strongly endorses the multiannual plan as a blueprint for sustainable fisheries management, aligning perfectly with ALDE's longstanding commitment to science-based ecosystem approaches in EU waters.  \nALDE proposes amending Annex II to integrate the latest scientific data on cod spawning biomass, ensuring dynamic adaptation to ecological realities without opposing the plan’s core structure.  \nALDE approves the issue’s multi-species quota system and regionalization principles, which effectively advance ALDE’s priority of balancing ecological resilience with coastal communities’ economic needs.  \nALDE advocates expanding the regionalized management framework to semi-enclosed seas like the Adriatic, emphasizing tailored strategies for small-scale fisheries as a logical enhancement opportunity.  \nALDE applauds the institutional cooperation mechanisms outlined in Article 4, which mirror ALDE’s 2014 manifesto goals for transparent, stakeholder-inclusive governance."
      }
    ],
    "resolution": "The European Parliament raised its position on the Commission’s 2014 proposal (COM(2014)0614) concerning fisheries policy, grounded in Directive 2008/56/EC and informed by the Committee on Fisheries’ report (A8-0128/2015). It formally adopted its first-reading stance, urging the Commission to re-engage Parliament if proposing significant amendments or alternative texts, and instructed its President to transmit this position to the Council, Commission, and national parliaments. The resolution emphasized alignment with existing EU legal frameworks and procedural obligations under the Treaties, while focusing on reinforcing sustainable fisheries management and institutional cooperation.",
    "total_score": 0.6598540145985401,
    "total_choice": 6,
    "party_num": 2,
    "id": 57,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.4,
      0.6
    ],
    "veto_party_name": "ALDE"
  },
  {
    "topic": "fisheries",
    "title": "Multiannual recovery plan for Bluefin tuna: REPORT on the proposal for a regulation of the European Parliament and of the Council on a multiannual recovery plan for Bluefin tuna in the eastern Atlantic and the Mediterranean repealing Regulation (EC) No 302/2009",
    "background": "Following a significant decline in eastern Atlantic and Mediterranean Bluefin tuna stocks, the International Commission for the Conservation of Atlantic Tunas (ICCAT) adopted a multiannual recovery plan in 2006, with scientific assessments showing biomass recovery by 2014 prompting updated catch limits. The Parliament will discuss aligning EU regulations with revised ICCAT measures.",
    "stances": [
      {
        "party_name": "ALDE",
        "score": 0.8524590163934426,
        "choice": 8,
        "stance": "ALDE strongly accepts the multiannual recovery plan’s science-based approach, aligning perfectly with ALDE’s commitment to evidence-driven environmental stewardship and recognizing the proven biomass recovery since 2012.  \nALDE approves the issue’s emphasis on equitable fishing conditions for EU and non-EU fleets in the Mediterranean, urging enhanced enforcement to eliminate competitive disadvantages for European operators.  \nALDE advocates for prioritizing traditional small-scale fisheries such as the Canarian almadraba system, highlighting their environmental efficiency and alignment with sustainable practices outlined in ALDE’s regional development agendas.  \nALDE proposes strengthening transparency provisions by mandating parliamentary oversight in quota negotiations, ensuring compliance with Lisbon Treaty principles and preventing opaque decision-making.  \nALDE recommends expanding scientific assessments to include interconnected fish stocks across the Mediterranean and Atlantic, enhancing ecosystem-wide management while maintaining strict TAC adherence."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.22916666666666666,
        "choice": 2,
        "stance": "GUE/NGL completely challenges the proposed quota increases as this directly contradicts their stance against endangering marine ecosystems for industrial fishing interests.  \nGUE/NGL rejects the issue’s failure to abolish harmful subsidies that perpetuate overcapacity in industrial fleets, a core contradiction to their environmental protection principles.  \nGUE/NGL highlights the proposal’s disregard for sustainable small-scale fisheries, as seen in its unequal quota allocation that marginalizes traditional methods like almadraba and artisanal Azorean practices.  \nGUE/NGL condemns the premature expansion of fishing limits, which dangerously ignores scientific warnings about the species’ continued vulnerability and risks irreversible collapse.  \nGUE/NGL emphasizes the issue’s ethical failure to address bycatch mortality, perpetuating what they deem systemic violence against marine biodiversity."
      }
    ],
    "resolution": "The European Parliament raised its position on the Commission’s 2015 proposal concerning fisheries, adopting its first-reading stance under Article 294(2) and Article 43(2) of the Treaty on the Functioning of the European Union. It emphasized the need for the Commission to reassess and resubmit the proposal to Parliament if substantial amendments or a replacement text were planned, ensuring legislative coherence. The resolution instructed the Parliament’s President to formally communicate its adopted position to the Council, the Commission, and national parliaments, reinforcing procedural adherence while focusing on the substantive alignment of fisheries policy with EU treaty obligations.",
    "total_score": 0.7153284671532847,
    "total_choice": 7,
    "party_num": 2,
    "id": 58,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.1,
      0.9
    ],
    "veto_party_name": "ALDE"
  },
  {
    "topic": "fisheries",
    "title": "North-East Atlantic: deep-sea stocks and fishing in international waters: RECOMMENDATION FOR SECOND READING on the Council position at first reading in view of the adoption of a Regulation of the European Parliament and of the Council establishing specific conditions for fishing for deep-sea stocks in the North-East Atlantic and provisions for fishing in international waters of the North-East Atlantic and repealing Council Regulation (EC) No 2347/2002",
    "background": "Existing EU regulations on North-East Atlantic deep-sea fishing, established in 2002, faced criticism over ecological impacts and unsustainable practices. Growing scientific evidence highlighted vulnerabilities of deep-sea ecosystems and species to industrial fishing methods. The Parliament will discuss updated measures to regulate deep-sea fisheries and international waters while balancing environmental protection and fishing industry sustainability.",
    "stances": [
      {
        "party_name": "EFDD",
        "score": 0.42105263157894735,
        "choice": 4,
        "stance": "EFDD partly promotes the 800-meter trawling restriction but demands expanded protections for ecosystems below 400 meters through enforceable monitoring protocols.  \nEFDD requests amendment of Article 9 to prohibit EU jurisdiction in UK waters post-Brexit, citing fundamental conflicts with national sovereignty principles.  \nEFDD highlights the proposal’s failure to address centralized EU governance mechanisms inconsistent with subsidiarity commitments.  \nEFDD urges revision of Annex I to require bilateral agreements rather than EU-led authorization for international waters access.  \n Internal contradictions reflect EFDD’s dual emphasis on environmental caution and opposition to EU regulatory expansion."
      },
      {
        "party_name": "SD",
        "score": 0.017142857142857144,
        "choice": 0,
        "stance": "SD rejects the regulation's failure to extend Macaronesia-level habitat protections to international waters, fundamentally againsting with SD's commitment to transboundary ecosystem conservation.  \nSD opposes the 800-meter trawling depth limit as insufficiently precautionary, arguing it overlooks scientific evidence of vulnerable cold-water coral reefs above 400 meters inconsistent with SD's sustainability principles.  \nSD condemns the 20% observer coverage mandate as inadequate for robust data collection, demanding 100% electronic monitoring to address transparency gaps in bycatch reporting.  \nSD rejects the issue's tolerance of industrial fishing impacts on artisanal coastal communities, directly contradicting SD's 2023 manifesto pledge to prioritize small-scale fisheries.  \nSD fundamentally disputes allowing continued bottom trawling in biologically connected archipelagic waters, undermining SD's oceanic biodiversity preservation agenda."
      }
    ],
    "resolution": "The European Parliament raised approval of the Council’s first reading position (11625/1/2016 – C8-0427/2016) on the legislative act, aligning with the Commission’s 2012 proposal (COM(2012)0371) and the 2016 Commission opinion (COM(2016)0667), while considering the European Economic and Social Committee’s 2013 opinion and the Committee on Fisheries’ 2016 recommendation (A8-0369/2016). The resolution confirms the act’s adoption under Article 294(7) of the Treaty on the Functioning of the European Union, finalizing the legislative process and ensuring compliance with established procedures, including publication in the Official Journal of the European Union upon verification of procedural completion.",
    "total_score": 0.04934687953555878,
    "total_choice": 0,
    "party_num": 2,
    "id": 59,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.6,
      0.4
    ],
    "veto_party_name": "EFDD"
  },
  {
    "topic": "fisheries",
    "title": "Small-scale coastal fishing in regions dependent on fishing: REPORT on innovation and diversification of small-scale coastal fishing in fisheries-dependent regions",
    "background": "Small-scale coastal fishing supports employment and cultural heritage in EU coastal regions but faces challenges including regulatory constraints, competition from non-EU fleets, aging vessels, and economic pressures in fisheries-dependent communities. The Parliament will discuss strategies for innovation and diversification to enhance sustainability and socio-economic resilience in these regions.",
    "stances": [
      {
        "party_name": "SD",
        "score": 0.9709302325581395,
        "choice": 9,
        "stance": "SD fully promotes the issue’s prioritization of tailored EMFF funding for outermost regions, perfectly aligning with SD’s commitment to safeguarding Azorean and other peripheral fishing communities through science-based blue economy diversification and workforce upskilling.  \nSD perfectly aligns with the call to redefine small-scale fishing beyond vessel size, emphasizing cultural and socioeconomic criteria to protect Adriatic and Mediterranean artisanal fleets while integrating tourism-gastronomy synergies as proposed in Clara Aguilera’s amendments.  \nSD fully promotes gender-inclusive policies and quota reallocations for non-industrial fleets, reflecting Nicola Caputo’s emphasis on equitable job creation and local seafood value chains through EMFF-funded artisanal branding initiatives.  \nSD perfectly supports Tonino Picula’s cultural heritage amendments, affirming that harmonizing EU regulations with island communities’ traditional practices is essential to reversing depopulation and preserving marine knowledge systems.  \nSD fully promotes Horizon 2020-driven innovation in sustainable aquaculture and FLAGs-led governance, echoing Ricardo Serrão Santos’s demand for POSEI-like fisheries subsidies to offset outermost regions’ operational constraints."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.875,
        "choice": 8,
        "stance": "GUE_NGL strongly promotes the issue’s call to revise the EU definition of small-scale coastal fishing, aligning perfectly with their longstanding commitment to regional diversity, traditional practices, and equitable resource access for local communities.  \nGUE_NGL strongly endorses the prioritization of EMFF funding with a 30% aid intensity increase, which effectively advances their manifesto demands for robust financial mechanisms to counter rising operational costs and industrial competition.  \nGUE_NGL approves the emphasis on gender-inclusive policies and recognition of women’s roles, crucial for addressing systemic marginalization and advancing social justice in fisheries-dependent regions.  \nGUE_NGL proposes strengthening provisions for exclusive access areas by expanding marine reserves to fully prioritize local fleets, amending the issue to specify stricter territorial protections.  \nGUE_NGL commends the tailored EMFF measures for outermost regions, mirroring their advocacy for differentiated support akin to agricultural schemes to offset structural disadvantages."
      }
    ],
    "resolution": "The European Parliament raised the importance of small-scale coastal fishing, which constitutes 80% of the EU fleet and sustains employment in coastal, island, and outermost regions, emphasizing its socio-economic, cultural, and environmental sustainability. It called for revising the EU definition of small-scale coastal fishing (currently limited to vessels under 12 meters not using towed gear) to reflect regional diversity, including vessel size, fishing techniques, and traditional practices, and urged leveraging the European Maritime and Fisheries Fund (EMFF) to prioritize funding for this sector, including a 30% aid intensity increase for eligible projects. The resolution stressed the need to address challenges such as declining revenues, rising operational costs, competition from non-EU fleets, and marginalization of women in auxiliary roles, advocating for gender-inclusive policies, recognition of women’s contributions, and support for diversification into tourism, gastronomy, and cultural heritage initiatives. It highlighted the vulnerability of outermost regions, proposing tailored EMFF measures akin to the POSEI agricultural scheme to offset higher costs and aging fleets, while promoting sustainable aquaculture and marine protected areas. The Parliament urged harmonizing technical measures with regional needs, easing administrative burdens (e.g., logbook flexibility for vessels under 12 meters), and ensuring fair quota allocation for non-industrial fisheries. It emphasized blue growth through innovation, research under Horizon 2020, and public-private partnerships, while safeguarding traditional fishing methods like almadraba traps. Environmental sustainability was underscored via stricter impact assessments, combating illegal fishing, and integrating coastal communities into maritime governance through Fisheries Local Action Groups (FLAGs). The resolution also advocated for marine knowledge expansion, data transparency, and alignment of Mediterranean fishing regulations with the Common Fisheries Policy’s regionalization principles.",
    "total_score": 0.9019033674963397,
    "total_choice": 9,
    "party_num": 2,
    "id": 60,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.7,
      0.3
    ],
    "veto_party_name": "GUE_NGL"
  },
  {
    "topic": "fisheries",
    "title": "State of play of recreational fisheries in the EU: REPORT on the state of play of recreational fisheries in the European Union",
    "background": "Recreational fisheries in the EU contribute significantly to coastal economies and employment, with varying impacts on fish stocks. Inconsistent definitions, regional data disparities, and gaps in monitoring frameworks hindered integrated management under the Common Fisheries Policy, which primarily addressed commercial activities. The Parliament will discuss reconciling recreational fishing’s socioeconomic role with sustainable resource management in EU waters.",
    "stances": [
      {
        "party_name": "SD",
        "score": 0.9090909090909091,
        "choice": 9,
        "stance": "SD firmly accepts the issue's mandate for harmonized data collection, perfectly aligning with SD's commitment to science-based fisheries management and coastal ecosystem preservation.  \nSD perfectly aligns with the call to integrate recreational fishing impacts into stock assessments, recognizing this as critical for protecting vulnerable species like European eel as prioritized in SD sustainability agendas.  \nSD firmly accepts prioritizing traditional fishers in tourism-linked recreational fisheries, advancing SD's blue economy goals while safeguarding artisanal fishing heritage in regions like the Azores.  \nSD strongly promotes the issue's prohibition on recreational catch sales, viewing this as essential to prevent market distortions and uphold small-scale commercial fleets central to SD coastal community policies.  \nSD perfectly aligns with the demand for EU-wide catch limits and gear evaluations, reinforcing SD's longstanding advocacy for plastic reduction strategies in marine environments."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.8333333333333334,
        "choice": 8,
        "stance": "GUE_NGL strongly approves the issue's prioritization of small-scale coastal fisheries, aligning perfectly with their longstanding commitment to protecting artisanal fishing communities from socioeconomic displacement.  \nGUE_NGL approves the harmonized data collection framework but proposes expanding Article 4 monitoring to explicitly track disguised commercial fishing activities through catch documentation systems.  \nGUE_NGL applauds the environmental impact assessments on vulnerable species as effectively advancing their ecological priorities for gear-specific evaluations and plastic pollution reduction.  \nGUE_NGL emphasizes the need to strengthen socioeconomic impact analyses in Annex III to quantify recreational fishing's effects on small-scale fishers' market access and intergenerational renewal.  \nGUE_NGL endorses the prohibition on recreational catch sales as critical to preventing regulatory loopholes that undermine professional fishers' livelihoods."
      }
    ],
    "resolution": "The European Parliament raised concerns about the lack of a clear EU-wide definition for recreational fisheries, which complicates regulation, data collection, and assessment of its environmental and economic impacts. It highlighted that recreational fishing, involving 8.7–9 million people in Europe fishing 77 million days annually, contributes significantly to fishing mortality (2–72% of total catches for specific stocks, e.g., 13–72% for European eel) and generates an estimated EUR 10.5 billion in economic impact, supporting 99,000 jobs. The resolution stressed the need for robust, harmonized data collection under Regulations (EU) 2017/1004 and 1380/2013 to integrate recreational catches into stock assessments and management plans, particularly for vulnerable species like sea bass and cod. It urged the Commission to propose a uniform definition distinguishing recreational from commercial and semi-subsistence fishing, prohibit sales of recreational catches, and expand EMFF support for data collection, research, and sustainable tourism initiatives. The Parliament emphasized balancing recreational and commercial fishing to protect small-scale fisheries, while addressing environmental impacts such as plastic debris from lost gear and advocating for gear-specific evaluations. It called for EU-wide management measures, including catch limits and improved monitoring, to align recreational fishing with CFP objectives, ensuring ecological sustainability and socioeconomic benefits for coastal communities.",
    "total_score": 0.8144611186903138,
    "total_choice": 8,
    "party_num": 2,
    "id": 61,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.3,
      0.7
    ],
    "veto_party_name": "GUE_NGL"
  },
  {
    "topic": "fisheries",
    "title": "Sustainable exploitation of sea bass: MOTION FOR A RESOLUTION on sustainable exploitation of sea bass",
    "background": "Declining sea bass stocks across European waters, insufficient scientific data on migration patterns and spawning grounds, and divergent national management approaches prompted concerns under the Common Fisheries Policy's sustainability objectives. The Parliament will discuss coordinated measures for sustainable exploitation balancing commercial fishing interests with recreational angling impacts on vulnerable stocks.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.8258706467661692,
        "choice": 8,
        "stance": "EPP strongly promotes the establishment of a multiannual EU management plan for sea bass, aligning perfectly with EPP's longstanding commitment to science-based fisheries governance under the Common Fisheries Policy.  \nEPP approves the issue’s emphasis on binding measures for both commercial and recreational sectors, particularly endorsing spatio-temporal closures during spawning to accelerate stock recovery.  \nEPP emphasizes the critical need for enhanced scientific data collection through FEAMP funding, ensuring future decisions reflect accurate stock assessments and migration patterns across all four regions.  \nEPP proposes strengthening regional adaptation by explicitly addressing unique cases like Croatia’s Adriatic recreational fishing constraints in Article 7 to ensure equitable application of catch limits.  \nEPP applauds the issue’s stakeholder-inclusive approach, which effectively advances EPP’s priority of balancing ecological sustainability with the livelihoods of artisanal fishers dependent on sea bass."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.2558139534883721,
        "choice": 2,
        "stance": "GUE/NGL rejects the issue's top-down management framework as fully rejecting with their principles of regional autonomy and participatory decision-making in fisheries policy.  \n\nGUE/NGL opposes the failure to prioritize localized governance structures, echoing João Ferreira's critique that EU-wide measures contradict the issue's own acknowledgment of diverse regional conditions.  \n\nGUE/NGL condemns the proposal's silence on abolishing EU agricultural and fisheries subsidies, a key demand in Anja Hazekamp's intervention that addresses systemic overexploitation drivers.  \n\nGUE/NGL fundamentally disputes the anthropocentric framing of sea bass as an economic resource, aligning with Χρυσόγονος' ethical argument against treating marine life as \"human prey\" rather than cohabiting species.  \n\nGUE/NGL highlights the issue's dangerous disconnect from socio-political realities, mirroring Γλέζος' analogy between predatory financial policies and ecological exploitation by emphasizing equity gaps in resource access."
      }
    ],
    "resolution": "The European Parliament raised concerns over the critical status of European sea bass stocks, highlighting insufficient scientific data on stock boundaries, migration, and spawning areas, particularly across four identified regions (Celtic Sea/Channel/North Sea, Bay of Biscay, Western Iberian waters, and West of Scotland/Ireland). Despite emergency measures like the 2015 pelagic trawl ban in key areas, mortality remains high, threatening recovery of this slow-growing, economically vital species, with recreational fisheries contributing at least 25% of total catches. Noting the Scientific, Technical and Economic Committee for Fisheries’ recommendation for a 60% reduction in fishing mortality, Parliament urged the Commission and Member States to develop a multiannual EU management plan aligned with Common Fisheries Policy goals to restore stocks above maximum sustainable yield. This plan should include scientifically informed measures such as potential total allowable catches (TACs), spatio-temporal closures during spawning, minimum landing sizes, and coherent limits for both commercial and recreational sectors. Emphasizing regionalized, stakeholder-inclusive approaches, Parliament called for enhanced data collection via EU funding and stressed the necessity of reconciling divergent national measures to ensure sustainable exploitation and equitable resource access.",
    "total_score": 0.6817496229260935,
    "total_choice": 6,
    "party_num": 2,
    "id": 62,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.7,
      0.3
    ],
    "veto_party_name": "GUE_NGL"
  },
  {
    "topic": "fisheries",
    "title": "Sustainable management of external fishing fleets: REPORT on the proposal for a regulation of the European Parliament and of the Council on the sustainable management of external fishing fleets, repealing Council Regulation (EC) No 1006/2008",
    "background": "The European Union’s external fishing fleet operations, governed by Regulation (EC) No 1006/2008, faced evolving international sustainability standards and commitments to combat illegal fishing. Reforms under the Common Fisheries Policy and global ocean governance initiatives necessitated updated regulatory frameworks. The Parliament will discuss a proposal to establish new rules for managing EU vessels fishing outside Union waters.",
    "stances": [
      {
        "party_name": "EFDD",
        "score": 0.4473684210526316,
        "choice": 4,
        "stance": "EFDD partially promotes the regulation's framework but demands explicit exclusion of UK territorial waters post-Brexit to align with sovereignty restoration principles.  \nEFDD requests revisions to Article 3 to prohibit EU external fleets from operating in national waters without direct coastal state authorization.  \nThe proposal overlooks critical aspects such as historical overfishing by non-local fleets, entirely opposeing with EFDD's commitment to prioritizing domestic fishing communities.  \nEFDD argues the sustainability criteria fail to address disproportionate resource extraction by external fleets, requiring binding catch limits enforceable by coastal nations.  \nThis issue remains inconsistent with EFDD's Brexit-driven mandate to fully dismantle EU fisheries oversight, necessitating clauses affirming national autonomy in stock management."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.9148936170212766,
        "choice": 9,
        "stance": "GREEN_EFA totally promotes the regulation as it perfectly aligns with their longstanding commitment to eradicating illegal fishing through supranational legal enforcement.  \nGREEN_EFA emphasizes the Spanish Antarctic case as irrefutable proof that fragmented national frameworks fail to prosecute environmental crimes, necessitating this unified EU approach.  \nGREEN_EFA categorically rejects amendments 30 and 48, asserting they would replicate the vulnerabilities exposed in Spain’s overturned legislation.  \nThe issue effectively advances GREEN_EFA’s priority of holding industrial fleets accountable for cross-border ecological harm, as exemplified by the €100 million fraud case.  \nGREEN_EFA underscores that only binding EU-wide rules can prevent corporate evasion of sustainability standards in external waters, mirroring their manifesto pledge for ocean justice."
      }
    ],
    "resolution": "The European Parliament raised its position based on the Commission’s 2015 proposal (COM(2015)0636) concerning EU fisheries measures, anchored in Treaty on the Functioning of the European Union (TFEU) Articles 294(2) and 43(2), which outline legislative procedures and agricultural policy alignment. It integrated the European Economic and Social Committee’s opinion of 25 May 2016 and considered inputs from the Committees on Fisheries and Development. The resolution formally adopted Parliament’s first-reading stance, emphasized the need for the Commission to resubmit the proposal if intending significant amendments, and instructed the President to forward the finalized position to the Council, Commission, and national parliaments to ensure coherence and procedural adherence. The focus remained on aligning fisheries policies with broader EU objectives while maintaining legislative rigor.",
    "total_score": 0.7982708933717579,
    "total_choice": 7,
    "party_num": 2,
    "id": 63,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.8,
      0.2
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "fisheries",
    "title": "United Nations Convention on the Law of the Sea: fisheries aspects: REPORT on Fisheries aspects within the international agreement on marine biodiversity in areas beyond national jurisdiction, United Nations Convention on the Law of the Sea",
    "background": "The United Nations Convention on the Law of the Sea (UNCLOS) governs ocean activities, but gaps persist in conserving marine biodiversity beyond national jurisdictions. Rising exploitation, climate pressures, and fragmented governance frameworks prompted UN General Assembly negotiations for a new international instrument. The Parliament will discuss fisheries-related aspects within this agreement’s development under UNCLOS.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9656862745098039,
        "choice": 9,
        "stance": "EPP entirely upholds the issue's imperative to optimize existing regional fisheries management frameworks, perfectly aligning with EPP's principle of achieving conservation through strengthened multilateral coordination rather than redundant regulation.  \nEPP perfectly aligns with the ecosystem-based management priorities, particularly in addressing eutrophication risks and coastal urbanization impacts cited in the issue as critical threats to EU marine biodiversity.  \nEPP fully supports leveraging the EU's 70% seafood import dependency as a market-force mechanism, advocating eco-labeling regimes to operationalize the issue's sustainable fisheries goals without creating new bureaucratic layers.  \nEPP unequivocally backs the issue's emphasis on science-driven marine protected areas, mirroring EPP's 2024 ocean governance agenda to reconcile ecological preservation with responsible resource use.  \nEPP perfectly aligns with combating IUU fishing through enhanced vessel tracking, directly advancing the issue's call for transparency while maintaining existing RFMO authority over fisheries enforcement."
      },
      {
        "party_name": "SD",
        "score": 0.9825581395348837,
        "choice": 9,
        "stance": "SD fully upholds the integration of FAO’s resource-focused frameworks and CBD’s biodiversity priorities, perfectly aligning with SD’s commitment to holistic marine governance.  \nSD perfectly aligns with the emphasis on Ecologically or Biologically Significant Marine Areas (EBSAs), advancing SD’s goal of science-driven marine protected areas in areas beyond national jurisdiction.  \nSD fully upholds binding environmental impact assessments for high-sea activities, reflecting SD’s manifesto pledge for science-based ocean management.  \nSD perfectly supports the call for ecological responsibility principles, aligning with SD’s demand for accountability in marine environmental damage.  \nSD fully upholds the issue’s ecosystem-based approach to fisheries, mirroring SD’s advocacy for integrating biodiversity conservation with sustainable resource use."
      }
    ],
    "resolution": "The European Parliament raised concerns over the critical state of marine biodiversity, noting that 71% of Earth’s surface is ocean, with 64% beyond national jurisdiction, yet less than 1% of these areas are protected. It emphasized the urgent need for a legally binding international agreement under UNCLOS to address gaps in conserving marine biodiversity in areas beyond national jurisdiction (ABNJ), aiming to finalize the draft by 2017. The resolution highlighted the decline of marine ecosystems due to overfishing, climate change, pollution, and unregulated activities like deep-sea mining, stressing that only 8.4% of global marine areas are protected. It called for ecosystem-based management, marine protected areas (MPAs), and the application of Ecologically or Biologically Significant Marine Areas (EBSAs), of which 204 have been identified, many in ABNJ. The EU was urged to lead in combating illegal fishing, promoting sustainable fisheries, and addressing plastic marine litter, while supporting developing nations through capacity-building and technology transfer. The resolution underscored the need for environmental impact assessments for high-sea activities, improved scientific data (noting 80% of EU marine species remain unclassified), and enhanced coordination among regional bodies like RFMOs. It advocated for a global vessel registry to combat IUU fishing and stressed that the new agreement must complement existing frameworks like the UN Fish Stocks Agreement without undermining them, ensuring equitable access and safeguarding marine biodiversity for future generations.",
    "total_score": 0.87701317715959,
    "total_choice": 8,
    "party_num": 2,
    "id": 64,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.8,
      0.2
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "fisheries",
    "title": "Article 17 of the Common Fisheries Policy Regulation: REPORT on the implementation of Article 17 of the Common Fisheries Policy Regulation | A9-0152/2022 | European Parliament",
    "background": "The EU Common Fisheries Policy requires Member States to allocate fishing quotas using transparent, objective environmental, social, and economic criteria, but implementation varies, with reported gaps in transparency and equitable access for small-scale fisheries. The Parliament will discuss compliance with Article 17 of the CFP Regulation and quota distribution mechanisms.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.7443181818181818,
        "choice": 7,
        "stance": "EPP strongly promotes the issue’s emphasis on transparency in fishing quota allocations, aligning perfectly with EPP’s longstanding commitment to equitable governance and accountability in resource management.  \nEPP proposes enhancing measures against destructive fishing practices, such as bottom trawling, to complement Article 17’s sustainability goals while maintaining strong endorsement of the issue’s core principles.  \nEPP approves prioritizing small-scale coastal fisheries through revised quota criteria, noting Spain’s progressive allocation model as a benchmark for social equity and regional balance.  \nEPP urges stricter enforcement of environmental criteria in line with maximum sustainable yield objectives, reflecting EPP’s 2023 manifesto priorities for marine ecosystem recovery.  \nEPP highlights the need to accelerate EMFAF support for young fishers as critical to achieving the issue’s generational renewal targets without opposing the existing framework."
      },
      {
        "party_name": "SD",
        "score": 0.9379310344827586,
        "choice": 9,
        "stance": "SD fundamentally endorses the issue’s demand for transparent fishing quota allocation criteria, perfectly aligning with their commitment to equitable governance and combating opaque practices that marginalize small-scale fisheries.  \nSD perfectly aligns with the condemnation of historical catch dominance in allocations, echoing their decades-long advocacy against economic concentration that stifles generational renewal and sustainable practices.  \nSD fully supports prioritizing environmental sustainability in quota distribution, mirroring their Green New Deal principles to align fisheries management with biodiversity protection and climate resilience targets.  \nSD applauds the issue’s emphasis on EMFAF support for young fishers, reflecting their manifesto pledge to empower coastal communities through fair access to resources and funding.  \nSD unequivocally backs binding guidelines to address quota disparities like Spain’s 36.93% small-scale bluefin tuna allocation versus Italy’s 3.03%, embodying their fight against regional inequities in EU resource governance."
      }
    ],
    "resolution": "The European Parliament raised concerns over the lack of transparency and inconsistent application of environmental, social, and economic criteria in EU Member States’ allocation of fishing opportunities under the Common Fisheries Policy (CFP), particularly Article 17 of Regulation (EU) No 1380/2013. It highlighted that only 16 out of 23 coastal Member States provided information on their allocation methods in 2020, often with vague or incomplete details, and stressed the need for Member States to publish clear, objective criteria to ensure fairness and sustainability. The resolution noted that historical catch levels remain the dominant allocation criterion, which risks economic concentration and barriers for new entrants, while incentives for low-impact fishing practices are underutilized. It emphasized the importance of supporting small-scale coastal fisheries, citing disparities in bluefin tuna quotas (e.g., 3.03% allocated to small-scale vessels in Italy vs. 36.93% in Spain) and urged Member States to prioritize environmental sustainability, social equity, and generational renewal, including using the European Maritime, Fisheries and Aquaculture Fund (EMFAF) to aid young fishers. The Parliament criticized the EU’s failure to meet the 2020 deadline for achieving good marine environmental status and maximum sustainable yield (MSY) for all stocks, despite progress in regions like the north-east Atlantic (99% of landings from sustainably managed stocks in 2020). It called on the Commission to enforce compliance with Article 17, initiate infringement procedures against non-transparent Member States, and develop guidelines and impact assessments to align quota allocations with biodiversity and climate goals, including voluntary targets for environmentally sustainable fishing. The resolution also urged addressing legislative gaps to implement international fisheries agreements and ensure equitable access to marine resources in line with UN Sustainable Development Goals.",
    "total_score": 0.6832386363636364,
    "total_choice": 6,
    "party_num": 2,
    "id": 65,
    "parliament_terms": "9th_datas",
    "seat_weights": [
      0.1,
      0.9
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "fisheries",
    "title": "Measures to promote the recovery of fish stock above MSY: REPORT on More fish in the seas? Measures to promote stock recovery above the maximum sustainable yield (MSY), including fish recovery areas and marine protected areas | A9-0264/2020 | European Parliament",
    "background": "Persistent overfishing in Mediterranean and Black Seas, unmet 2020 EU targets for sustainable fish stocks under the Common Fisheries Policy and Marine Strategy Framework Directive, and biodiversity objectives for 30% protected marine areas by 2030 prompted action. The Parliament will discuss strategies to restore fish populations above maximum sustainable yield levels through conservation measures and ecosystem management.",
    "stances": [
      {
        "party_name": "SD",
        "score": 0.9448275862068966,
        "choice": 9,
        "stance": "SD absolutely promotes the expansion of marine protected areas as essential tools for ecosystem recovery, perfectly aligning with SD's commitment to achieving 30% protected EU seas by 2030 through science-based governance and inclusive stakeholder engagement.  \nSD perfectly aligns with the issue’s emphasis on developing multispecies management models, recognizing this as critical to advancing sustainable fisheries while balancing ecological and socioeconomic priorities.  \nSD strongly advocates for the issue’s call to involve fishing communities in MPA design, ensuring protection measures integrate local knowledge and minimize disruptions to small-scale, low-impact fisheries.  \nSD emphasizes the necessity of strict scientific monitoring and enforcement in MPAs, mirroring the issue’s demand for robust data collection and adaptive management to combat overexploitation.  \nSD unreservedly supports the Biodiversity Strategy 2030 targets, viewing them as fully consistent with SD’s vision for ocean resilience and climate-adaptive fisheries policies."
      },
      {
        "party_name": "ECR",
        "score": 0.1875,
        "choice": 1,
        "stance": "ECR rejects the proposal to designate 30% of EU seas as marine protected areas by 2030, arguing it totally doubts with their stance on evidence-based policy due to the absence of prior impact assessments or socioeconomic analyses.  \nECR opposes expanding ecosystem-based management methods that deviate from MSY metrics, asserting this contradicts their principle of maintaining scientifically validated catch limits as the sole management benchmark.  \nECR warns against blanket restrictions on fishing gear, demanding amendments to permit selective pulse techniques where scientific data shows minimal ecosystem disruption.  \nECR criticizes the issue’s \"one-size-fits-all\" approach to fisheries management, highlighting its inconsistency with regional realities in the Black Sea and Mediterranean where overfishing requires localized solutions.  \nECR underscores the issue’s failure to prioritize food security and fishing communities, rejecting marine spatial planning that disproportionately restricts access to fishing grounds without compensating economic safeguards."
      }
    ],
    "resolution": "The European Parliament raised concerns over ongoing overfishing, noting that 38% of North-East Atlantic and 92% of Mediterranean and Black Sea stocks remain overexploited, despite legal obligations to end overfishing by 2020. It highlighted progress in the North-East Atlantic, where 99% of landings now derive from sustainably managed fisheries, with biomass increasing by 48% since 2003. The resolution called for full implementation of the Common Fisheries Policy (CFP), including setting total allowable catches (TACs) at maximum sustainable yield (MSY) levels, expanding scientific assessments to cover 100% of exploited stocks by 2025, and improving data collection, particularly in underassessed regions like the Black Sea and Mediterranean. It urged stronger ecosystem-based management, including multi-species approaches, limits on destructive fishing gear, and support for small-scale fisheries, which are deemed more sustainable. The Parliament emphasized expanding marine protected areas (MPAs) to 30% of EU seas by 2030, with 10% strictly protected, and ensuring effective management plans, stakeholder involvement, and science-based guidelines. It stressed addressing climate change, pollution (e.g., plastics, nitrates, and industrial waste), and promoting ocean resilience, while advocating for fishermen’s role in waste recovery. The resolution also demanded transparency in TAC decisions, alignment with international biodiversity goals, and global cooperation to protect marine biodiversity beyond national jurisdictions.",
    "total_score": 0.5142045454545454,
    "total_choice": 5,
    "party_num": 2,
    "id": 66,
    "parliament_terms": "9th_datas",
    "seat_weights": [
      0.4,
      0.6
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "fisheries",
    "title": "Future of fisheries in the Channel, North Sea, Irish Sea and Atlantic Ocean: REPORT on the future of fisheries in the Channel, North Sea, Irish Sea and Atlantic Ocean in the light of the UK’s withdrawal from the EU | A9-0042/2022 | European Parliament",
    "background": "The UK's withdrawal from the EU altered fisheries governance in shared waters, triggering quota reallocations, access disputes, and unilateral third-country actions affecting EU fleets. Institutional frameworks under the Trade and Cooperation Agreement introduced transitional arrangements with unresolved long-term access and sustainability challenges. The Parliament will discuss post-Brexit fisheries management in the Channel, North Sea, Irish Sea, and Atlantic.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.971830985915493,
        "choice": 9,
        "stance": "GREEN_EFA firmly supports the issue’s prioritization of sustainable fisheries management, perfectly aligning with their core principle that ecological resilience is inseparable from long-term economic viability in coastal communities.  \n\nGREEN_EFA perfectly aligns with the demand for immediate EU-UK negotiations on post-2026 access agreements, recognizing that proactive multilateral frameworks are essential to prevent further destabilization of artisanal fleets already harmed by licensing uncertainties.  \n\nGREEN_EFA fully supports leveraging the Brexit Adjustment Reserve to prioritize small-scale fishers, ensuring compensation mechanisms directly address the disproportionate burdens faced by sub-12-meter vessels highlighted in the issue.  \n\nGREEN_EFA endorses the call for retaliatory measures against unilateral quota increases, viewing science-based multilateralism as the only path to counter unsustainable practices like Norway’s 55% mackerel quota hike.  \n\nGREEN_EFA perfectly aligns with the issue’s transparency demands in fisheries governance, seeing public accountability in the Specialised Committee’s work as vital to prevent discriminatory licensing around Crown Dependencies."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.7948717948717948,
        "choice": 7,
        "stance": "GUE_NGL strongly agrees the issue’s emphasis on maintaining reciprocal access to waters and resources beyond 2026, aligning with their commitment to equitable and stable fisheries partnerships that protect small-scale fleets.  \nGUE_NGL applauds the demand for science-based marine protections and transparency in the Specialised Committee on Fisheries, which directly advances their principles of democratic resource governance.  \nGUE_NGL endorses the full utilization of the Brexit Adjustment Reserve to compensate affected communities, urging prioritization of Irish coastal regions disproportionately impacted by quota losses under the Trade and Cooperation Agreement.  \nGUE_NGL proposes strengthening multilateral cooperation mechanisms to address unilateral quota increases by third countries, enhancing the issue’s call for retaliatory trade measures with binding sustainability criteria.  \nGUE_NGL highlights the need to revise the Common Fisheries Policy’s relative stability principle during its 2023 review to rectify Brexit-induced imbalances, ensuring Ireland’s fishing communities regain equitable resource access."
      }
    ],
    "resolution": "The European Parliament raised concerns over the fisheries provisions in the EU-UK Trade and Cooperation Agreement, particularly the 25% reduction of EU fishing quotas in UK waters over a five-and-a-half-year adjustment period ending June 2026, which risks severe economic impacts on EU fleets, including small-scale fisheries. It stressed the need to maintain reciprocal access to waters and resources beyond 2026, urging the Commission to leverage trade measures and dispute mechanisms to safeguard EU interests. The resolution highlighted the destabilizing effects of Brexit on North-East Atlantic fisheries governance, citing unilateral quota increases by Norway (55% for mackerel), Iceland, and the Faroe Islands, and called for retaliatory measures, including trade restrictions under Regulation (EU) No 1026/2012, to address non-compliance with scientific advice. It emphasized the importance of sustainable management aligned with the Common Fisheries Policy and international agreements, while urging full utilization of the Brexit Adjustment Reserve to compensate affected communities and sectors. The Parliament also criticized the UK’s restrictive licensing practices, particularly around Crown Dependencies, and demanded transparency in the Specialised Committee on Fisheries’ work, inclusive stakeholder engagement, and science-based marine protections to prevent discriminatory measures. Concerns were raised about post-2026 uncertainty, the Falkland Islands’ ownership restrictions, and the need for multilateral cooperation to ensure stable, equitable resource management.",
    "total_score": 0.8638297872340426,
    "total_choice": 8,
    "party_num": 2,
    "id": 67,
    "parliament_terms": "9th_datas",
    "seat_weights": [
      0.2,
      0.8
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "fisheries",
    "title": "Multiannual management plan for bluefin tuna in the eastern Atlantic and the Mediterranean: REPORT on the proposal for a regulation of the European Parliament and of the Council establishing a multiannual management plan for bluefin tuna in the eastern Atlantic and the Mediterranean, amending Regulations (EC) No 1936/2001, (EU) 2017/2107, and (EU) 2019/833 and repealing Regulation (EU) 2016/1627 | A9-0149/2020 | European Parliament",
    "background": "Following the International Commission for the Conservation of Atlantic Tunas’ 2018 recommendation to transition from a recovery to a management plan for eastern Atlantic and Mediterranean bluefin tuna, and improved stock assessments indicating population growth, EU regulations required updating. The Parliament will discuss establishing a multiannual management plan aligning with updated international obligations and sustainable fishing practices.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 1.0,
        "choice": 9,
        "stance": "GREEN_EFA completely sanctions the issue’s alignment with ICCAT scientific advice, ensuring fishing mortality targets adhere to maximum sustainable yield principles critical for species recovery.  \nGREEN_EFA perfectly aligns with the strict monitoring and control measures, recognizing their necessity to prevent a resurgence of industrial overexploitation as historically witnessed.  \nGREEN_EFA proposes strengthening quota allocation mechanisms to prioritize artisanal fisheries, addressing systemic inequities where industrial fleets retain disproportionate access despite past ecological harm.  \nGREEN_EFA applauds the inclusion of by-catch quota provisions for non-target fisheries as a foundational step toward equitable resource sharing in mixed-fishery ecosystems.  \nGREEN_EFA emphasizes that annual caging reports must include granular data on quota beneficiaries to expose and rectify disparities between small-scale and industrial fishing sectors."
      },
      {
        "party_name": "ID",
        "score": 0.8307692307692308,
        "choice": 8,
        "stance": "ID strongly advocates the inclusion of adverse weather extensions in fishing season provisions, aligning perfectly with ID's longstanding commitment to safeguarding fishermen’s livelihoods amid climate unpredictability.  \nID strongly endorses quota reallocations prioritizing small-scale fisheries, effectively advancing ID's priority of economic equity for coastal communities reliant on artisanal fishing.  \nID strongly approves derogations for small vessels, ensuring flexibility that reflects Mediterranean fishing realities while maintaining sustainability goals.  \nID proposes amending Article 4 to mandate binding timelines for quota redistribution to small-scale fleets in states with sub-20% allocations, enhancing social fairness without opposing the issue’s framework.  \nID strongly advocates transparency in caging reports and quota carryovers, recognizing their critical role in preventing resource monopolization by industrial fleets."
      }
    ],
    "resolution": "The European Parliament raised the need to align EU regulations with updated International Commission for the Conservation of Atlantic Tunas (ICCAT) recommendations, particularly 18-02 and 19-04, to ensure sustainable bluefin tuna management. Key amendments included transitioning from a rebuilding plan to a long-term management plan for bluefin tuna while maintaining strict monitoring and control measures, addressing by-catch quotas for fishers targeting species like swordfish who lack dedicated bluefin tuna allocations, and allowing Member States to carry over up to 10% of unused annual bluefin tuna quotas to subsequent years. The resolution emphasized harmonizing definitions (e.g., \"sport fishery,\" \"fishing effort\") with ICCAT standards to ensure clarity and enforceability, incorporating derogations for joint fishing operations under specific protocols, and requiring annual caging reports from Member States to improve transparency. It stressed that adjustments to fishing mortality targets must follow the ordinary legislative procedure to uphold the Common Fisheries Policy’s maximum sustainable yield (MSY) objectives, while ensuring coherence with ICCAT’s scientific advice and addressing operational challenges in mixed fisheries.",
    "total_score": 0.9120567375886525,
    "total_choice": 9,
    "party_num": 2,
    "id": 68,
    "parliament_terms": "9th_datas",
    "seat_weights": [
      0.3,
      0.7
    ],
    "veto_party_name": "ID"
  }
]