[
  {
    "topic": "gender equality",
    "title": "Female genital mutilation: JOINT MOTION FOR A RESOLUTION on ending female genital mutilation",
    "background": "Persistent global prevalence of female genital mutilation (FGM), recognized internationally as a human rights violation and public health concern, prompted prior EU institutional actions, including resolutions and cooperation frameworks. The Parliament will discuss addressing FGM as a human rights and gender-based violence issue within EU internal and external policy contexts.",
    "stances": [
      {
        "party_name": "SD",
        "score": 0.7958115183246073,
        "choice": 7,
        "stance": "SD strongly upholds the issue’s emphasis on criminalizing FGM as gender-based violence, aligning perfectly with SD’s longstanding commitment to eradicating violence against women and protecting child rights.  \nSD applauds the focus on asylum protections for FGM survivors, urging Member States to adopt consistent interpretations of refugee status to prevent fragmented approaches.  \nSD emphasizes the critical need for EU funding to support civil society programs providing medical care and psychological support to mutilation survivors across Europe.  \nSD proposes enhancing training for healthcare workers and border officials to identify at-risk girls, ensuring early intervention aligns with the issue’s prevention goals.  \nSD strongly endorses cross-border collaboration with UN agencies and local leaders to eradicate FGM, mirroring their 2023 manifesto priorities on global gender justice."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.5882352941176471,
        "choice": 5,
        "stance": "GUE_NGL supports the issue’s condemnation of FGM as gender-based violence and its alignment with UN-led global initiatives, reflecting their commitment to women’s rights and bodily autonomy.  \n\nGUE_NGL advises amending Article 4 to explicitly integrate sexual and reproductive health rights into community education programs, ensuring women’s agency over their bodies is central to anti-FGM efforts.  \n\nGUE_NGL suggests revising clauses on cultural sensitivity to focus on pan-societal gender equality measures, avoiding stigmatization of migrant or minority groups while addressing systemic discrimination.  \n\nGUE_NGL underscores the necessity for the European Commission to propose a binding EU-wide strategy against violence against women, as outlined in the issue, to harmonize cross-border protections and funding.  \n\nGUE_NGL emphasizes collaboration with grassroots women’s organizations in designing targeted prevention programs, ensuring marginalized voices guide policy implementation."
      }
    ],
    "resolution": "The European Parliament raised concerns about female genital mutilation (FGM) as a severe human rights violation affecting 140 million women and girls globally, with 3 million girls at risk annually, and highlighted that at least 500,000 women and girls in Europe live with FGM, while 180,000 are annually at risk—figures likely underestimated due to undocumented migrants. It condemned FGM as a form of gender-based violence and child abuse, emphasizing irreversible physical and mental health consequences, including pain, infections, childbirth complications, and death. The resolution urged the UN General Assembly to adopt a binding resolution to end FGM globally, aligning with the African Union’s call, and stressed the need for EU Member States to ratify and enforce comprehensive legislation criminalizing FGM, ensuring prevention, protection, and prosecution measures. It called for increased funding to support civil society programs addressing vulnerable girls, integration of anti-FGM measures into EU development policies via the 2010 Gender Action Plan, and collaboration with UN agencies like UNICEF, WHO, and UNESCO to mainstream FGM eradication efforts. The Parliament emphasized education, community mobilization, and engagement with religious and local leaders to eliminate harmful practices, while urging the Commission to prioritize ending violence against women through targeted funding and cross-border initiatives.",
    "total_score": 0.7480106100795756,
    "total_choice": 7,
    "party_num": 2,
    "id": 0,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.8,
      0.2
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "gender equality",
    "title": "A 2020 perspective for women in Turkey: REPORT on a 2020 Perspective for Women in Turkey",
    "background": "Turkey, an EU candidate since 2004, faced persistent gender inequality including violence against women, honor killings, low female labor participation, and regional disparities despite international commitments under CEDAW and Council of Europe conventions. The Parliament will discuss Turkey’s alignment with EU gender equality standards during accession processes.",
    "stances": [
      {
        "party_name": "EFD",
        "score": 0.2903225806451613,
        "choice": 2,
        "stance": "EFD rejects the issue’s EU-centric integration demands as incompatible with national sovereignty, a core EFD principle opposing supranational overreach.  \nEFD opposes fundamentally the criminalization of marital rape, deeming it an invasive measure that undermines familial autonomy and cultural norms.  \nThe proposal overlooks critical aspects such as Turkey’s right to self-determination in social policy, inconsistent with EFD’s anti-interventionist ethos.  \nEFD contests gender quotas in politics, arguing they artificially distort democratic representation contrary to merit-based governance.  \nThis issue conflicts with EFD’s prioritization of economic pragmatism over “ideological” gender parity targets in labor reforms."
      },
      {
        "party_name": "ALDE",
        "score": 0.927710843373494,
        "choice": 9,
        "stance": "ALDE absolutely sanctions the issue’s emphasis on eradicating domestic violence, perfectly aligning with ALDE’s commitment to advancing gender equality through robust legal frameworks and enforcement mechanisms.  \nALDE perfectly aligns with the demand to expand women’s shelters to Council of Europe standards, underscoring the urgency of protecting vulnerable populations as a cornerstone of EU values.  \nALDE applauds Turkey’s institutional progress, including the Ministry of Family and Social Policies, as vital steps toward fulfilling EU accession criteria on social policy and fundamental rights.  \nALDE highlights the media’s pivotal role in shifting patriarchal norms, urging sustained partnerships with civil society to amplify awareness campaigns against honor killings and forced marriages.  \nALDE absolutely sanctions closing gender gaps in education and labor, stressing the need for affordable childcare and equal pay to meet EU 2020 targets and transform economic participation."
      }
    ],
    "resolution": "The European Parliament raised concerns over Turkey’s insufficient progress in advancing women’s rights and gender equality, urging comprehensive reforms to align with international obligations, including CEDAW and the Istanbul Convention. It highlighted that 39% of Turkish women face physical violence, stressing the need for stricter enforcement of laws against honor killings, domestic violence (including criminalizing marital rape), and forced marriages, alongside establishing specialized prosecutors’ bureaus and increasing shelters—currently only 65 for 70 million people—to meet Council of Europe standards (one per municipality with ≥50,000 inhabitants). The resolution called for closing gender gaps in education, noting persistent disparities in secondary enrollment and insufficient childcare, and urged reforms to boost female labor participation (currently below EU 2020 targets), including paid parental leave, equal pay, and affordable childcare. It welcomed Turkey’s 93% child registration rate but emphasized better gender-disaggregated data collection. Political underrepresentation was critiqued, with women holding 14.3% of parliamentary seats (up from 9.1% in 2007), urging electoral quotas. The EU demanded Turkey integrate gender equality into its new constitution, align with the EU acquis (notably Chapters 19 and 23 on social policy and fundamental rights), and utilize the Positive Agenda to advance reforms. Regional disparities, particularly affecting Kurdish, immigrant, and rural women, were underscored, alongside calls for awareness campaigns, media responsibility, and civil society engagement. The resolution linked Turkey’s EU accession progress to tangible improvements in women’s rights, stressing mental health support, vocational training, and economic empowerment to transform patriarchal norms.",
    "total_score": 0.7845744680851063,
    "total_choice": 7,
    "party_num": 2,
    "id": 1,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.2,
      0.8
    ],
    "veto_party_name": "EFD"
  },
  {
    "topic": "gender equality",
    "title": "Equality between women and men in the European Union - 2011: REPORT on equality between women and men in the European Union - 2011",
    "background": "Persistent gender inequalities in EU labor markets, political representation, and social protections, alongside existing treaties and directives promoting equality, led to scrutiny of progress under Europe 2020 targets. The Parliament will discuss measures to address disparities in economic participation, leadership roles, and gender-based violence across member states.",
    "stances": [
      {
        "party_name": "EFD",
        "score": 0.0,
        "choice": 0,
        "stance": "EFD rejects the imposition of gender quotas in corporate leadership as fundamentally undermining meritocratic principles, directly opposing Resolution Article 3's 30-40% binding targets.  \nEFD opposes the issue's promotion of same-sex family recognition, declaring it incompatible with their definition of traditional family structures as stated in Clause 7's mutual recognition proposals.  \nEFD fundamentally disputes with the issue's reproductive rights agenda, denouncing abortion access as contradictory to their national constituency's values per Section 4's healthcare provisions.  \nEFD rejects pay gap reduction mandates as regulatory overreach, dismissing Clause 2's 10% target as antithetical to free-market employment practices.  \nEFD opposes gender-responsive budgeting requirements, arguing they impose ideological frameworks on fiscal policy contrary to Clause 9's mainstreaming directives."
      },
      {
        "party_name": "SD",
        "score": 0.9322916666666666,
        "choice": 9,
        "stance": "SD fundamentally sanctions binding quotas for corporate leadership as essential to dismantle systemic barriers, perfectly aligning with SD's commitment to transformative gender parity in economic decision-making.  \nSD perfectly aligns with the issue's demand for EU-wide gender-responsive budgeting to counteract austerity's disproportionate impact on female-dominated public sectors like healthcare and education.  \nSD fundamentally sanctions intersectional approaches to combat multiple discrimination against Roma, migrant, and disabled women, reflecting SD's comprehensive equality framework.  \nSD unequivocally supports operationalizing the Gender-Based Violence Observatory and declaring 2015 the \"Year to End Violence Against Women,\" mirroring SD's prioritization of structural anti-violence mechanisms.  \nSD perfectly aligns with pension system reforms recognizing unpaid care work, directly advancing SD's manifesto goals for economic justice across women's lifespans."
      }
    ],
    "resolution": "The European Parliament raised concerns about persistent gender inequalities exacerbated by economic crises, emphasizing the EU’s commitment to gender equality under TEU, TFEU, and international frameworks. It highlighted disparities in labor market participation, noting women’s 17.5% average pay gap, underrepresentation in leadership (12% executives, 3% chairs in major companies), and disproportionate impact of austerity on female-dominated public sectors like healthcare and education. The resolution called for measures to achieve a 75% female employment target by 2020, reduce the pay gap by 10% per member state, and implement binding quotas to increase women’s corporate leadership to 30% by 2015 and 40% by 2020. It urged investment in childcare, elderly care, and social services to reconcile work-life balance, alongside recognizing unpaid care work in pension systems. Combating gender-based violence—including domestic abuse, trafficking, and harmful practices—was prioritized, with demands for an EU-wide strategy, a 2015 \"Year to End Violence Against Women,\" and operationalizing a Gender-Based Violence Observatory. The resolution stressed intersectional discrimination against marginalized groups (Roma, migrants, disabled women) and advocated for inclusive policies, sexual/reproductive rights, and equitable access to healthcare, including addressing HIV/AIDS (45% of new infections among women aged 15-24). It called for gender-responsive budgeting, parity in EU institutions, and mainstreaming gender equality in external policies, particularly post-Arab Spring and in conflict zones. Legislative actions included extending paid maternity leave to 20 weeks, mutual recognition of same-sex families, and reforms to ensure fair taxation and social security for single-person households, 60% of which are women. The Parliament also urged data collection, gender-disaggregated analysis, and adherence to international commitments like the Millennium Development Goals, particularly maternal health.",
    "total_score": 0.47877984084880637,
    "total_choice": 4,
    "party_num": 2,
    "id": 2,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.8,
      0.2
    ],
    "veto_party_name": "EFD"
  },
  {
    "topic": "gender equality",
    "title": "Daphne programme: REPORT on the Daphne programme: achievements and future prospects",
    "background": "The Daphne Programme, established in 1997 to combat violence against women, children, and youth, operated through successive EU-funded phases addressing emerging challenges like online violence. With its 2014-2020 integration into the Rights and Citizenship Programme proposed, concerns arose regarding budgetary continuity and thematic focus. The Parliament will discuss the programme’s effectiveness and structural future within EU policy frameworks.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.3157894736842105,
        "choice": 3,
        "stance": "GREEN_EFA conditionally upholds the issue’s continuity goals but demands amendment of Section 2(b) to explicitly name systemic gender discrimination as a root cause of violence, aligning with Raül Romeva’s emphasis on structural inequality.  \n\nThis firmly rejects with GREEN_EFA’s intersectional approach by inadequately addressing how crisis-driven austerity measures exacerbate vulnerabilities for marginalized women, requiring binding budget protection clauses.  \n\nGREEN_EFA requests revising Article 7 to prohibit ideological interpretations of anti-violence measures that risk stigmatizing victims, reflecting concerns about debate misuse harming women’s agency.  \n\nThe proposal overlooks critical aspects such as mandating gender-impact assessments for all EU economic policies, contradicting GREEN_EFA’s linkage between fiscal justice and violence prevention.  \n\nGREEN_EFA opposes the merged programme’s diluted monitoring framework, advocating standalone Daphne-specific indicators in Annex III to preserve visibility of gender-based violence outcomes."
      },
      {
        "party_name": "SD",
        "score": 0.9057591623036649,
        "choice": 9,
        "stance": "SD firmly endorses the issue’s insistence on preserving the Daphne programme’s distinct identity and funding, aligning perfectly with S&D’s commitment to combat gender-based violence through targeted EU action.  \nSD perfectly aligns with the call to prioritize small NGOs, as exemplified by successful projects like the 116000 Hotline for Missing Children, which advance S&D’s focus on grassroots empowerment and victim support.  \nSD fully supports expanding Daphne’s eligibility to candidate countries and new Member States, addressing underutilization through awareness campaigns that mirror S&D’s dedication to pan-European solidarity against violence.  \nSD perfectly affirms the issue’s emphasis on quantifying violence’s societal costs, reinforcing S&D’s evidence-based policymaking approach to secure adequate funding and policy prioritization.  \nSD firmly endorses retaining the Daphne name to maintain its visibility and legacy, reflecting S&D’s strategic focus on preserving proven frameworks for gender equality and child protection."
      }
    ],
    "resolution": "The European Parliament raised concerns about the integration of the Daphne III Programme—a successful EU initiative combating violence against women, children, and young people—into the 2014-2020 Rights and Citizenship Programme, stressing the need to retain its specific objectives, visibility, and funding levels. It highlighted Daphne’s role in addressing structural gender-based violence, including domestic abuse, sexual violence, trafficking, and harmful practices like female genital mutilation, while noting new challenges such as online violence and social exclusion exacerbating risks for marginalized groups like Roma women. The resolution emphasized the societal cost of violence, citing a Daphne project estimating annual EU costs of conjugal violence at €16 billion, and referenced studies indicating 20-25% of European women experience physical violence and 26% of children face physical abuse. Parliament urged maintaining dedicated funding within the new programme, simplifying grant procedures for NGOs, expanding eligibility to candidate countries, improving data collection on violence prevalence, and prioritizing prevention, education, and policy changes. It called for targeted actions to address emerging forms of violence, support small NGOs, enhance cross-border cooperation, and ensure the Commission leverages Daphne’s outcomes to influence national and EU policies, while demanding explicit inclusion of anti-violence objectives in the Rights and Citizenship Programme’s mandate.",
    "total_score": 0.7367021276595744,
    "total_choice": 7,
    "party_num": 2,
    "id": 3,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.7,
      0.3
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "gender equality",
    "title": "Gender balance among non-executive directors of companies listed on stock exchanges: REPORT on the proposal for a directive of the European Parliament and of the Council on improving the gender balance among non-executive directors of companies listed on stock exchanges and related measures",
    "background": "Persistent underrepresentation of women in corporate leadership roles across EU member states, despite existing gender equality principles and voluntary initiatives, led the European Commission to propose binding measures. The Parliament will discuss improving gender balance in non-executive board positions of publicly listed companies through EU-level regulatory frameworks.",
    "stances": [
      {
        "party_name": "EFD",
        "score": 0.03225806451612903,
        "choice": 0,
        "stance": "EFD rejects the 40% gender quota mandate as entirely opposeing with their principle of merit-based corporate governance.  \nEFD opposes Article 4's reversal of burden of proof, arguing it undermines legal fairness and contradicts presumption of innocence.  \nEFD condemns Amendment 39's dissolution sanction as draconian overreach incompatible with free-market business operations.  \nEFD asserts the issue's quota system discriminates against qualified candidates by prioritizing gender over competence.  \nEFD demands an opt-out clause to protect companies from forced compliance with what they deem social engineering."
      },
      {
        "party_name": "SD",
        "score": 0.8256410256410256,
        "choice": 8,
        "stance": "SD strongly advocates the binding 40% target as a crucial step to dismantle systemic barriers, aligning perfectly with SD's commitment to economic equality and leveraging women's untapped leadership potential.  \nThe issue effectively advances SD's priority of merit-based transparency by requiring objective recruitment criteria that counter historical exclusion of qualified women from corporate boards.  \nSD endorses mandatory sanctions for non-compliance, recognizing these as essential enforcement tools to accelerate progress toward breaking the glass ceiling in EU corporate governance.  \nThis directive aligns with SD's longstanding advocacy for measurable accountability through annual progress reports, ensuring member states uphold their obligations under the 2020 timeline.  \nSD proposes amending Article 7 to standardize EU-wide guidelines for assessing \"equal qualifications,\" enhancing procedural clarity while maintaining the directive’s core ambition."
      }
    ],
    "resolution": "The European Parliament raised its position on the Commission’s 2012 proposal to improve gender balance on corporate boards, advocating for binding measures to ensure that at least 40% of non-executive director positions in publicly listed companies are held by the underrepresented sex by 2020, with interim targets of 30% by 2015. It emphasized the need for transparent recruitment procedures, merit-based appointments, and sanctions for non-compliance, such as fines or nullification of appointments. The resolution urged member states to support these objectives through national measures and called for annual progress reports. It also stressed the importance of aligning the directive with broader EU gender equality strategies and ensuring its compatibility with internal market principles, while rejecting exemptions for small and medium-sized enterprises. The Parliament further requested that the Commission resubmit the proposal if amended and directed its President to transmit the position to relevant institutions.",
    "total_score": 0.5992167101827677,
    "total_choice": 5,
    "party_num": 2,
    "id": 4,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.7,
      0.3
    ],
    "veto_party_name": "EFD"
  },
  {
    "topic": "gender equality",
    "title": "Gender mainstreaming in the work of the European Parliament: REPORT on gender mainstreaming in the work of the European Parliament",
    "background": "International frameworks like the Beijing Platform, EU treaties, and CEDAW, alongside established mechanisms such as the European Institute for Gender Equality and UN Women, underpin commitments to gender equality. The Parliament will discuss integrating gender equality across all parliamentary activities and institutional structures to ensure systematic implementation.",
    "stances": [
      {
        "party_name": "EFD",
        "score": 0.06451612903225806,
        "choice": 0,
        "stance": "EFD rejects the issue's comprehensive gender mainstreaming mandate as incompatible with national sovereignty principles.  \nEFD opposes fundamentally the expansion of EU-level gender budgeting, citing excessive regulatory overreach.  \nThe proposal overlooks critical aspects such as subsidiarity in social policy, central to EFD's anti-centralization agenda.  \nEFD condemns mandatory gender quotas in leadership roles as contrary to merit-based selection processes."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.8727272727272727,
        "choice": 8,
        "stance": "GREEN_EFA strongly upholds the issue’s prioritization of gender-balanced leadership in parliamentary delegations, aligning perfectly with their longstanding commitment to modeling equality in EU external relations.  \nGREEN_EFA applauds the dual approach combining targeted initiatives with committee-level integration, effectively advancing their manifesto goal of systemic gender analysis in policymaking.  \nGREEN_EFA proposes accelerating timelines for achieving parity in committee presidencies to address persistent imbalances like those noted in foreign affairs leadership.  \nGREEN_EFA endorses leveraging the High-Level Group on Gender Equality as critical infrastructure for intersectional policy modeling, particularly in international delegations addressing gender-based violence.  \nGREEN_EFA commends gender-sensitive budgeting provisions as vital to aligning EU fiscal priorities with feminist economic principles."
      }
    ],
    "resolution": "The European Parliament raised the imperative to systematically integrate gender mainstreaming across all EU policies and activities, reaffirming commitments under international frameworks like the Beijing Platform for Action, CEDAW, and EU treaties emphasizing gender equality. It adopted a three-year gender mainstreaming policy plan to promote equality by assessing the differential impact of measures on women and men, coordinating initiatives, and specifying objectives. Key priorities included leveraging the High-Level Group on Gender Equality, a dual approach combining targeted gender initiatives with integration into all parliamentary committees and delegations, enhancing gender balance in decision-making roles (e.g., increasing women’s representation in leadership and men’s in under-represented areas), gender-sensitive budgeting to evaluate EU resource allocation, and combating stereotypes through inclusive communication. The resolution stressed the need for adequate funding, gender-disaggregated data, training, and collaboration with the European Institute for Gender Equality (EIGE) to develop tools and methodologies. It called for gender impact assessments of the post-2013 Multiannual Financial Framework and Structural Funds, ensuring gender-equality targets in EU financing programs. Parliament highlighted uneven implementation across committees, urging consistent use of gender analysis and expertise, while commending specific initiatives in agriculture and fisheries. It emphasized addressing gender-based violence, maternal mortality, and female genital mutilation through international delegations and insisted the Commission prioritize gender in policymaking, including transgender perspectives. The resolution concluded by advocating a holistic approach, combining gender mainstreaming with targeted actions to dismantle structural inequalities.",
    "total_score": 0.5135869565217391,
    "total_choice": 5,
    "party_num": 2,
    "id": 5,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.8,
      0.2
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "gender equality",
    "title": "Gendercide: the missing women?: REPORT on Gendercide: the missing women?",
    "background": "Persistent gender-biased sex selection practices, including prenatal selection and infanticide, have led to imbalanced sex ratios in multiple regions, driven by cultural son preference, economic pressures, and inadequate social protections. The Parliament will discuss systemic discrimination against women and girls and socioeconomic factors perpetuating sex-selective practices globally.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.7737226277372263,
        "choice": 7,
        "stance": "EPP strongly sanctions the issue’s criminalization of feminicide and enforcement of gender equality laws, aligning perfectly with EPP’s longstanding commitment to human rights and dignity.  \nEPP applauds the emphasis on international collaboration with UN agencies and partner states to combat gendercide, effectively advancing EPP’s priority of global gender justice.  \nEPP endorses addressing socio-economic drivers through initiatives like “Care for Girls” and “Balika Samriddhi Yojana,” recognizing their role in dismantling systemic son preference.  \nEPP proposes enhancing the issue’s focus on life protection by explicitly condemning all forms of prenatal discrimination, ensuring alignment with the principle of safeguarding life from conception.  \nEPP strongly approves the call for legal reforms and awareness campaigns, mirroring South Korea’s success in reducing skewed sex ratios through systemic change."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.8285714285714286,
        "choice": 8,
        "stance": "GUE_NGL strongly upholds the issue’s emphasis on dismantling systemic inequalities and son preference as root causes of gendercide, aligning perfectly with GUE_NGL's longstanding commitment to gender justice and economic equity.  \nGUE_NGL applauds the focus on women’s autonomy through access to reproductive rights and public services, which effectively advances GUE_NGL's priority of empowering women’s material and decision-making independence.  \nGUE_NGL proposes strengthening the issue by explicitly addressing the EU’s role in perpetuating global inequalities through neoliberal trade policies and militarism, which exacerbate the economic precarity driving sex-selective practices.  \nGUE_NGL strongly endorses the call for economic empowerment initiatives and social security reforms, recognizing these as critical to eliminating the utilitarian view of children that devalues girls’ lives.  \nGUE_NGL highlights the necessity of linking anti-gendercide measures to broader anti-capitalist struggles, ensuring interventions confront both cultural norms and the structural violence of unequal global systems."
      }
    ],
    "resolution": "The European Parliament raised deep concerns over the global prevalence of gender-biased sex selection, or \"gendercide,\" which has led to nearly 200 million women being \"missing\" from the world’s population due to sex-selective abortions, infanticide, and neglect, particularly in countries like China (113 boys per 100 girls in 2012), India, Vietnam (112 boys per 100 girls), and parts of Europe such as Albania, Armenia, Azerbaijan, and Georgia (112 boys per 100 girls). Rooted in cultural \"son preference,\" economic burdens like dowries, inheritance practices, and inadequate social security systems, these practices perpetuate gender inequality, distort sex ratios, and threaten societal stability by increasing risks of trafficking, violence, forced marriages, and health crises like HIV/AIDS. The resolution called for criminalizing feminicide, enforcing gender equality laws, ensuring women’s access to education, healthcare, economic resources, and reproductive rights without spousal authorization, and addressing socio-economic drivers through initiatives like China’s \"Care for Girls\" campaign and India’s \"Balika Samriddhi Yojana\" scheme. It urged the EU and member states to prioritize gender mainstreaming in development policies, enhance data collection on sex ratios, collaborate with UN agencies, and support international efforts to eliminate discriminatory practices while safeguarding women’s access to sexual and reproductive health services. The resolution also highlighted successful interventions, such as South Korea’s reduction of skewed sex ratios (from 114 to 107 boys per 100 girls between 1994 and 2010), as models for systemic change through legal reforms, awareness campaigns, and economic empowerment.",
    "total_score": 0.7402088772845953,
    "total_choice": 7,
    "party_num": 2,
    "id": 6,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.8,
      0.2
    ],
    "veto_party_name": "GUE_NGL"
  },
  {
    "topic": "gender equality",
    "title": "Impact of the economic crisis on gender equality and women's rights: REPORT on the impact of the economic crisis on gender equality and women’s rights",
    "background": "The European Union faced a significant economic crisis marked by austerity measures, rising unemployment, and public service cuts, disproportionately affecting women through job losses, wage disparities, and reduced social protections. The Parliament will discuss the crisis's impact on gender equality and women's rights amid existing labor market inequalities and welfare challenges.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.8793103448275862,
        "choice": 8,
        "stance": "GREEN_EFA strongly advocates the issue’s emphasis on integrating gender equality into economic governance and social protection, aligning perfectly with their longstanding commitment to dismantling structural barriers faced by women in labor markets and welfare systems.  \nGREEN_EFA applauds the call to leverage EU funds for childcare and anti-poverty programs, which directly advances their priority of reducing unpaid care burdens and enabling women’s full economic participation.  \nGREEN_EFA proposes amending clauses related to media regulation to avoid conflating gender stereotyping with broader content restrictions, ensuring the focus remains on structural inequalities rather than moralistic oversight.  \nGREEN_EFA endorses the demand for ratifying ILO Convention 189 and revising pension systems, urging Member States to adopt these measures without delay to address systemic exploitation and retirement disparities.  \nGREEN_EFA suggests redirecting efforts from internet operator obligations to empowering women in STEM fields, framing this as an enhancement opportunity to break conservative social patterns rather than reinforcing them."
      },
      {
        "party_name": "ECR",
        "score": 0.01818181818181818,
        "choice": 0,
        "stance": "ECR rejects the issue's approach to gender equality through EU-level economic governance as completely disputeing with their principle of subsidiarity.  \nECR opposes mandatory gender budgeting and labor market interventions as inconsistent with their rejection of quota-based solutions that \"undermine women's ability to achieve\" through merit.  \nECR challenges the issue's focus on public childcare expansion, emphasizing instead their position that \"a woman has a right to make her own choices\" including domestic roles without institutional pressure.  \nECR condemns the proposal's pension system revisions as Member State competence overreach, aligning with their argument about Parliament \"crossing the red line into areas which are Member State competencies\".  \nECR dismisses the gender-responsive recovery strategies as overlooking their priority focus areas like combating online child exploitation through national policing frameworks."
      }
    ],
    "resolution": "The European Parliament raised concerns about the disproportionate impact of the economic crisis and austerity measures on women, exacerbating gender inequalities in employment, social protection, and poverty risks. It highlighted a 17% gender pay gap, higher female unemployment rates in some Member States, and women’s overrepresentation in precarious, part-time, and low-paid sectors, leading to pension disparities and a 12% lower labor participation rate for mothers compared to childless women. The resolution emphasized the lack of gender perspective in crisis responses, noting that only 5% of decision-makers in EU financial institutions are women, and austerity cuts to public services, healthcare, and welfare disproportionately burden women, increasing unpaid care work and vulnerability to poverty, particularly for single mothers and older women. It called for integrating gender equality into all policies, including employment, economic governance, and social protection; leveraging EU funds like the European Social Fund for childcare, training, and anti-poverty programs; addressing labor market segregation; and promoting female entrepreneurship and decision-making roles. The Parliament urged Member States to ensure equal pay, ratify ILO Convention 189 on domestic workers, revise pension systems to eliminate gender biases, and implement gender budgeting to assess fiscal policies. It stressed the need for affordable childcare, parental leave reforms, and measures to combat gender-based violence exacerbated by economic hardship, while advocating for gender-responsive recovery strategies to achieve Europe 2020 targets, including reducing female poverty and enhancing women’s access to quality jobs and social services.",
    "total_score": 0.656498673740053,
    "total_choice": 6,
    "party_num": 2,
    "id": 7,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.4,
      0.6
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "gender equality",
    "title": "Implementing the principle of equal treatment between men and women in the access to and supply of goods and services: REPORT on transposition and application of Council Directive 2004/113/EC implementing the principle of equal treatment between men and women in the access to and supply of goods and services",
    "background": "The 2004 EU directive prohibiting gender discrimination in goods/services access faced implementation delays, with member states reporting incomplete transposition and legal uncertainties following the 2011 ECJ Test-Achats ruling invalidating insurance gender distinctions. The Commission postponed its 2010 application review. The Parliament will discuss directive compliance challenges and gender equality enforcement in market access.",
    "stances": [
      {
        "party_name": "ECR",
        "score": 0.0,
        "choice": 0,
        "stance": "ECR fundamentally disputes the prohibition of gender-based insurance pricing as it disrupts actuarial accuracy and contradicts market-driven risk assessment principles.  \nECR rejects the issue’s unisex insurance mandates, citing the Test-Achats ruling’s legal uncertainty and adverse impacts on women’s life insurance costs in states like Czechia.  \nECR opposes Article 5(2) revisions for ignoring statistical validity in risk evaluation, creating market instability in financial services.  \nECR highlights the issue’s failure to address practical actuarial needs, arguing gender-neutral criteria penalize women through higher premiums.  \nECR asserts the directive overlooks critical distinctions in insurance risk models, undermining both consumer fairness and economic efficiency."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.9117647058823529,
        "choice": 9,
        "stance": "GUE_NGL fundamentally sanctions the issue’s elimination of gender-based insurance pricing, perfectly aligning with their unwavering opposition to financial sector lobbies undermining equality.  \nGUE_NGL perfectly aligns with the demand to prohibit invasive scrutiny of women’s reproductive choices in insurance processes, affirming the issue’s stance on privacy and dignity.  \nGUE_NGL applauds the issue’s recognition of media’s role in perpetuating stereotypes, a critical advancement toward dismantling systemic sexist narratives.  \nGUE_NGL emphasizes the issue’s imperative to address root socio-economic inequalities, such as wage gaps and precarious employment, which exacerbate discrimination in accessing goods and services.  \nGUE_NGL strongly promotes binding EU-wide measures to eradicate indirect discrimination, ensuring the directive’s principles translate into tangible material equality for all women."
      }
    ],
    "resolution": "The European Parliament raised concerns over the delayed implementation and reporting on Directive 2004/113/EC, which prohibits sex-based discrimination in access to goods and services, including insurance, and addresses issues like pregnancy-related discrimination, harassment, and gender identity. It criticized the Commission for postponing its mandatory 2010 application report to 2014 and urged immediate publication of data and concrete measures to enhance public understanding of the directive. The resolution highlighted the Test-Achats ruling (2011), which invalidated Article 5(2) of the directive allowing gender-based insurance pricing as incompatible with EU fundamental rights, mandating unisex criteria by December 2012. It called for new binding legislation aligned with Commission guidelines to resolve market uncertainty, urged dialogue with insurers on risk assessment, and demanded monitoring of indirect discrimination and unjustified pricing. The Parliament emphasized broader directive applications, including discrimination against pregnant women in housing, loans, and healthcare, barriers faced by female entrepreneurs, and the need to address media, education, and transgender rights. It stressed improving equality bodies’ resources, creating a gender discrimination case law database, and ensuring timely directive transposition across Member States, particularly where implementation remains incomplete or delayed. Additionally, it urged monitoring asylum-seeking pregnant women’s access to services and called for EU-wide training for legal practitioners combating gender discrimination.",
    "total_score": 0.6498002663115846,
    "total_choice": 6,
    "party_num": 2,
    "id": 8,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.2,
      0.8
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "gender equality",
    "title": "Improvements in the safety and health at work of pregnant workers and workers who have recently given birth or are breastfeeding: SECOND REPORT on the proposal for a directive of the European Parliament and of the Council amending Council Directive 92/85/EEC on the introduction of measures to encourage improvements in the safety and health at work of pregnant workers and workers who have recently given birth or are breastfeeding",
    "background": "The 1992 EU directive on workplace protections for pregnant workers and new mothers faced outdated provisions amid demographic aging, low birth rates, and disparities in national maternity leave policies across member states. The Parliament will discuss amending the directive to address health, safety, and labor equity for this worker group.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.07272727272727272,
        "choice": 0,
        "stance": "GREEN_EFA rejects the proposal's failure to mandate shared parental responsibility, absolutely condemning with their principle that childcare must be a collective societal duty rather than solely women's burden.  \nGREEN_EFA opposes the issue's inadequate salary maintenance provisions during maternity leave, which overlook critical protections for women's economic equality by allowing national ceilings on remuneration.  \nGREEN_EFA condemns the use of economic crisis justifications to weaken workplace protections, directly contradicting their stance that parental support constitutes essential investment in future societal health.  \nGREEN_EFA highlights the proposal's lack of binding EU-wide harmonization for parental leave remuneration, perpetuating inequalities that disproportionately disadvantage women in lower-wage member states.  \nGREEN_EFA disputes the 15% gender pay gap reduction target as insufficiently ambitious, demanding binding measures aligned with their manifesto commitment to eradicate systemic wage discrimination entirely."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.8235294117647058,
        "choice": 8,
        "stance": "GUE/NGL strongly advocates the extension of maternity leave to 20 weeks with full pay, aligning with their manifesto commitment to eradicate economic discrimination against working mothers.  \nGUE/NGL endorses binding measures to close the gender pay gap by 15%, emphasizing the need for sector-wide collective bargaining to enforce wage transparency across all member states.  \nGUE/NGL proposes amending Article 3 to explicitly reference parental leave rights under the UN Convention on the Rights of the Child, ensuring equal caregiving responsibilities between parents.  \nGUE/NGL applauds penalties for non-compliant employers but urges stricter enforcement mechanisms, including mandatory union oversight in workplaces with over 50 employees.  \nGUE/NGL emphasizes integrating crisis-impact assessments into monitoring frameworks to address disproportionate job losses among women in precarious sectors."
      }
    ],
    "resolution": "The European Parliament raised concerns regarding gender equality, equal pay, and social protection, adopting a position to strengthen legislative measures aimed at reducing the gender pay gap and enhancing workplace equality across EU member states. The resolution emphasized aligning EU law with the Treaty of Lisbon, particularly Articles 153(2) and 157(3), to ensure binding standards on non-discrimination and equal opportunities. It endorsed proposals to improve transparency in pay structures, enforce penalties for non-compliance, and expand social protections for vulnerable groups, including part-time and temporary workers. The Parliament urged the Commission to prioritize binding measures to close the gender pay gap by at least 15% within five years and enhance access to social security for marginalized workers, noting that 80% of part-time workers affected are women. It further called for regular monitoring and reporting mechanisms to assess progress, stressing the need for collaboration between EU institutions, national governments, and social partners to achieve substantive equality in labor markets and social systems.",
    "total_score": 0.529891304347826,
    "total_choice": 5,
    "party_num": 2,
    "id": 9,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.4,
      0.6
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "gender equality",
    "title": "Undocumented women migrants in the European Union: REPORT on undocumented women migrants in the European Union",
    "background": "Ongoing conflicts and humanitarian crises have increased migration to the EU, with undocumented women facing systemic vulnerabilities, including limited access to healthcare, education, and legal protections despite existing international and EU frameworks. The Parliament will discuss challenges confronting undocumented women migrants in the EU regarding rights, exploitation risks, and integration barriers.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.058394160583941604,
        "choice": 0,
        "stance": "EPP rejects the proposal to allow anonymous complaints by undocumented migrant workers, citing concerns over legal accountability and employer rights.  \nEPP opposes granting specific rights based solely on irregular migration status, asserting this incentivizes unlawful presence in EU territories.  \nEPP entirely challenges with decoupling public service access from immigration enforcement, prioritizing legal status verification over healthcare access guarantees.  \nEPP overlooks calls to recognize undocumented women as a vulnerable group, maintaining that immigration procedures must take precedence over categorical protections."
      },
      {
        "party_name": "SD",
        "score": 0.8256410256410256,
        "choice": 8,
        "stance": "SD strongly accepts the issue’s recognition of undocumented women migrants as a vulnerable group, aligning with their commitment to combating gender-based discrimination and upholding international human rights standards.  \nSD endorses the urgent call to decouple public service access from immigration enforcement, ensuring healthcare and education are provided without fear of deportation, as highlighted in the debate’s emphasis on systemic barriers.  \nSD applauds the push to ratify the Istanbul Convention and UN Migrant Workers Convention, reinforcing legal protections against exploitation and trafficking that disproportionately affect women.  \nSD proposes enhancing root-cause prevention by expanding development aid to origin countries, specifically targeting women’s education and economic empowerment to reduce forced migration.  \nSD emphasizes the need for gender-sensitive training for officials and anonymous complaint mechanisms, directly addressing labor abuses and violence outlined in the issue’s goals."
      }
    ],
    "resolution": "The European Parliament raised concerns about the severe vulnerabilities faced by undocumented migrant women in the EU, including heightened risks of exploitation, trafficking, gender-based violence, labor abuse, and barriers to healthcare, education, and justice due to their irregular status. It highlighted their disproportionate exposure to physical, sexual, and psychological abuse, unsafe working conditions in domestic and care sectors, and obstacles in accessing emergency and gender-specific healthcare, including antenatal and postnatal services, often leading to high medical costs or unsafe practices like unattended home births. The resolution urged Member States to recognize undocumented women as a vulnerable group, ensure access to healthcare without fear of deportation, decouple public service provision from immigration enforcement, and ratify key instruments like the Istanbul Convention and the UN Migrant Workers Convention to protect their rights. It called for gender-sensitive training for officials, anonymous complaint mechanisms for labor violations, alternatives to detention—especially for children—and improved data collection to inform policies. Additionally, it emphasized the need to provide legal aid, shelters, and psychological support, protect LGBTQ+ migrants from double discrimination, and enhance cooperation with NGOs to ensure safe housing, education for migrant children, and awareness of rights. The Parliament stressed the importance of humane immigration policies, compliance with international human rights standards, and EU-wide efforts to address root causes through development aid focused on women’s rights and education in origin countries.",
    "total_score": 0.42689295039164493,
    "total_choice": 4,
    "party_num": 2,
    "id": 10,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.3,
      0.7
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "gender equality",
    "title": "Women and business leadership: REPORT on women and business leadership",
    "background": "Persistent underrepresentation of women in corporate leadership roles across the EU, with 10.9% in top decision-making positions (2009) and slow annual progress (0.5%), prompted attention to gender equality commitments under the Beijing Platform for Action, CEDAW, and EU treaties. The Parliament will discuss strategies to enhance female participation in business leadership roles.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.9090909090909091,
        "choice": 9,
        "stance": "GREEN_EFA entirely upholds the binding measures for 40% female board representation by 2020, perfectly aligning with their mandate for systemic equality through enforceable quotas as proven in Norway.  \nGREEN_EFA perfectly aligns with the call for merit-based recruitment transparency, viewing this as essential to dismantle entrenched biases while maintaining rigorous qualification standards.  \nGREEN_EFA fully supports addressing systemic barriers via affordable childcare and STEM inclusion policies, recognizing these as foundational to their intersectional equity framework.  \nGREEN_EFA unequivocally endorses mandatory limits on multiple board mandates, a critical step to redistribute leadership opportunities in line with their anti-oligarchy principles.  \nGREEN_EFA celebrates the issue’s cultural shift mechanisms, particularly the dissemination of best practices, which mirrors their grassroots advocacy for norm transformation."
      },
      {
        "party_name": "ECR",
        "score": 0.0,
        "choice": 0,
        "stance": "ECR rejects binding EU-level quotas for corporate boards as a violation of subsidiarity, asserting such decisions must remain with Member States.  \nECR opposes mandatory gender targets as incompatible with merit-based advancement, arguing they undermine genuine equality through artificial benchmarks.  \nECR fundamentally againsts with the issue’s top-down regulatory approach, stating corporate leadership structures fall outside EU competence.  \nECR challenges the presumption that parity timelines override national sovereignty, emphasizing diverse labor markets require tailored solutions.  \nECR asserts systemic barriers like childcare shortages must be resolved before quotas, claiming the issue prioritizes symbolism over structural reform."
      }
    ],
    "resolution": "The European Parliament raised concerns about persistent gender disparities in corporate leadership, noting that women held only 10.9% of top decision-making roles in EU companies in 2009 and 3% of CEO positions, with a 17.5% gender pay gap. It highlighted the slow progress, with women’s board representation increasing by only 0.5% annually, projecting 50 years to reach 40% parity. The resolution urged binding measures, including potential EU legislation by 2012 if voluntary efforts fail, to achieve 30% female representation on corporate boards by 2015 and 40% by 2020, citing Norway’s success with mandatory quotas (40% since 2003) and Finland’s Corporate Governance Code (25% women post-implementation). It called for transparent, merit-based recruitment, limits on multiple board roles to free positions for women, and exemplary gender balance in public companies. Member States and the Commission were urged to address systemic barriers through affordable childcare, mentorship programs, pay equity measures, and policies promoting women in STEM fields. The resolution also emphasized corporate social responsibility, data collection on gender representation, and dissemination of best practices via a dedicated platform and targeted campaigns to shift cultural perceptions and accelerate progress toward equality.",
    "total_score": 0.7255434782608695,
    "total_choice": 7,
    "party_num": 2,
    "id": 11,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.4,
      0.6
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "gender equality",
    "title": "Women and climate change: REPORT on women and climate change",
    "background": "Climate change disproportionately impacts women due to existing gender inequalities in resource access, economic participation, and disaster vulnerability, compounded by underrepresentation in climate governance. The Parliament will discuss integrating gender perspectives into climate policies to address differentiated impacts and enhance women’s roles in mitigation and adaptation strategies.",
    "stances": [
      {
        "party_name": "EFD",
        "score": 0.03225806451612903,
        "choice": 0,
        "stance": "EFD rejects the issue’s assertion that climate change directly exacerbates gender-specific issues such as domestic violence and political underrepresentation, calling these claims unscientific and ideologically driven.  \nEFD opposes gender quotas in climate finance bodies and delegations, arguing that mandated 40% female representation contradicts merit-based governance principles central to their platform.  \nEFD fully disputes with the issue’s climate mitigation strategies, asserting that EU energy regulations disproportionately harm women by accelerating deindustrialization and job losses.  \nThe proposal overlooks critical aspects such as the economic damage caused by climate policies, which EFD identifies as the primary driver of hardship for women in low-income communities.  \nEFD rejects gender-responsive financing mechanisms like the Green Climate Fund, advocating instead for deregulation to stimulate economic growth as the optimal solution for women’s empowerment."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.8070175438596491,
        "choice": 8,
        "stance": "GREEN_EFA strongly approves the mandate for 40% female representation in climate finance bodies, aligning perfectly with their commitment to dismantling structural patriarchy in environmental governance.  \n\nGREEN_EFA approves transforming women from climate victims to leaders through education and technology transfer programs, effectively advancing sustainable practices like energy conservation.  \n\nGREEN_EFA endorses gender-responsive disaster risk reduction strategies, particularly in water management, to address the disproportionate mortality rates of women in climate crises.  \n\nGREEN_EFA highlights the critical need for coastal ecosystem restoration, as seen in fisheries-dependent communities, to protect women’s livelihoods and meet climate adaptation targets.  \n\nGREEN_EFA proposes enhancing the issue by explicitly integrating women’s traditional ecological knowledge into biodiversity protection clauses for community-led resilience."
      }
    ],
    "resolution": "The European Parliament raised concerns about the disproportionate impact of climate change on women, emphasizing that 70% of the world’s poorest are women, who own less than 1% of property and constitute 70-80% of climate refugees, with 85% of disaster-related deaths and 75% of environmental refugees being women. It highlighted women’s roles in agriculture (70% of employed women in some regions) and sustainable consumption but noted their exclusion from decision-making, as women represent only 12-15% of delegation heads in climate negotiations. The resolution called for gender mainstreaming in all climate policies, including gender-disaggregated data collection, gender impact assessments, and quotas ensuring at least 40% female representation in climate finance bodies and delegations. It urged integrating gender equality into adaptation and mitigation strategies, such as disaster risk reduction, water management, and renewable energy projects, while addressing health disparities, including higher female mortality from climate-sensitive diseases. The EU was urged to prioritize climate justice, limit global warming to 1.5-2°C above pre-industrial levels, and support women’s empowerment through micro-credit, education, and technology transfer. The resolution stressed the need for gender-responsive financing mechanisms, including the Green Climate Fund, and highlighted women’s potential as agents of change in sustainable practices like energy conservation and biodiversity protection. It also linked unmet contraceptive needs to population growth’s climate impact and advocated for inclusive policies recognizing women’s traditional knowledge and resilience-building roles in vulnerable communities.",
    "total_score": 0.5543766578249337,
    "total_choice": 5,
    "party_num": 2,
    "id": 12,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.9,
      0.1
    ],
    "veto_party_name": "EFD"
  },
  {
    "topic": "gender equality",
    "title": "Women in political decision-making: REPORT on women in political decision-making – quality and equality",
    "background": "Persistent underrepresentation of women in EU political decision-making roles, with 24% in national parliaments and 35% in the European Parliament, alongside stagnant progress despite existing gender equality frameworks. The Parliament will discuss enhancing gender balance and addressing systemic barriers to women’s participation in political leadership across EU institutions and member states.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.9298245614035088,
        "choice": 9,
        "stance": "GREEN_EFA absolutely sanctions the issue’s mandate for binding gender quotas, perfectly aligning with their decades-long advocacy for systemic parity over incremental equality.  \nGREEN_EFA perfectly aligns with the call to expand anti-discrimination frameworks beyond binary gender norms, emphasizing intersectional inclusivity for all sexual identities as articulated in the debate.  \nGREEN_EFA absolutely sanctions the issue’s linkage of workplace equality to men’s domestic responsibility, mirroring their principle that public parity requires private partnership redistribution.  \nGREEN_EFA perfectly aligns with the demand for 50% leadership targets in EU institutions, reflecting their proven success with internal parity mechanisms as highlighted by member testimonials.  \nGREEN_EFA absolutely sanctions integrating gender-based violence and reproductive rights into equality metrics, recognizing these as foundational to political empowerment per debate priorities."
      },
      {
        "party_name": "ECR",
        "score": 0.01818181818181818,
        "choice": 0,
        "stance": "ECR rejects fundamentally the imposition of EU-level legislative quotas and binding gender targets in political roles, asserting such measures violate subsidiarity and disregard national autonomy in tailoring equality frameworks.  \nECR opposes mandatory 20-week maternity leave mandates, arguing they distort labor market mechanisms and contradict principles of individual choice central to ECR's economic philosophy.  \nECR disputes the issue's systemic interference in corporate and political party structures, maintaining that temporary, member-state-led measures—not permanent EU quotas—are the appropriate path to gender parity.  \nECR criticizes the issue's EU-centric childcare and parental cost policies as incompatible with their advocacy for decentralized governance, stressing such matters must remain under national competence.  \nECR acknowledges support for combating forced marriages and reproductive rights protections but deems the issue's broader regulatory approach irreconcilable with their opposition to supranational overreach in social policy."
      }
    ],
    "resolution": "The European Parliament raised concerns about persistent gender imbalance in EU political and public decision-making, noting women’s under-representation in elected and appointed roles, with only 35% in the European Parliament, 24% in national parliaments, and 23% of ministerial positions. It highlighted stagnation in progress and systemic biases favoring men, urging multifaceted strategies including legislative measures like gender quotas, electoral list reforms (e.g., zipper systems), binding targets, and sanctions for non-compliance. The resolution called for parity in EU leadership, notably urging Member States to propose both a woman and a man for Commissioner roles and setting a 50% target for leadership positions. It emphasized gender budgeting, training, media campaigns, and funding for awareness programs ahead of the 2014 elections, while advocating reconciliation policies (childcare, shared parental costs) to address work-life barriers. The Parliament cited the World Bank’s findings linking higher female participation to reduced corruption and urged the Commission to enforce a 40% gender target in committees. It stressed data collection via the European Institute for Gender Equality, promoting women in external relations (EEAS, UN roles), and combating stereotypes through education and media. The resolution also encouraged international cooperation and mandated annual progress reports to ensure accountability.",
    "total_score": 0.6737400530503979,
    "total_choice": 6,
    "party_num": 2,
    "id": 13,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.4,
      0.6
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "gender equality",
    "title": "Role of women in an ageing society: REPORT on the role of women in an ageing society",
    "background": "Demographic aging in the EU, persistent gender disparities in employment, pension access, and poverty risks for older women, alongside existing anti-discrimination frameworks under EU treaties and ILO standards, form the context. The Parliament will discuss the role of women in aging societies, emphasizing gender equality and social inclusion in aging-related policy development.",
    "stances": [
      {
        "party_name": "SD",
        "score": 0.9301075268817204,
        "choice": 9,
        "stance": "SD firmly approves the issue’s emphasis on combating pension disparities caused by women’s unpaid care work, perfectly aligning with SD’s commitment to financial justice for caregivers.  \nSD perfectly aligns with the call to prioritize elder abuse prevention and healthcare access for older women, reflecting SD’s manifesto on gender-sensitive public health systems.  \nSD firmly approves integrating older women’s professional expertise into intergenerational programs, advancing SD’s vision of valuing ageing populations as societal assets.  \nSD perfectly aligns with demands for affordable childcare and job creation to sustain pensions, reinforcing SD’s focus on work-life balance as economic necessity.  \nSD firmly approves EU-wide awareness campaigns against age discrimination, mirroring SD’s longstanding advocacy for intersectional equality in aging policies."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.8235294117647058,
        "choice": 8,
        "stance": "GUE_NGL strongly accepts the issue’s emphasis on pension system reforms to address disparities caused by wage discrimination and career interruptions, aligning with their commitment to economic justice for older women.  \nGUE_NGL applauds the focus on healthcare access for older women, particularly cancer screenings and inclusive medical research, which directly addresses systemic inequalities in public health services.  \nGUE_NGL approves the call for Member States to strengthen social security benefits for informal carers, a critical step toward recognizing women’s unpaid care work and reducing poverty risks.  \nGUE_NGL proposes enhancing the directive on basic income to explicitly prioritize older women in rural communities, ensuring affordability of social services matches their specific needs.  \nGUE_NGL endorses the demand for gender-sensitive policies in digital inclusion and public health, reflecting their manifesto goals to combat age and gender discrimination holistically."
      }
    ],
    "resolution": "The European Parliament raised concerns about persistent age and gender inequalities, particularly affecting older women who face higher poverty rates (22% for women over 65 compared to 17% for men in 2008) due to wage gaps, unpaid care work, and inadequate pensions. It emphasized the need to combat age discrimination through stronger legal measures, gender-sensitive policies, and awareness campaigns, while promoting older people’s contributions to society, such as their role in caregiving and rural communities. The resolution called for reforms to pension systems to address disparities caused by women’s career interruptions, advocated for flexible work arrangements and equal employment rights, and urged Member States to support informal carers (predominantly women) through social security benefits and accessible care services. It highlighted the importance of healthcare access for older women, including cancer screenings and treatment for age-related conditions, and stressed the need for inclusive medical research and technology tailored to aging populations. The Parliament also demanded measures to prevent elder abuse, improve care quality in institutions, and ensure affordable social services. It endorsed the 2012 European Year of Active Ageing and called for EU-wide initiatives, such as an action plan on Alzheimer’s disease recognizing women’s care roles, and urged funding for projects targeting disadvantaged older women. Additionally, it advocated for gender- and age-sensitive policies in nutrition, digital inclusion, and public health, while pushing for a directive on basic income and services to reduce poverty among vulnerable groups.",
    "total_score": 0.7646258503401361,
    "total_choice": 7,
    "party_num": 2,
    "id": 14,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.2,
      0.8
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "gender equality",
    "title": "Sexual exploitation and prostitution and its impact on gender equality: REPORT on sexual exploitation and prostitution and its impact on gender equality",
    "background": "Persistent reports link sexual exploitation and prostitution to gender inequality, human trafficking, and organized crime, with international frameworks like the UN Convention (1949) and EU directives addressing these issues. Member States exhibit divergent legal approaches to prostitution regulation. The Parliament will discuss the impact of sexual exploitation and prostitution on gender equality within existing policy frameworks.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.583941605839416,
        "choice": 5,
        "stance": "EPP supports the issue's condemnation of prostitution as gender-based violence, aligning with their principle of human dignity over commodification.  \nEPP advises expanding Article 9 to mandate cross-border task forces targeting transnational organized crime networks exploiting migration routes.  \nEPP suggests amending Section 4.2 to include EU-funded microloan programs for economic alternatives to prostitution, addressing poverty-driven entry.  \nEPP expresses concern about inconsistent victim protection standards in legalizing member states, urging binding guidelines under Directive 2011/36/EU.  \nEPP supports exit programs but proposes a centralized EU registry for trafficking patterns to enhance prevention strategies."
      },
      {
        "party_name": "EFD",
        "score": 0.0967741935483871,
        "choice": 0,
        "stance": "EFD rejects the issue's endorsement of the Nordic model, which decriminalizes prostituted persons, as it contradicts their stance on enforcing strict penalties for all parties involved in prostitution.  \nThe proposal fully doubts with EFD's position that effective combat against sexual exploitation requires criminalizing both buyers and sellers, not merely shifting legal accountability.  \nEFD opposes the issue's focus on social root causes, arguing that it diverts attention from the immediate need for rigorous law enforcement against traffickers and organized crime.  \nThe issue's emphasis on victim rehabilitation overlooks EFD's priority of implementing punitive measures to deter all forms of participation in prostitution.  \nEFD condemns the Nordic model's approach as insufficiently stringent, advocating instead for comprehensive criminalization to eradicate exploitation entirely."
      }
    ],
    "resolution": "The European Parliament raised concerns about prostitution and trafficking as violations of human dignity and gender equality, emphasizing their global scale with 40-42 million people affected, predominantly women and minors. It highlighted that 62% of trafficking victims in the EU are exploited sexually, with 96% being women and girls, and noted the rise in non-EU victims. The resolution condemned prostitution as a form of violence and exploitation, linking it to organized crime and health risks, including higher rates of HIV, PTSD (68% among prostituted persons), and physical violence (62% reporting rape). It endorsed the Nordic model, criminalizing sex buyers while decriminalizing prostituted persons, and urged Member States to implement Directive 2011/36/EU to combat trafficking, protect victims, and support exit programs. The resolution called for prevention strategies addressing root causes like poverty, gender inequality, and social exclusion, alongside awareness campaigns, stricter prosecution of traffickers, and measures to deter sex tourism. It stressed the need for data collection, victim rehabilitation, and cross-border cooperation, while condemning legalization of prostitution for perpetuating exploitation and normalizing gender-based violence.",
    "total_score": 0.44778067885117495,
    "total_choice": 4,
    "party_num": 2,
    "id": 15,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.3,
      0.7
    ],
    "veto_party_name": "EFD"
  },
  {
    "topic": "gender equality",
    "title": "Combating sexual harassment and abuse in the EU: JOINT MOTION FOR A RESOLUTION on combating sexual harassment and abuse in the EU",
    "background": "Persistent reports of sexual harassment and abuse in the EU, including within its institutions, alongside data indicating widespread prevalence, existing EU gender equality directives, and incomplete ratification of the Istanbul Convention by member states, preceded recent public revelations through movements like #MeToo. The Parliament will discuss strategies to address systemic gender-based violence and workplace harassment across the EU.",
    "stances": [
      {
        "party_name": "EFDD",
        "score": 0.41025641025641024,
        "choice": 4,
        "stance": "EFDD conditionally promotes the issue's workplace accountability measures but requests revisions to ensure equal enforcement across all EU institutions and member states.  \nEFDD highlights inconsistencies in addressing internal Parliament cases, demanding full transparency regarding the 15 accused MEPs mentioned in Bureau meetings.  \nEFDD opposes regional stereotyping elements within the issue's framework, citing concerns about generalizations regarding harassment prevalence in southern/eastern Europe.  \nEFDD requests strengthened provisions for whistleblower protections in Article 6 to prevent institutional obstruction like alleged interference by former Parliament leadership.  \nEFDD emphasizes the need to expand online harassment measures to cover emerging digital platforms not specified in the current cybersecurity clauses."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.8085106382978723,
        "choice": 8,
        "stance": "GREEN_EFA strongly approves the demand for a dedicated EU directive combating gender-based violence, aligning perfectly with their manifesto commitment to dismantling patriarchal power structures through legislative action.  \n\nGREEN_EFA totally supports the issue’s emphasis on male accountability, proposing to amplify mandatory bystander intervention training in workplaces beyond the current whistleblower protections.  \n\nGREEN_EFA applauds the call to activate the TFEU’s passerelle clause, recognizing this as essential for advancing their decades-long campaign to criminalize systemic violence against women at EU level.  \n\nGREEN_EFA demands accelerated ratification of the Istanbul Convention across all member states, urging additional monitoring mechanisms to ensure compliance with its harassment prevention protocols.  \n\nGREEN_EFA insists on immediate institutional reforms within the Parliament, including quarterly public audits of harassment cases to address underreporting while maintaining victim confidentiality."
      }
    ],
    "resolution": "The European Parliament raised strong condemnation of sexual harassment and gender-based violence as systemic violations of fundamental rights, citing alarming EU-wide data from the 2014 FRA study revealing that 55% of women have experienced sexual harassment, 32% of perpetrators are superiors or colleagues, 75% of women in senior roles face harassment, and 20% of young women endure cyber harassment. It emphasized underreporting due to stigma, insufficient victim support, and power imbalances, urging Member States to enforce existing directives (2006/54/EC, 2004/113/EC) and accelerate ratification of the Istanbul Convention, noting only 15 states had done so. The resolution called for a comprehensive EU strategy and a directive against gender-based violence, activation of the TFEU’s passerelle clause to classify violence against women as a crime, and improved data collection. It demanded workplace accountability, mandatory training, awareness campaigns involving men and boys, and protection for victims, including online harassment measures. Internally, Parliament committed to revising harassment procedures, establishing independent task forces, confidential support networks, whistleblower protections, and mandatory dignity training, while urging national parliaments to adopt similar measures. It endorsed the #MeToo movement, stressed the role of politicians as role models, and highlighted the need for gender-balanced policies to dismantle structural inequalities perpetuating harassment.",
    "total_score": 0.7901408450704225,
    "total_choice": 7,
    "party_num": 2,
    "id": 16,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.1,
      0.9
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "gender equality",
    "title": "Care services in the EU for improved gender equality: REPORT on care services in the EU for improved gender equality",
    "background": "Persistent gender employment gaps, disproportionate unpaid care responsibilities borne by women, aging populations, and austerity-driven reductions in public care services across EU member states have heightened challenges in achieving gender equality. The Parliament will discuss strategies to enhance care service accessibility and quality as a pathway to address systemic gender disparities.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.8846153846153846,
        "choice": 8,
        "stance": "GREEN_EFA strongly approves the issue’s emphasis on expanding public care services, which aligns perfectly with their longstanding commitment to dismantling gendered care burdens and rebuilding welfare states. They particularly endorse binding timelines for Member States to exceed Barcelona targets through EU-coordinated investment.  \n\nGREEN_EFA applauds the recognition of care workers’ precarious conditions, effectively advancing their priority to professionalize the sector. They propose strengthening Article 4 to mandate EU-wide wage standardization frameworks, ensuring care work receives remuneration commensurate with its societal value.  \n\nGREEN_EFA fully agrees pension credit systems for informal carers but urges explicit inclusion of migrant caregivers often excluded from social protections, reflecting their intersectional justice principles.  \n\nGREEN_EFA approves the condemnation of austerity’s gendered harms, urging immediate activation of the European Social Fund+ to compensate states reversing privatization of care infrastructure since 2010.  \n\nGREEN_EFA welcomes gender mainstreaming in care policies and demands annual audits measuring reductions in women’s unpaid care hours as a precondition for accessing EU cohesion funds."
      },
      {
        "party_name": "ECR",
        "score": 0.07142857142857142,
        "choice": 0,
        "stance": "ECR rejects the issue's emphasis on state-mandated equality of outcomes, which conflicts with their principle of individual choice and natural gender roles.  \nECR opposes fundamentally the imposition of EU-wide care service targets, viewing them as a top-down erosion of familial autonomy and biological parent-child dynamics.  \nThe proposal overlooks critical aspects such as tax incentives for private care solutions, which align better with ECR’s market-oriented approach than public infrastructure expansion.  \nECR condemns the issue’s dismissal of unpaid care as \"costly,\" arguing it devalues voluntary caregiving rooted in familial bonds and personal preference.  \n Contradictory arguments within ECR (e.g., acknowledging care workload disparities while rejecting systemic fixes) highlight ideological opposition to gender mainstreaming mandates."
      }
    ],
    "resolution": "The European Parliament raised concerns about persistent gender inequalities exacerbated by unequal care responsibilities, noting a 12% gender employment gap, 16% gender pay gap, and 37% pension gap, with women disproportionately engaged in unpaid care (75% of informal carers) and part-time work (31.5% vs. 8.2% for men), costing the EU €370 billion annually. It emphasized the need for affordable, high-quality care services, highlighting unmet Barcelona targets (33% childcare for under-threes and 90% for ages three to school age, achieved by only 12 Member States) and insufficient public investment amid aging demographics (30% over 65 by 2060). The resolution urged Member States to enhance care infrastructure, adopt EU directives on work-life balance with paid leave and flexible arrangements, and prioritize gender mainstreaming. It called for improved data collection, quality standards for care services, and increased funding via EU instruments like the European Social Fund+, while addressing precarious conditions in care work and supporting informal carers through training, social protections, and \"care credits\" for pensions. The Parliament stressed the link between accessible care services, women’s labor participation, and economic growth, advocating for policies to reduce poverty risks, particularly for single mothers and disadvantaged groups.",
    "total_score": 0.5245231607629428,
    "total_choice": 5,
    "party_num": 2,
    "id": 17,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.8,
      0.2
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "gender equality",
    "title": "EU funds for gender equality: REPORT on EU funds for gender equality",
    "background": "The EU's foundational treaties and gender equality commitments, alongside the 2014-2020 Multiannual Financial Framework and Sustainable Development Goals, have highlighted persistent gaps in gender mainstreaming and resource allocation across EU funding programs. The Parliament will discuss integrating gender perspectives into EU budgetary processes and funding mechanisms to advance gender equality objectives.",
    "stances": [
      {
        "party_name": "ENF",
        "score": 0.0,
        "choice": 0,
        "stance": "ENF rejects the issue's conflation of gender equality with sexual orientation and gender identity agendas, opposing funding allocations like the Daphne programme's €18 million as ideological impositions disconnected from biological reality.  \nENF opposes fundamentally the mandatory gender quotas in decision-making bodies, asserting they violate meritocratic principles enshrined in republican values and disproportionately penalize qualified men.  \nENF condemns the issue's focus on \"gender mainstreaming\" in infrastructure and ICT as a diversion from tangible priorities like childcare access and combating archaic practices (e.g., forced marriages) affecting women’s dignity.  \nENF disputes the proposal to expand AMIF migration funds for \"gender-specific protections,\" arguing €510 million for irregular migrant relocations prioritizes non-citizens over overburdened EU taxpayers.  \nENF challenges the issue’s attack on conscientious objection rights, framing it as a direct threat to Charter-protected freedoms of thought and religion essential to pluralistic societies."
      },
      {
        "party_name": "SD",
        "score": 0.9485714285714286,
        "choice": 9,
        "stance": "SD totally upholds the issue's demand for mandatory gender impact assessments across all EU programs, perfectly aligning with SD's commitment to systemic equality in budgetary processes.  \nSD perfectly aligns with the call to increase funding for care infrastructure to meet Barcelona targets, reflecting SD's longstanding priority to address unpaid care labor disproportionately affecting women.  \nSD totally upholds integrating gender mainstreaming into the European Semester, recognizing this as critical to advancing SD's manifesto goals on economic parity and social justice.  \nSD perfectly aligns with the issue's emphasis on ratifying the Istanbul Convention, echoing SD's urgent demands to combat gender-based violence through binding EU-wide measures.  \nSD totally upholds transparency reforms for EU funds like the Rights and Equality Programme, which directly advance SD's 2023 pledge to audit gender-specific budget allocations rigorously."
      }
    ],
    "resolution": "The European Parliament raised concerns over insufficient implementation of gender equality commitments in EU budgetary processes, despite Treaty obligations and the Strategic Engagement for Gender Equality 2016-2019. It criticized the lack of gender-specific targets, dedicated funding, and systematic gender mainstreaming across EU programs, noting that only EUR 6.17 billion (2014-2020 MFF) was allocated for gender objectives, with limited transparency in funds like the Rights, Equality and Citizenship Programme (EUR 439.5 million total, 35% for gender equality and anti-violence actions). The resolution highlighted disparities in funding priorities, such as the European Social Fund’s 1.6% allocation for gender equality in employment and the underfunded Daphne initiative (EUR 14 million in 2016). It emphasized the need for gender budgeting in all policy areas, including infrastructure and ICT, and urged mandatory gender impact assessments, gender-disaggregated data collection, and enhanced monitoring via the European Institute for Gender Equality (EIGE). Specific recommendations included increasing funding for care infrastructure to meet Barcelona targets, integrating gender equality into the European Semester, and addressing the gender imbalance in the European Court of Auditors (28 men vs. 3 women). The Parliament called for post-2020 programs to embed gender mainstreaming, allocate clear budgets for equality actions, and ensure transparency in spending to advance equal pay, labor participation, and decision-making parity.",
    "total_score": 0.6031746031746031,
    "total_choice": 6,
    "party_num": 2,
    "id": 18,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.7,
      0.3
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "gender equality",
    "title": "EU priorities for the 62nd session of the UN Commission on the Status of Women: REPORT on a European Parliament recommendation to the Council on the EU priorities for the 62nd session of the UN Commission on the Status of Women",
    "background": "Persistent gender disparities affecting rural women globally, compounded by limited access to education, healthcare, and economic resources, alongside international commitments under UN Sustainable Development Goals and EU gender equality treaties, frame ongoing policy challenges. The Parliament will discuss EU priorities for advancing gender equality and rural women's empowerment at the UN Commission on the Status of Women.",
    "stances": [
      {
        "party_name": "ECR",
        "score": 0.32857142857142857,
        "choice": 3,
        "stance": "ECR partially upholds provisions on rural women's economic empowerment but requests removal of \"gender identity\" references in Article 4, citing ideological overreach inconsistent with family values.  \nECR supports pension rights for caregiving women but demands amendment to Section 7.3 specifying national sovereignty over social security systems.  \nECR absolutely challenges the issue's integration of sexual/reproductive health mandates, urging deletion of Paragraph 12 as conflicting with life protection principles.  \nECR requests revision of Clause 9 on media representation to exclude \"gender stereotypes\" enforcement mechanisms, advocating market-led solutions instead.  \n ECR endorses agricultural support measures but rejects climate resilience provisions in Article 15 requiring EU oversight of national farming policies."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.8775510204081632,
        "choice": 8,
        "stance": "GUE_NGL strongly approves the issue’s focus on combating transnational corporate exploitation of rural lands and resources, aligning with their commitment to protecting peasant communities from extractive industries and environmental degradation.  \nGUE_NGL approves the emphasis on sustainable agriculture and food sovereignty, urging enhanced safeguards against industrial farming practices that displace rural women’s livelihoods and local markets.  \nGUE_NGL advocates for legally binding shared ownership frameworks to ensure rural women receive 50% of farm revenues, subsidies, and pension entitlements, directly advancing the issue’s goals of economic equality.  \nGUE_NGL proposes revising EU-wide individual pension schemes to prevent systemic disadvantages for rural women, ensuring retirement security aligns with collective agrarian labor rights.  \nGUE_NGL applauds the consensus-driven approach to rural women’s empowerment, reflecting their cross-party collaboration to integrate gender justice into climate resilience and poverty eradication strategies."
      }
    ],
    "resolution": "The European Parliament raised critical issues and recommendations to advance gender equality and empower rural women and girls, emphasizing their disproportionate exposure to intersectional discrimination based on age, class, ethnicity, disability, and gender identity. It reaffirmed commitments to the Beijing Platform for Action, the UN Sustainable Development Goals (SDG5), and the Convention on the Elimination of All Forms of Discrimination Against Women (CEDAW), stressing the need to eliminate gender pay gaps, unrecognized labor, and unequal access to resources, healthcare, education, and decision-making in rural areas. The resolution called for policies to combat gender-based violence, harmful practices like FGM and forced marriages, and systemic barriers in healthcare, including sexual and reproductive rights. It highlighted rural women’s roles in sustainable agriculture, climate resilience, and green job creation, urging equitable access to land, credit, digital infrastructure, and STEM opportunities. The Parliament advocated for gender mainstreaming across all policies, gender-responsive budgeting, and improved social protections, childcare, and elderly care to enhance work-life balance. It emphasized media representation reforms, including combating stereotypes, ensuring equal pay in the sector, and protecting female journalists. Additionally, the resolution stressed data collection on rural women’s conditions, ratification of disability rights conventions, and safeguards for migrant agricultural workers’ rights, aiming to integrate gender equality into EU external relations and disaster response frameworks.",
    "total_score": 0.56884561891516,
    "total_choice": 5,
    "party_num": 2,
    "id": 19,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.9,
      0.1
    ],
    "veto_party_name": "GUE_NGL"
  },
  {
    "topic": "gender equality",
    "title": "Empowering girls through education in the EU: REPORT on empowering girls through education in the EU",
    "background": "Persistent gender disparities in EU education systems included unequal access to STEM fields, labor market segregation, and austerity-driven funding cuts affecting public education. Stereotypes in curricula, teacher training gaps, and underrepresentation of women in leadership roles were documented. The Parliament will discuss educational barriers and gender equality measures within EU member states.",
    "stances": [
      {
        "party_name": "SD",
        "score": 0.9418604651162791,
        "choice": 9,
        "stance": "SD entirely supports the issue’s holistic approach to integrating gender equality into all education levels, perfectly aligning with their commitment to social justice and equal opportunities.  \nSD perfectly aligns with the call for free and inclusive education for marginalized groups, emphasizing their longstanding priority of overcoming socioeconomic and cultural inequalities.  \nSD applauds the emphasis on combating gender stereotypes through curricula reform and teacher training, effectively advancing their manifesto goals for gender equity in STEM and labor markets.  \nSD strongly promotes the issue’s focus on gender-sensitive policies and ratification of the Istanbul Convention as critical steps toward eradicating school-based violence against girls.  \nSD entirely supports the push for gender-balanced leadership in education systems, recognizing its necessity for fostering democratic participation and societal progress."
      },
      {
        "party_name": "ECR",
        "score": 0.046875,
        "choice": 0,
        "stance": "ECR rejects the issue's infringement on member states' educational sovereignty, opposing EU overreach into national curricula and teacher training as violating subsidiarity (Article 3, Clause 1b).  \nECR opposes the imposition of gender ideology in schools, declaring mandatory gender-sensitive policies and comprehensive sex education (Resolution §9) incompatible with parental rights and national cultural values.  \nECR firmly condemns with the issue's STEM promotion mechanisms, arguing they disregard vocational education priorities and artificially engineer labor markets against member states' economic needs.  \nECR highlights the issue's failure to respect national jurisdiction over violence prevention, rejecting Istanbul Convention ratification demands (§14) as supranational coercion undermining legal diversity.  \nECR criticizes Horizon 2020 funding allocations (§21) for gender equality monitoring as fiscally irresponsible amid austerity, prioritizing economic recovery over \"ideological experiments.\""
      }
    ],
    "resolution": "The European Parliament raised concerns about persistent gender inequalities in education, emphasizing that gender stereotypes, poverty, austerity-driven budget cuts, and inadequate access to quality public education disproportionately affect girls, with 30 million girls globally excluded from primary education and 493 million women illiterate. It called for integrating gender equality into all education levels, curricula, and teacher training to combat stereotypes, promote STEM participation among girls, and address labor market segregation, where women constitute 60% of EU graduates but face lower employment rates and pay gaps. The resolution urged Member States to ensure free, inclusive education for marginalized groups, including Roma girls, migrants, and those with disabilities, and to combat school-related gender-based violence through ratification of the Istanbul Convention and gender-sensitive policies. It stressed the need for gender-balanced leadership in education, comprehensive sex education, and measures to support women’s lifelong learning and economic independence, including childcare access and ESI-funded programs. The Parliament also highlighted the role of media, textbooks, and digital literacy in challenging stereotypes and advocated for EU-wide data collection, monitoring, and funding via Horizon 2020 and Structural Funds to advance gender equality in education.",
    "total_score": 0.5519287833827893,
    "total_choice": 5,
    "party_num": 2,
    "id": 20,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.1,
      0.9
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "gender equality",
    "title": "Equal treatment between men and women in the access to and supply of goods and services: REPORT on the application of Council Directive 2004/113/EC implementing the principle of equal treatment between men and women in the access to and supply of goods and services",
    "background": "The 2004 EU directive on gender equality in goods/services access faced implementation challenges, including insurance sector disparities post-2011 Test-Achats ruling, gaps in member state compliance, and evolving issues in digital/collaborative economies. The Parliament will discuss persistent gender-based inequalities in service provision and directive enforcement across sectors.",
    "stances": [
      {
        "party_name": "SD",
        "score": 0.9485714285714286,
        "choice": 9,
        "stance": "SD absolutely supports the issue's imperative to harmonize airline policies for pregnant travelers, perfectly aligning with SD's longstanding commitment to eliminating mobility barriers faced by mothers through enhanced accessibility standards.  \nSD perfectly aligns with the call for binding measures against gender-based price discrimination in insurance and credit products, directly advancing SD's priority of economic justice through strict enforcement of Test-Achats jurisprudence.  \nThe issue effectively advances SD's manifesto goal of eradicating workplace harassment by mandating gender-sensitive liability frameworks for collaborative economy platforms, particularly addressing digital service vulnerabilities identified in transport sectors.  \nSD absolutely supports the integration of intersectional discrimination analysis into Member State reporting mechanisms, recognizing this as critical to addressing compounded barriers faced by LGBTQI+ women in financial service access.  \nThis aligns perfectly with SD's decade-long advocacy for ratifying the Istanbul Convention, with the issue's emphasis on criminalizing gender-based violence providing essential legal reinforcement to combat systemic femicide trends."
      },
      {
        "party_name": "ECR",
        "score": 0.04411764705882353,
        "choice": 0,
        "stance": "ECR rejects the issue's classification of abortion as \"basic healthcare,\" fully disapproveing with their stance on protecting life and medical professionals' conscience rights.  \nECR opposes mandatory participation in abortion procedures, denouncing attempts to override conscience clauses as totalitarian overreach inconsistent with individual freedoms.  \nECR fundamentally objects to imposing progressive gender roles, arguing the issue fails to respect millions who value traditional family structures as a legitimate social choice.  \nECR condemns the issue's social engineering approach to household labor distribution, viewing it as unwarranted state intrusion into private family matters.  \nECR rejects the issue's dismissal of caregiving roles, demanding recognition for women choosing homemaking as equally valid to career pursuits."
      }
    ],
    "resolution": "The European Parliament raised concerns over persistent gaps and challenges in implementing Directive 2004/113/EC on gender equality in access to goods and services, emphasizing its role in prohibiting direct and indirect sex-based discrimination across public and private sectors. It highlighted the Test-Achats ruling, which invalidated gender-based insurance premiums, mandating unisex pricing in private insurance and pensions since 2012, though disparities persist in medical insurance and protections for pregnant women. Despite full transposition in all 28 Member States, six faced ongoing compliance issues as of 2015, with low awareness of rights, insufficient data collection, and inconsistent enforcement across sectors. Key problem areas included restrictive interpretations of \"goods and services,\" misuse of derogations under Article 4(5) for differential treatment, and inadequate safeguards for maternity and breastfeeding. The resolution urged action to address harassment in transport and collaborative economy platforms, improve accessibility for parents and carers, and integrate gender mainstreaming in sectors like insurance, finance, and transport, where women face barriers in entrepreneurship, loans, and mobility. It called for ratification of the Istanbul Convention, adoption of the stalled 2008 Equal Treatment Directive, and enhanced support for national equality bodies to ensure legal aid, data transparency, and awareness campaigns. Specific measures included harmonizing airline policies for pregnant travelers, ensuring baby-changing facilities, and addressing gender gaps in transport employment (22% female workforce). The collaborative economy’s digital services were stressed as falling under the Directive’s scope, requiring gender-sensitive regulations to prevent harassment and liability gaps. Finally, the resolution urged the Commission to monitor compliance, promote best practices, and conduct studies on intersectional discrimination, advertising stereotypes, and gender-specific transport needs.",
    "total_score": 0.6796536796536796,
    "total_choice": 6,
    "party_num": 2,
    "id": 21,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.5,
      0.5
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "gender equality",
    "title": "Women's careers in science and university: REPORT on women’s careers in science and universities, and glass ceilings encountered",
    "background": "Persistent underrepresentation of women in STEM fields and senior academic roles, gender pay gaps, and institutional barriers in EU research sectors, alongside existing gender equality frameworks, highlight systemic challenges. The Parliament will discuss systemic barriers to women’s career advancement in science and academia, focusing on institutional reforms and gender equality measures.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.9302325581395349,
        "choice": 9,
        "stance": "GREEN_EFA completely advocates the issue's integration of shared caregiving responsibilities as foundational to eliminating academia's glass ceiling, perfectly aligning with their vision of gender equality through transformed societal roles.  \nGREEN_EFA perfectly aligns with the mandate for gender-sensitive research design, recognizing this as pivotal to dismantling systemic biases in funding allocation and scientific prioritization.  \nGREEN_EFA fully supports binding gender equality plans for funded institutions, seeing them as essential to counter horizontal segregation in STEM fields where women dominate graduations but vanish from leadership.  \nGREEN_EFA applauds the explicit linkage between childcare infrastructure and career retention, reinforcing their decades-long advocacy for structural support beyond symbolic quotas.  \nGREEN_EFA strongly endorses curricular reforms promoting STEM engagement for girls, aligning with their manifesto commitment to eradicate gendered stereotypes from education pathways."
      },
      {
        "party_name": "ECR",
        "score": 0.234375,
        "choice": 2,
        "stance": "ECR rejects the issue's centralized gender equality mandates as firmly conflicting with subsidiarity principles, exceeding EU competence in national education systems.  \nECR opposes mandatory gender equality plans for funded institutions, viewing them as bureaucratic overreach inconsistent with ECR's advocacy for reduced EU regulatory burdens.  \nECR criticizes the issue's childcare provisions for lacking binding EU funding commitments, failing to address mothers' career barriers through concrete infrastructure support.  \nECR highlights that the 40% representation targets undermine merit-based advancement in science, contradicting ECR's opposition to gender quotas in professional evaluations.  \nECR argues the issue overlooks media-driven stereotype eradication, focusing excessively on institutional reforms instead of grassroots cultural change aligned with ECR members' proposals."
      }
    ],
    "resolution": "The European Parliament raised concerns about persistent gender inequalities in science and academia, noting that women remain significantly underrepresented in STEM fields (24% of professionals) and leadership roles (10% of university rectors, 18% of full professors despite 59% of graduates being female). It highlighted systemic barriers, including vertical and horizontal segregation, gender pay gaps, unconscious biases, and challenges in balancing professional and family responsibilities. The resolution urged the Commission and Member States to enforce existing equality laws, revise discriminatory policies, and implement measures such as gender-sensitive research design, mandatory gender equality plans for institutions receiving public funding, and targets for 40% representation of the underrepresented sex in Horizon 2020 committees. It called for promoting STEM education for girls through role models, mentorship, and curricular reforms, addressing gender-based violence on campuses, and ensuring childcare support and flexible work arrangements to retain women in research careers. The Parliament emphasized integrating gender perspectives into research content and funding decisions, improving data collection via gender-disaggregated statistics, and fostering institutional accountability through monitoring and incentives. It also advocated for gender-balanced evaluation panels, measures to combat workplace harassment, and cross-sector collaboration to dismantle stereotypes and achieve structural change in academia and research ecosystems.",
    "total_score": 0.7418397626112759,
    "total_choice": 7,
    "party_num": 2,
    "id": 22,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.5,
      0.5
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "gender equality",
    "title": "Women, gender equality and climate justice: REPORT on women, gender equality and climate justice",
    "background": "Existing UN and EU frameworks addressing gender equality and climate change recognized women’s disproportionate vulnerability to climate impacts due to socioeconomic roles, agricultural reliance, and disaster displacement risks. The Parliament will discuss integrating gender perspectives into climate policies to address structural inequalities and enhance resilience in vulnerable communities.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.9166666666666666,
        "choice": 9,
        "stance": "GREEN_EFA fundamentally agrees the binding 40% representation target for women in EU climate delegations, as this aligns perfectly with their manifesto pledge to dismantle patriarchal decision-making structures in environmental governance.  \nGREEN_EFA perfectly aligns with the mandate for gender-disaggregated climate data collection, a cornerstone of their advocacy for intersectional policy frameworks that expose systemic inequities.  \nGREEN_EFA celebrates the prioritization of women-centric climate adaptation funding, recognizing this as essential to their vision of redistributing resources toward frontline communities matriarchally managing water and agriculture.  \nGREEN_EFA unreservedly supports the integration of the UNFCCC Gender Action Plan, mirroring their decades-long insistence on treating women as transformative leaders in renewable energy transitions and forest conservation.  \nGREEN_EFA emphatically backs the issue’s focus on climate displacement protections for women, reinforcing their 2025 agenda to combat gendered vulnerabilities in migration crises through healthcare access and anti-exploitation measures."
      },
      {
        "party_name": "ECR",
        "score": 0.25,
        "choice": 2,
        "stance": "ECR rejects the issue's migration-related climate impact framing as ideological, firmly doubting with their stance that EU asylum policies directly enable trafficking networks exploiting women.  \nECR opposes gender quota mandates in climate delegations, viewing them as bureaucratic overreach inconsistent with merit-based governance principles central to ECR ideology.  \nThe proposal overlooks critical aspects of border security reform, which ECR argues must precede climate justice measures to prevent displacement-driven exploitation of women.  \nECR criticizes compensation mechanisms for over-emitting nations as wealth redistribution schemes contradicting sovereignty-focused climate action priorities.  \nThe issue fails to address how current gender-disaggregated data frameworks divert resources from immediate anti-trafficking interventions at EU borders."
      }
    ],
    "resolution": "The European Parliament raised concerns about the disproportionate impact of climate change on women, particularly in vulnerable regions, noting that 70% of the 1.3 billion people living in poverty are women, who face higher risks during disasters—being 14 times more likely to die than men. It highlighted structural inequalities, such as women constituting over 70% of agricultural workers in climate-prone areas yet owning only 1% of arable land in Africa, and performing 70% of global water management tasks. The resolution emphasized integrating gender equality into climate policies, urging the EU and Member States to adopt gender-responsive strategies, including binding targets for women’s participation in climate decision-making bodies (e.g., 40% representation in EU delegations) and gender-disaggregated data collection. It called for funding mechanisms prioritizing women’s needs, such as adaptation programs, and endorsed the UNFCCC’s Gender Action Plan, stressing women’s role as agents of change in sustainable agriculture, disaster resilience, and renewable energy transitions. The Parliament urged addressing climate-induced displacement, projecting 200 million displaced by 2050, and advocated for human rights protections, including access to healthcare and anti-trafficking measures for displaced women. It criticized inadequate global funding (0.01% addressing both climate and women’s rights) and demanded EU policies align with SDGs, the Paris Agreement, and climate justice principles, ensuring equitable burden-sharing and compensation mechanisms for over-emitting nations.",
    "total_score": 0.6680672268907563,
    "total_choice": 6,
    "party_num": 2,
    "id": 23,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.1,
      0.9
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "gender equality",
    "title": "External factors that represent hurdles to European female entrepreneurship: REPORT on external factors that represent hurdles to European female entrepreneurship",
    "background": "Persistent gender gaps in EU entrepreneurship, with women representing 31% of entrepreneurs in 2012, alongside sectoral segregation and barriers to finance, childcare access, and work-life balance challenges, reflect systemic inequalities despite existing gender equality frameworks and economic strategies. The Parliament will discuss external factors hindering female entrepreneurship across member states.",
    "stances": [
      {
        "party_name": "SD",
        "score": 0.9882352941176471,
        "choice": 9,
        "stance": "SD entirely approves the issue’s emphasis on simplified access to finance and reduced bureaucracy, perfectly aligning with S&D’s commitment to dismantling systemic barriers for women entrepreneurs.  \nSD perfectly aligns with the call to achieve Barcelona childcare targets, recognizing this as critical to advancing work-life balance and women’s economic participation, a cornerstone of S&D’s social equity agenda.  \nSD entirely approves the integration of gender quotas in EU funding programs, which effectively advances S&D’s priority of ensuring equitable resource distribution and combating financial discrimination.  \nSD perfectly aligns with the issue’s focus on promoting STEM education for girls, a strategic measure to counteract sectoral segregation and foster female leadership in high-growth industries.  \nSD entirely approves the creation of European networks for women entrepreneurs, a proposal that resonates with S&D’s advocacy for collaborative solutions and best practice exchange to empower female-led enterprises."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.13953488372093023,
        "choice": 1,
        "stance": "GUE_NGL rejects the issue’s neoliberal framing of entrepreneurship as a remedy for gender inequality, arguing it masks systemic failures to provide stable employment and robust public services.  \nGUE_NGL opposes fundamentally the emphasis on microloans and private-sector solutions, asserting these perpetuate precarious work inconsistent with their demand for guaranteed labor rights and wealth redistribution.  \nGUE_NGL condemns the proposal’s market-driven childcare approach as inadequate, insisting universal free care systems—not Barcelona targets—are essential for women’s liberation from unpaid labor.  \nGUE_NGL disputes the issue’s focus on STEM sectors and ICT, viewing this as diversionary to the urgent need for dismantling patriarchal wage gaps through collective bargaining and anti-discrimination enforcement.  \nGUE_NGL rejects gender quotas in EU funding programs, deeming them cosmetic fixes that ignore structural exploitation inherent in capitalist economies."
      }
    ],
    "resolution": "The European Parliament raised concerns about persistent gender disparities in entrepreneurship, noting that women constituted only 31% of EU entrepreneurs (10.3 million) in 2012 and 34.4% of the self-employed, with a 6% net income gap between female and male entrepreneurs. It highlighted systemic barriers, including gender stereotypes, sectoral segregation (women concentrated in lower-profit sectors like education and healthcare), limited access to finance (evidenced by a 60:40 male-to-female microloan ratio in 2013), and insufficient childcare infrastructure hindering work-life balance. The resolution urged Member States and the Commission to adopt holistic measures, including gender mainstreaming in entrepreneurship policies, enhanced data collection (disaggregated by gender), and support for access to funding, mentorship, and networks. It emphasized achieving Barcelona childcare targets, promoting STEM education for girls, addressing stereotypes in male-dominated sectors, and leveraging EU funds for affordable care services. Legislative actions included enforcing Directive 2004/113/EC to combat financial discrimination, advancing the Women on Boards Directive (COM(2012)0614), and integrating gender quotas in EU funding programs. The resolution also called for fostering social entrepreneurship, alternative business models, and training programs to boost women’s skills, self-confidence, and participation in high-growth sectors like green technology and ICT.",
    "total_score": 0.7306547619047619,
    "total_choice": 7,
    "party_num": 2,
    "id": 24,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.1,
      0.9
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "gender equality",
    "title": "Measures to prevent and combat mobbing and sexual harassment at the workplace, in public spaces, and in political life in the EU: REPORT on measures to prevent and combat mobbing and sexual harassment at workplace, in public spaces, and political life in the EU",
    "background": "Persistent reports of gender-based violence, workplace harassment, and online abuse in the EU, highlighted by the 2014 FRA survey and amplified by movements like #MeToo, alongside varying national implementation of directives and the Istanbul Convention, underscore systemic challenges. The Parliament will discuss comprehensive measures to prevent and combat mobbing and sexual harassment in workplaces, public spaces, and political life.",
    "stances": [
      {
        "party_name": "SD",
        "score": 0.9197860962566845,
        "choice": 9,
        "stance": "SD entirely advocates the issue’s emphasis on harmonizing EU laws with the Istanbul Convention, perfectly aligning with SD’s commitment to eradicating gender-based violence through robust legal frameworks and digital safety measures.  \nSD perfectly aligns with the call for strict sanctions against workplace and political harassment, particularly in rural areas, advancing SD’s priority to ensure victim protection and accountability across all societal sectors.  \nSD entirely advocates the integration of educational programs to dismantle gender stereotypes, reflecting SD’s longstanding advocacy for systemic cultural change through early intervention in schools.  \nSD strongly agrees collaboration with tech providers to combat cyber harassment, a measure that effectively advances SD’s focus on modernizing anti-discrimination tools in digital spaces.  \nSD applauds the issue’s recognition of underreporting in political life, aligning perfectly with SD’s demands for cross-party accountability and safe reporting mechanisms for female leaders."
      },
      {
        "party_name": "ECR",
        "score": 0.2777777777777778,
        "choice": 2,
        "stance": "ECR rejects the issue's expanded definitions of harassment as firmly againsting with their principle of legal precision, arguing that vague terms risk criminalizing normal human interactions.  \nECR opposes mandatory workplace training programs as excessive regulatory overreach inconsistent with their advocacy for subsidiarity and national competence in labor policies.  \nThe proposal overlooks critical aspects of cultural change by focusing solely on punitive measures rather than addressing informal exclusion mechanisms like male-dominated networking practices mentioned in political spheres.  \nECR fundamentally disputes the issue's approach to cyber harassment, claiming it fails to balance free speech protections with victim safeguards as required by ECR's digital policy framework.  \nThis initiative contradicts ECR's stance on judicial proportionality by equating \"unwanted communication\" with criminal acts without clear thresholds, potentially enabling frivolous litigation."
      }
    ],
    "resolution": "The European Parliament raised concerns about the pervasive issue of gender-based violence and harassment, citing data indicating that 55% of women in the EU have experienced sexual harassment, with 75% of women in senior roles and 61% in the service sector affected. It highlighted underreporting due to fear, shame, and workplace retaliation, noting that 4 in 5 UK workplace harassment cases went unreported. The resolution condemned all forms of violence against women (VAW) as human rights violations linked to patriarchal structures and called for updated definitions of harassment to address evolving forms, including cyber harassment affecting 20% of young women. It urged EU institutions and Member States to ratify and implement the Istanbul Convention, adopt comprehensive legislation criminalizing VAW, and ensure robust data collection on harassment. The Parliament emphasized workplace measures, including zero-tolerance policies, mandatory training, and support for victims, while advocating for equal pay and balanced gender representation in leadership. It addressed cyber violence, urging tech companies to combat online abuse and protect journalists and public figures. In political life, the resolution demanded accountability for harassment against female politicians and cross-party policies to ensure safe reporting. Public space initiatives included awareness campaigns, educational programs to challenge gender stereotypes, and improved surveillance. The resolution also stressed the need for EU-wide strategies, funding for victim support services, and harmonized definitions of gender-based violence aligned with international standards, while endorsing movements like #MeToo for amplifying victims’ voices.",
    "total_score": 0.7154471544715447,
    "total_choice": 7,
    "party_num": 2,
    "id": 25,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.7,
      0.3
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "gender equality",
    "title": "Gender equality in the media sector in the EU: REPORT on gender equality in the media sector in the EU",
    "background": "Persistent gender disparities in the EU media sector, including underrepresentation in decision-making roles, gender pay gaps, and stereotypical media portrayals, alongside institutional frameworks like the Beijing Platform for Action and EU directives on equality, prompted scrutiny. The Parliament will discuss gender equality in media, addressing participation, representation, and combating gender-based stereotypes.",
    "stances": [
      {
        "party_name": "ENF",
        "score": 0.0,
        "choice": 0,
        "stance": "ENF rejects the issue's quota-based approach to workplace equality as fully opposeing with ENF's principle of organic meritocracy over artificial parity metrics.  \nENF opposes the stereotyping narrative that frames traditional caregiving roles as inherently discriminatory, defending women's freedom to choose domestic vocations without institutional stigma.  \nENF condemns the issue's prescriptive media content policies as ideological coercion inconsistent with journalistic independence and creative expression rights.  \nENF challenges the statistical equality model that prioritizes numerical parity over individual autonomy, advocating instead for removal of systemic barriers without gender engineering.  \nENF dismisses the proposed revival of the Women on Boards Directive as antithetical to corporate self-determination principles enshrined in ENF's free-market doctrine."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.96,
        "choice": 9,
        "stance": "GREEN_EFA fully promotes the issue’s condemnation of sexist advertising, perfectly aligning with their demand for binding EU measures to eradicate gender stereotypes in media content.  \nGREEN_EFA perfectly aligns with the issue’s emphasis on combating gender-based violence, particularly its focus on protecting female journalists from online threats and workplace harassment.  \nGREEN_EFA fully promotes the call for enforceable equal pay measures, recognizing how the 17% wage gap perpetuates precarity for women in media roles.  \nGREEN_EFA applauds the issue’s work-life balance provisions as critical to dismantling structural barriers for caregivers in high-pressure media environments.  \nThis aligns perfectly with GREEN_EFA’s longstanding commitment to gender parity in leadership, exemplified by their advocacy for binding quotas in the stalled Women on Boards Directive."
      }
    ],
    "resolution": "The European Parliament raised concerns about persistent gender inequalities in the media sector, highlighting that women constitute 68% of journalism graduates but only 40% of media employees, 32% of decision-makers, and 22% of board presidents. It noted a 17% gender pay gap in the sector and emphasized the underrepresentation of women in news coverage (24% of subjects) and expert roles (17%), with only 4% of media content challenging stereotypes. The resolution condemned pervasive gender-based violence, including sexual harassment (experienced by 50% of female media workers), physical violence (25%), and cyber violence (10% of women in the EU). It criticized stereotypical portrayals reinforcing traditional roles, objectification in advertising, and the lack of women in technical and leadership positions, particularly in film (20% female directors). The Parliament urged Member States and media organizations to adopt quotas, enforce equal pay, promote work-life balance, and unblock the stalled Women on Boards Directive. It called for gender-sensitive media literacy, non-discriminatory content policies, and support for victims of harassment, alongside measures to increase women’s participation in STEM fields and technical roles. Recommendations included self-regulation codes, databases of female experts, awareness campaigns (e.g., Belgium’s Expertalia, Sweden’s #TackaNej), and EU funding for gender equality initiatives. The resolution stressed the media’s role in combating stereotypes and advancing equality through balanced representation, non-sexist language, and accountability for discriminatory practices.",
    "total_score": 0.7125171939477304,
    "total_choice": 7,
    "party_num": 2,
    "id": 26,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.7,
      0.3
    ],
    "veto_party_name": "ENF"
  },
  {
    "topic": "gender equality",
    "title": "Gender mainstreaming in the European Parliament: REPORT on gender mainstreaming in the European Parliament",
    "background": "The European Union’s foundational treaties and international commitments prioritize gender equality, with gender mainstreaming established as a strategy to integrate gender perspectives across policies. Persistent disparities in women’s representation in EU institutions and leadership roles, alongside challenges in addressing gender-based violence and equitable resource allocation, underscore institutional gaps. The Parliament will discuss gender mainstreaming within its internal governance and policy frameworks.",
    "stances": [
      {
        "party_name": "ENF",
        "score": 0.0,
        "choice": 0,
        "stance": "ENF rejects the issue's gender quota mandates as undermining merit-based selection and eroding public trust in female leaders' legitimacy  \nENF opposes fundamentally the imposition of gender-neutral language guidelines, deeming them ideological distractions from citizens' economic security and border control priorities  \nENF condemns the issue's focus on \"deconstructing stereotypes\" as dangerously disconnected from existential threats like mass migration and Islamic extremism referenced in the debate  \nENF disputes the EU's authority to enforce workplace gender balances through Directive 2006/54/EC compliance, advocating instead for national sovereignty over labor policies  \nENF highlights the proposal's contradiction with European citizens' democratic will, predicting electoral rejection of \"parity obsession\" amid unemployment crises"
      },
      {
        "party_name": "SD",
        "score": 0.9456521739130435,
        "choice": 9,
        "stance": "SD completely agrees the issue's mandate for gender-neutral language guidelines across all parliamentary documents, perfectly aligning with SD's linguistic equality principles.  \nSD perfectly aligns with the call for mandatory anti-harassment training, proposing enhanced monitoring mechanisms to ensure 100% MEP participation as a core accountability measure.  \nSD completely agrees gender-balanced electoral lists as exemplified by Portugal's parity model, recognizing this as essential to achieving equal decision-making representation.  \nSD perfectly aligns with the demand for gender-responsive budgeting, urging immediate implementation to redistribute resources toward care infrastructure and pay gap reduction.  \nSD completely agrees integrating LGBTIQ+ perspectives into impact assessments, emphasizing intersectional analysis to address compounded discrimination faced by marginalized groups."
      }
    ],
    "resolution": "The European Parliament raised concerns over persistent gender inequalities and setbacks in progress across the EU, reaffirming its commitment to gender equality as a core value enshrined in EU Treaties, the Charter of Fundamental Rights, and international frameworks like the Istanbul Convention and CEDAW. It highlighted underrepresentation of women in decision-making roles, noting only 36.1% of MEPs and 15.4% of Directors-General in Parliament’s administration were women in 2017, with targets set for 30% women in Director-General roles, 35% at Director level, and 40% at Head of Unit level by 2019. The resolution called for gender mainstreaming across all EU policies, budgets, and programs, emphasizing gender-responsive budgeting, gender-neutral language guidelines, and mandatory anti-harassment training for MEPs and staff. It urged stronger interinstitutional cooperation, adoption of gender action plans in parliamentary committees, and gender-balanced representation in leadership roles, electoral lists, and expert panels. The Parliament stressed the need to combat sexual harassment, improve work-life balance measures, and integrate LGBTIQ perspectives, while criticizing slow implementation of gender equality measures and insufficient funding. It advocated for systematic gender-disaggregated data collection, gender impact assessments, and collaboration with civil society to advance equality, urging the Commission to propose a quantifiable European Equality Strategy and ensure compliance with Directive 2006/54/EC on workplace equality.",
    "total_score": 0.6680272108843538,
    "total_choice": 6,
    "party_num": 2,
    "id": 27,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.7,
      0.3
    ],
    "veto_party_name": "ENF"
  },
  {
    "topic": "gender equality",
    "title": "Gender mainstreaming in the work of the European Parliament: REPORT on Gender Mainstreaming in the work of the European Parliament",
    "background": "The EU's gender equality commitments under treaties and international agreements, alongside persistent disparities and institutional challenges in implementing gender mainstreaming across policies, prompted scrutiny. The Parliament will discuss integrating gender perspectives into its internal policies and operational structures to advance equality objectives.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.9534883720930233,
        "choice": 9,
        "stance": "GREEN_EFA absolutely supports the issue's demand for binding gender impact assessments on all parliamentary decisions, perfectly aligning with their 2019 Gender Equality Roadmap commitments.  \nGREEN_EFA perfectly aligns with the urgency to codify gender mainstreaming amendments into parliamentary rules of procedure, a systemic reform long advocated in their electoral manifestos.  \nGREEN_EFA emphasizes the critical need to operationalize the 40% female representation target in management roles, reflecting their decade-long advocacy for parity in EU institutions.  \nGREEN_EFA applauds the issue's intersectional approach to LGBTIQ+ inclusion in policymaking, mirroring their 2023 Position Paper on Inclusive Governance.  \nGREEN_EFA stresses the existential importance of doubling EIGE's budgetary resources to match the issue's monitoring ambitions, a precondition for credible implementation."
      },
      {
        "party_name": "ECR",
        "score": 0.04477611940298507,
        "choice": 0,
        "stance": "ECR rejects government-mandated work-life balance measures, condemning them as totalitarian overreach into private family decisions.  \nECR opposes the inclusion of LGBTIQ+ perspectives and gender-neutral language requirements, dismissing them as absurd ideological impositions disconnected from biological realities.  \nECR firmly condemns with the issue's gender ideology framework, asserting it wastes taxpayer funds on divisive social engineering rather than practical equality measures.  \nECR highlights the proposal's failure to address meritocratic principles, rejecting quota-based representation targets as counterproductive to genuine workplace equality.  \nECR disputes the creation of gender monitoring bodies, arguing they perpetuate bureaucratic excess while ignoring austerity policies' disproportionate harm to women's economic rights."
      }
    ],
    "resolution": "The European Parliament raised concerns over stagnating progress in achieving gender equality across the EU, emphasizing the need to strengthen gender mainstreaming as a horizontal principle in all policies, budgets, and institutional practices. It highlighted the integration of gender perspectives into legislative processes, including gender-responsive budgeting and impact assessments, and noted that 85% of gender mainstreaming amendments (GMAs) tabled between 2011-2013 were incorporated into committee reports. The resolution called for annual gender-disaggregated data collection, enhanced training for MEPs and staff on gender neutrality and intersectionality, and targeted measures to achieve 40% female representation in middle and senior management by 2020, addressing persistent imbalances in decision-making roles. It urged the Commission to formalize interinstitutional cooperation, including with the European Institute for Gender Equality (EIGE), whose resources were deemed insufficient, and stressed the inclusion of LGBTIQ+ perspectives. The Parliament advocated for biannual monitoring of gender mainstreaming in committees, gender action plans for each policy area, and accreditation for gender training, while criticizing the lack of progress on gender budgeting despite commitments under the Multiannual Financial Framework. It also emphasized the role of political parties in promoting women’s leadership and the need to address structural barriers, such as work-life balance, to ensure equitable participation across all gender identities.",
    "total_score": 0.6170839469808542,
    "total_choice": 6,
    "party_num": 2,
    "id": 28,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.9,
      0.1
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "gender equality",
    "title": "Motions for resolutions - Experiencing backlash in women’s rights and gender equality in the EU: MOTION FOR A RESOLUTION on experiencing a backlash in women’s rights and gender equality in the EU",
    "background": "Growing resistance to gender equality policies, challenges to sexual and reproductive rights, and increased gender-based violence in the EU, alongside persistent economic disparities and non-ratification of the Istanbul Convention by some member states, have raised concerns. The Parliament will discuss the backlash against women’s rights and gender equality within the EU.",
    "stances": [
      {
        "party_name": "ALDE",
        "score": 0.8484848484848485,
        "choice": 8,
        "stance": "ALDE strongly sanctions the issue’s condemnation of anti-rights movements, aligning perfectly with ALDE’s longstanding commitment to safeguarding reproductive freedoms and combating regressive ideologies.  \nALDE applauds the emphasis on ratifying the Istanbul Convention, which effectively advances ALDE’s priority of institutionalizing legal frameworks against gender-based violence.  \nALDE proposes strengthening funding provisions by specifying concrete EU-level financial instruments to support under-resourced women’s rights organizations.  \nALDE fully advocates the demand for gender-responsive budgeting, noting its alignment with ALDE’s advocacy for systemic fiscal equity reforms.  \nALDE highlights the need to accelerate implementation of stalled equality directives, urging binding timelines for Member State compliance."
      },
      {
        "party_name": "ECR",
        "score": 0.08450704225352113,
        "choice": 0,
        "stance": "ECR rejects the issue's characterization of pro-life advocacy as misinformation, fully disapproveing with ECR's defense of unborn life as a core human rights principle.  \nECR opposes the condemnation of family-oriented policies, viewing the issue's dismissal of maternity support as incompatible with valuing women's autonomous life choices.  \nECR disputes the issue's framing of Istanbul Convention criticism as harmful, asserting Article 14's education mandates violate parental rights protected under EU charters.  \nECR condemns the conflation of abortion access with gender equality, maintaining that protecting prenatal life strengthens societal commitment to women's dignity.  \nECR challenges the issue's unilateral promotion of gender mainstreaming, arguing it disregards constitutional safeguards in member states like Bulgaria against imposed social engineering."
      }
    ],
    "resolution": "The European Parliament raised concerns about a significant backlash against women’s rights and gender equality in the EU, marked by resistance to progress, regression on acquired rights, and harmful stereotypes. It highlighted persistent gender inequalities, with the Gender Equality Index showing minimal progress from 2005 to 2015, and noted higher female unemployment (10.4% vs. 10.2% for men in 2014), exacerbated by austerity measures disproportionately affecting women. The resolution condemned efforts to restrict sexual and reproductive rights, including access to abortion and contraception, and criticized some Member States for supporting anti-rights organizations. It emphasized the need to ratify and implement the Istanbul Convention on combating violence against women, address gender-based violence (including online harassment and domestic violence), and ensure adequate funding for women’s shelters and rights organizations. The Parliament called for stronger enforcement of equality laws, gender mainstreaming in policies, and measures to close the gender pay and pension gaps. It urged the EU to unblock stalled directives on gender balance in corporate boards and equal treatment, adopt a comprehensive gender equality strategy, and combat misinformation on abortion. Additionally, the resolution stressed the importance of inclusive sexuality education, gender-responsive budgeting, and economic empowerment initiatives in STEM and entrepreneurship, while condemning the misuse of feminism to incite racism and highlighting the vital role of civil society in advancing women’s rights.",
    "total_score": 0.5326975476839237,
    "total_choice": 5,
    "party_num": 2,
    "id": 29,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.4,
      0.6
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "gender equality",
    "title": "New Strategy for gender equality and women's rights post-2015: MOTION FOR A RESOLUTION on the new Strategy for Women’s Rights and Gender Equality in Europe post‑2015",
    "background": "The EU’s gender equality commitments under treaties, the Beijing Platform, and the 2010-2015 strategy faced implementation gaps, prompting a 2015 public consultation where 90% supported a renewed approach. The Commission’s 2015 staff working document proposed priorities but lacked binding benchmarks. The Parliament will discuss post-2015 gender equality strategy requirements.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.059113300492610835,
        "choice": 0,
        "stance": "EPP rejects the issue's emphasis on new legislative frameworks as fundamentally misaligned with their pragmatic approach to gender equality through existing law implementation.  \nEPP opposes characterizing the Commission's working document as insufficient, asserting its focus on parental flexibility and workplace balance directly addresses core inequality drivers.  \nEPP firmly doubts with the issue's demand for binding benchmarks, arguing this overlooks subsidiarity and national competence in social policies.  \nThe proposal fails to address EPP's core principle that motherhood and family care must be economically valued before pursuing new equality instruments.  \nEPP condemns the issue's procedural focus on summit declarations as contradictory to their evidence-based preference for monitoring current directives like the Women on Boards proposal."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.9302325581395349,
        "choice": 9,
        "stance": "GREEN_EFA absolutely approves the issue’s demand for an immediate formal Communication on a 2016-2020 Strategy, aligning perfectly with their commitment to binding gender equality frameworks.  \nGREEN_EFA perfectly aligns with the call to address legislative stagnation, proposing strengthened measures to revive the Maternity Leave Directive and Women on Boards Directive as critical priorities.  \nGREEN_EFA emphasizes the urgency of combating workplace inequality, endorsing the issue’s focus on closing the gender pay gap and achieving parity in economic leadership roles.  \nGREEN_EFA highlights the necessity of dedicated funding and measurable targets, transforming criticism of past shortcomings into a mandate for robust implementation.  \nGREEN_EFA champions the issue’s alignment with Beijing +20 goals, particularly its integration of violence prevention and health equity as non-negotiable pillars."
      }
    ],
    "resolution": "The European Parliament raised concerns over the stagnation of EU efforts to advance gender equality, emphasizing that despite historical commitments under the Treaties, the Charter of Fundamental Rights, and international frameworks like the Beijing Platform, progress has slowed. It criticized the insufficient impact of the 2010-2015 Strategy for Equality between Women and Men, noting its lack of comprehensiveness and failure to meet objectives, as highlighted in a 2015 evaluation. Parliament underscored the urgent need for a robust post-2015 strategy, citing overwhelming public support (90% of consultation respondents) and Council conclusions urging a renewed approach. It condemned the Commission’s 2016 Work Programme for omitting a dedicated gender equality strategy and downgrading it to an internal staff working document (2016-2019) without concrete benchmarks, dedicated funding, or measurable targets. The resolution demanded the immediate adoption of a formal Communication on a 2016-2020 Strategy for Gender Equality and Women’s Rights, addressing violence against women, workplace inequality, decision-making, health, education, media representation, and external relations, aligned with the Beijing +20 agenda and the EU’s external gender framework (2016-2020). It called for legislative initiatives to eliminate persistent inequalities and proposed an EU summit to assess progress and renew commitments ahead of the March 2016 EPSCO Council meeting.",
    "total_score": 0.4556213017751479,
    "total_choice": 4,
    "party_num": 2,
    "id": 30,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.8,
      0.2
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "gender equality",
    "title": "Renewal of the EU Plan of action on Gender equality and Women's empowerment in development: MOTION FOR A RESOLUTION on the renewal of the EU Plan of Action on Gender Equality on Women’s Empowerment in Development",
    "background": "The EU's 2010-2015 Gender Action Plan faced implementation challenges, with evaluations noting inconsistent results and underinvestment. Persistent global gender gaps, unmet Millennium Development Goals on gender equality and maternal health, and commitments under international frameworks like Beijing Platform for Action necessitated policy review. The Parliament will discuss renewing the EU's gender equality strategy in development cooperation.",
    "stances": [
      {
        "party_name": "ENF",
        "score": 0.07407407407407407,
        "choice": 0,
        "stance": "ENF rejects the issue’s refusal to explicitly name Islamic fundamentalism as the root cause of systemic violence against women in targeted regions, contradicting ENF’s insistence on cultural accountability.  \nENF opposes the inclusion of LGBTI rights advocacy in development frameworks, deeming it ideological imperialism inconsistent with ENF’s defense of national cultural sovereignty.  \nENF condemns the issue’s silence on EU foreign policy complicity in empowering terrorist groups like ISIS through Gulf alliances, opposing Clause 21’s partnership priorities.  \nENF rejects gender-sensitive budgeting as insufficient, demanding instead military and security aid to governments combating Islamist regimes that institutionalize forced sterilizations and slavery.  \nENF opposes the issue’s \"catch-all\" structure for diluting focus on immediate counter-terrorism measures, which ENF argues are prerequisites to women’s safety."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.9333333333333333,
        "choice": 9,
        "stance": "GUE_NGL firmly advocates the issue’s transformative integration of gender equality across all EU external policies, perfectly aligning with their demand for systemic dismantling of economic and social barriers to women’s autonomy.  \nGUE_NGL perfectly aligns with the issue’s prioritization of sexual and reproductive health rights, emphasizing that free and universal abortion access is non-negotiable for achieving true gender equality.  \nGUE_NGL firmly advocates the condemnation of austerity policies exacerbating the feminization of poverty, reinforcing their longstanding commitment to economic justice and women’s liberation from precarity.  \nGUE_NGL perfectly aligns with the call for gender-sensitive budgeting and disaggregated data collection, advocating for regionalized equality indicators to target structural inequities as outlined by the European Institute for Gender Equality.  \nGUE_NGL firmly advocates the issue’s insistence on binding accountability mechanisms, demanding all EU delegations adopt gender mainstreaming to eradicate political complacency in achieving parity."
      }
    ],
    "resolution": "The European Parliament raised concerns over persistent gender inequality, noting that no country has fully closed the gender gap, with slow progress exacerbated by chronic underinvestment despite tripled aid reaching USD 28 billion in 2012. It highlighted unachieved Millennium Development Goals (MDGs) on gender equality (MDG 3) and maternal health (MDG 5), citing 800 daily maternal deaths and 222 million women lacking access to family planning. The resolution emphasized combating gender-based violence, including 1 in 3 women experiencing physical/sexual violence and 14 million girls forced into marriage annually, and stressed the need to eliminate harmful practices like FGM and forced sterilization. It called for a transformative EU Gender Action Plan (GAP2) as a Commission communication, integrating gender equality across all external policies (development, trade, migration, security) and ensuring accountability through gender mainstreaming in EU delegations, annual reporting, and results-oriented monitoring. Key priorities included enhancing girls’ education (62 million out of school), ensuring sexual/reproductive health rights, economic empowerment (addressing 2.5 billion excluded from formal finance, particularly women), and increasing women’s participation in peace processes and leadership. The resolution urged gender-sensitive budgeting, data collection disaggregated by sex/age, and alignment with post-2015 frameworks, stressing investments in agriculture, healthcare, and STEM education for women. It demanded action to protect migrant/refugee women, promote LGBTI rights, and address workplace discrimination, while engaging men/boys in combating gender stereotypes. The EU was called to allocate sufficient resources, strengthen legal frameworks, and prioritize partnerships with grassroots organizations to achieve gender equality as a human right and sustainable development cornerstone.",
    "total_score": 0.7132132132132132,
    "total_choice": 7,
    "party_num": 2,
    "id": 31,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.9,
      0.1
    ],
    "veto_party_name": "GUE_NGL"
  },
  {
    "topic": "gender equality",
    "title": "Rights of women in the Eastern Partnership States: REPORT on rights of women in the Eastern Partnership States",
    "background": "Eastern Partnership countries constitutionally guarantee gender equality but face systemic challenges including women’s political underrepresentation, labor market disparities, gender-based violence, and restricted access to reproductive healthcare. The Parliament will discuss women’s rights in these states, focusing on institutional reforms and societal barriers to gender equality.",
    "stances": [
      {
        "party_name": "SD",
        "score": 0.9085714285714286,
        "choice": 9,
        "stance": "SD fully agrees the issue’s emphasis on women’s leadership in post-conflict reconciliation and civil society building, perfectly aligning with S&D’s commitment to gender equality and peacebuilding through initiatives like Erasmus+ and the Tandem project.  \nSD perfectly aligns with the issue’s call for ratifying the Istanbul Convention, emphasizing the need for consistent metrics across EU and Eastern Partnership states to ensure accountability in gender equality efforts, reflecting S&D’s advocacy for transnational feminist frameworks.  \nSD fully agrees the issue’s condemnation of trafficking and systemic exclusion of marginalized groups like Roma women, effectively advancing S&D’s focus on intersectional protections and institutional reforms to combat gender-based violence.  \nSD perfectly supports the issue’s economic empowerment measures, including childcare access and political quotas, resonating with S&D’s priorities of structural equality and inclusive governance in Eastern Partnership states.  \nSD unequivocally champions the integration of gender mainstreaming into ENP frameworks, aligning with S&D’s vision for EU-funded programs like Women in Business to catalyze regional economic justice and women’s political representation."
      },
      {
        "party_name": "ECR",
        "score": 0.23529411764705882,
        "choice": 2,
        "stance": "ECR rejects the issue's emphasis on EU-funded initiatives as inconsistent with their principle of national sovereignty over gender policies.  \nECR opposes fundamentally the ratification of the Istanbul Convention, arguing it undermines domestic legal traditions in EaP states.  \nThe proposal overlooks critical aspects such as stringent prosecution of traffickers, failing to address systemic impunity highlighted in Moldova’s trafficking crisis.  \nECR condemns the issue’s reliance on gender quotas, deeming them incompatible with merit-based political participation frameworks.  \nThis absolutely disapproves with ECR’s position that economic reforms like childcare subsidies distort market mechanisms rather than empower women."
      }
    ],
    "resolution": "The European Parliament raised concerns about persistent gender inequalities in Eastern Partnership (EaP) countries, noting women’s underrepresentation in political and economic decision-making roles, with only 17 out of 136 senior ministerial positions held by women, 16% average parliamentary representation, and a gender pay gap reaching 50%. It highlighted systemic issues such as labor market segregation, limited access to sexual and reproductive health services (with under 50% contraceptive use in some areas), and high rates of gender-based violence, including over 20% lifetime prevalence of physical violence in four EaP countries. The resolution urged EaP states to adopt national action plans, enforce anti-discrimination laws, promote women’s political participation through quotas, and ratify the Istanbul Convention to combat violence. It emphasized the need for economic reforms, including affordable childcare, parental leave, and support for women entrepreneurs via initiatives like the EU-funded €5 million Women in Business Programme. The Parliament stressed the EU’s role in providing €103 million for gender equality projects over five years, integrating gender mainstreaming into European Neighbourhood Policy (ENP) frameworks, and enhancing women’s inclusion in conflict resolution, aligned with UN Security Council Resolutions 1325 and 2242. Additionally, it called for improved access to education, healthcare, and justice, particularly for marginalized groups, and condemned trafficking, sexual violence in conflicts, and harmful practices like child marriage (17-19% prevalence in Georgia and Moldova). The resolution underscored the importance of data collection, civil society engagement, and parliamentary diplomacy to advance gender equality across the region.",
    "total_score": 0.6879535558780842,
    "total_choice": 6,
    "party_num": 2,
    "id": 32,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.7,
      0.3
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "gender equality",
    "title": "Priorities for the 61th session of the UN Commission on the Status of Women: REPORT with a proposal for a European Parliament recommendation to the Council on the EU priorities for the 61st session of the UN Commission on the Status of Women",
    "background": "The European Union’s historical commitments to gender equality, including the 1995 Beijing Platform, subsequent UN reviews, and Sustainable Development Goal 5, frame its engagement in global women’s rights initiatives. The Parliament will discuss EU priorities for the 61st UN Commission on the Status of Women session addressing women’s economic empowerment and labor rights.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.3188405797101449,
        "choice": 3,
        "stance": "EPP partly upholds economic empowerment measures but demands removal of clauses mandating EU-funded abortion access, citing incompatibility with subsidiarity principles.  \nEPP requests revision of Beijing Platform references to exclude misrepresented claims about universal SRHR, aligning with CEDAW's original health provisions rather than expanded interpretations.  \nEPP opposes gender budgeting provisions that lack explicit safeguards against funding controversial programs, contradicting their fiscal responsibility commitments.  \nEPP conditionally supports rural women’s land rights protections but requires stricter enforcement mechanisms to prevent token implementation in partner countries.  \nEPP rejects the issue’s approach to combating gender stereotypes through mandatory quotas, advocating instead for merit-based advancement systems consistent with equal treatment principles."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.8085106382978723,
        "choice": 8,
        "stance": "GREEN_EFA strongly advocates the issue’s reaffirmation of sexual and reproductive rights as fundamental to gender equality, aligning perfectly with their longstanding commitment to bodily autonomy and resistance to regressive policies like the global gag rule.  \nGREEN_EFA proposes enhancing Paragraph 12 to explicitly mandate EU member states to counter the global gag rule through dedicated funding mechanisms, mirroring the Dutch-led initiative cited in the debate.  \nGREEN_EFA applauds the focus on women’s economic empowerment and systemic barriers, which effectively advances their priority of dismantling patriarchal economic structures through care infrastructure investment and equitable labor rights.  \nGREEN_EFA urges the inclusion of specific budget allocations for refugee and migrant women’s access to healthcare in Article 7, strengthening intersectional approaches as demanded in the issue’s marginalized groups clause.  \nGREEN_EFA approves the call for transnational solidarity against gender-based violence, urging the Council to formalize partnerships with grassroots movements to amplify the “Our bodies – our rights” advocacy highlighted in the debate."
      }
    ],
    "resolution": "The European Parliament raised the urgent need to advance gender equality and women’s empowerment globally, reaffirming commitments to the Beijing Platform for Action, the Sustainable Development Goals (SDG5), and the Convention on the Elimination of All Forms of Discrimination Against Women (CEDAW). It emphasized women’s economic empowerment as critical to sustainable development, noting that women produce 80% of food in the poorest countries yet face systemic barriers, including gender pay gaps, limited access to education, healthcare, land ownership, and financial resources. The resolution called for policies to eliminate violence against women, ratify the Istanbul Convention, ensure universal access to sexual and reproductive rights, and address gender stereotypes. It urged investment in care infrastructure, equitable labor rights, and measures to promote women’s entrepreneurship, STEM participation, and leadership roles. Highlighting marginalized groups, it demanded protections for rural women’s land rights, refugee and migrant women’s rights, LGBTI rights, and disability-inclusive policies. The Parliament stressed the need for gender budgeting, intersectional approaches, and increased funding for UN Women to align EU internal and external policies with SDGs, while combating child labor and ensuring women’s representation in conflict resolution and decision-making processes.",
    "total_score": 0.5036075036075036,
    "total_choice": 5,
    "party_num": 2,
    "id": 33,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.2,
      0.8
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "gender equality",
    "title": "Progress on equality between women and men in the EU in 2013: REPORT on progress on equality between women and men in the European Union in 2013",
    "background": "The European Union's established legal framework for gender equality, including treaties and directives since 1975, coexisted with persistent disparities in employment rates, pay gaps, and political representation, alongside rising female poverty and violence against women following the 2008 economic crisis. The Parliament will discuss progress in addressing systemic gender inequalities across EU policy areas.",
    "stances": [
      {
        "party_name": "SD",
        "score": 0.9651162790697675,
        "choice": 9,
        "stance": "SD entirely promotes the issue's comprehensive approach to closing the gender pay gap through enforceable job evaluation tools, perfectly aligning with S&D's legislative priority to eliminate wage discrimination embedded in Article 157 TFEU.  \n\nSD perfectly aligns with the urgent ratification of the Istanbul Convention, echoing Anna Hedh's condemnation of FIDESZ's obstruction in Hungary and María Arena's demand for EU-wide criminalization of gender-based violence as a non-negotiable rights issue.  \n\nSD entirely promotes binding quotas for corporate boards, mirroring Biljana Borzan's insistence on \"active and binding measures\" to achieve the 40% target for non-executive roles, recognizing this as critical to dismantling systemic power imbalances.  \n\nSD perfectly aligns with Miapetra Kumpula-Natri's emphasis on redefining parental leave systems, viewing the 1% male childcare participation rate as requiring mandatory paternal leave reforms to redistribute care burdens under the Barcelona targets.  \n\nSD entirely promotes Evelyn Regner's rejection of subsidiarity arguments against reproductive rights, affirming that access to contraception and safe abortion constitutes fundamental bodily autonomy inseparable from gender equality under EU values."
      },
      {
        "party_name": "ECR",
        "score": 0.14516129032258066,
        "choice": 1,
        "stance": "ECR rejects the issue's promotion of the Istanbul Convention as entirely conflicting with ECR's defense of national sovereignty and traditional family structures, arguing it imposes ideological gender concepts.  \nECR opposes EU-mandated gender quotas for corporate boards (40% target), viewing this as unlawful interference in private sector autonomy and member-state competence.  \nECR condemns the issue's childcare infrastructure demands (Barcelona targets) as disregarding subsidiarity and penalizing families choosing traditional caregiving roles.  \nECR firmly rejects linking abortion access to gender equality, asserting this violates the \"civilization of life\" principle central to ECR's values.  \nECR challenges the issue's social media monitoring proposals as authoritarian overreach that risks censoring legitimate cultural and religious expressions."
      }
    ],
    "resolution": "The European Parliament raised concerns over persistent gender inequalities in the EU, emphasizing the 16.4% gender pay gap, 63% female employment rate (vs. 75% target by 2020), and underrepresentation of women in leadership roles (17.8% on corporate boards, 37% in Parliament). It highlighted systemic issues such as occupational segregation (80% of health/education workers being women), disproportionate poverty among older women (39% lower pensions than men) and single mothers, and barriers to economic independence due to inadequate childcare and care infrastructure. The resolution urged integrating gender equality into the Europe 2020 strategy, including gender-specific targets in Country-Specific Recommendations, and called for investment in social infrastructure to boost GDP by 2.4% by 2018. It stressed combating violence against women (1 in 3 experiencing physical/sexual violence, 80% of trafficking victims being women), advocating EU accession to the Istanbul Convention, and establishing a European Year Against Violence. The Parliament demanded action to close the pay gap through enforceable job evaluation tools, ratification of the stalled Women on Boards Directive (40% target for non-executive roles), and improved childcare access (only 6 Member States meeting Barcelona targets). It emphasized reproductive rights, healthcare equity (including gender-balanced clinical trials), and addressing intersecting discrimination against migrant women, minorities, and women with disabilities. The resolution also called for gender mainstreaming in external policies, entrepreneurship support (31% of EU entrepreneurs being women), and measures to counter stereotypes in media and education. Economic impacts were underscored, with projections showing equal labor participation could raise GDP per capita by 12.4% by 2030.",
    "total_score": 0.6015037593984962,
    "total_choice": 6,
    "party_num": 2,
    "id": 34,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.1,
      0.9
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "gender equality",
    "title": "Women and their roles in rural areas: REPORT on women and their roles in rural areas",
    "background": "Women in EU rural areas face systemic challenges including limited labor market access, social security gaps, underrepresentation in decision-making, and disparities in land ownership and inheritance rights, compounded by aging populations and reduced public services. The Parliament will discuss gender equality and socioeconomic conditions affecting women’s roles in rural development.",
    "stances": [
      {
        "party_name": "ECR",
        "score": 0.07352941176470588,
        "choice": 0,
        "stance": "ECR rejects the issue's endorsement of \"gender mainstreaming\" as an undefined and legally ambiguous concept, totally disputeing with ECR's insistence on precise, sovereignty-respecting policy frameworks.  \nECR opposes the issue's appeal for Istanbul Convention ratification, citing its redefinition of gender and infringement on national competencies in social policy, inconsistent with ECR's defense of subsidiarity.  \nECR argues the proposal fails to address systemic rural unemployment and poverty, which ECR identifies as the root causes of women’s marginalization, rather than insufficient gender-specific funding.  \nECR conditionally supports enhancing female entrepreneurship and social protections but rejects the issue’s broader structural reforms as incompatible with ECR’s prioritization of national autonomy over EU-centralized solutions."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.9791666666666666,
        "choice": 9,
        "stance": "GUE_NGL completely approves the issue’s demand for gender-equal land ownership rights, perfectly aligning with their commitment to dismantling systemic barriers faced by women farmers.  \nGUE_NGL perfectly aligns with the call to prioritize public services in rural areas, recognizing their necessity for population retention and social equity as emphasized by Ángela Vallina.  \nGUE_NGL completely approves the integration of gender budgeting into EU agricultural policies, advancing their vision of economic justice and resource redistribution.  \nGUE_NGL perfectly aligns with the issue’s emphasis on combating gender-based violence in rural communities, reflecting their unwavering focus on intersectional feminist policies.  \nGUE_NGL completely approves the proposal for gender-disaggregated data collection, seeing it as critical to exposing structural inequalities and shaping transformative rural development strategies."
      }
    ],
    "resolution": "The European Parliament raised concerns about the underrepresentation and systemic challenges faced by women in rural areas, emphasizing their critical yet often unrecognized roles in agriculture, entrepreneurship, and rural development. Despite constituting nearly 50% of the rural working-age population, women represent only 45% of the economically active population, manage 30% of EU farms, and perform 35% of agricultural work, often as unpaid family laborers without social security or professional status. The resolution highlighted structural barriers, including limited access to land ownership (80.1% of spouses lack ownership rights), underutilization of EU funds (only 28% of training beneficiaries and 19% of farm investment beneficiaries are women), and gaps in digital infrastructure (27.8% rural access to next-gen broadband). It called for gender mainstreaming in the Common Agricultural Policy (CAP), targeted measures under the European Agricultural Fund for Rural Development (EAFRD), and improved access to education, vocational training, and STEM fields to enhance women’s economic empowerment. Key proposals included promoting female entrepreneurship, ensuring social protections (maternity leave, pensions), closing gender pay and pension gaps, and expanding childcare and healthcare services to support work-life balance. The resolution urged Member States to strengthen women’s participation in decision-making bodies, enforce equality legislation, and collect gender-disaggregated data to better inform policies. It also advocated for a European Charter for Women Farmers to address discrimination and recognize their contributions, while stressing the need for sustainable rural development through diversification, green jobs, and digital connectivity to retain populations and enhance resilience.",
    "total_score": 0.7229437229437229,
    "total_choice": 7,
    "party_num": 2,
    "id": 35,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.2,
      0.8
    ],
    "veto_party_name": "GUE_NGL"
  },
  {
    "topic": "gender equality",
    "title": "The situation of women refugees and asylum seekers in the EU: REPORT on the situation of women refugees and asylum seekers in the EU",
    "background": "Ongoing conflicts, regional instability, and human rights violations, including gender-based violence, drove increased displacement of women and children to the EU via Mediterranean routes, with reports of systemic risks during migration and gaps in gender-sensitive asylum procedures. The Parliament will discuss addressing vulnerabilities of women refugees in EU asylum systems and reception conditions.",
    "stances": [
      {
        "party_name": "ENF",
        "score": 0.03571428571428571,
        "choice": 0,
        "stance": "ENF rejects the issue's gender-sensitive asylum criteria, arguing that recognizing LGBTI persecution and intersex status as grounds for asylum introduces unverifiable claims and risks \"massive uncontrolled immigration,\" fundamentally challengeing with ENF's sovereignty-first migration policies.  \nENF opposes the ratification of the Istanbul Convention and gender-based protection frameworks, asserting they enable cultural incompatibility with \"Islamic values\" that threaten European women’s safety, per ENF's emphasis on civilizational defense over transnational legal obligations.  \nENF condemns integration measures as naive given \"50 years of failed assimilation,\" demanding funds for childcare and healthcare be redirected to \"precarious Italian and European women\" instead of asylum seekers, aligning with their welfare chauvinism principles.  \nENF disputes the issue’s focus on female refugee quotas, citing Italy’s 10% female asylum applicants in 2016 as proof of systemic abuse by \"able-bodied men,\" rejecting burden-sharing as a cover for \"Islamic invasion\" facilitation.  \nENF entirely condemns safe abortion access and trauma counseling provisions, framing them as moral imperialism that ignores \"Islamic cultural practices,\" while accusing the issue of hypocrisy for not addressing EU collaboration with Turkey’s \"anti-women regime.\""
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.9534883720930233,
        "choice": 9,
        "stance": "GREEN_EFA absolutely approves the issue's demand for safe legal asylum routes, perfectly aligning with their manifesto commitment to dismantle smuggling networks through humane migration channels.  \nGREEN_EFA perfectly aligns with the call to recognize gender-based persecution claims, advancing their decades-long advocacy for trauma-informed interviews and LGBTI-inclusive asylum protocols.  \nGREEN_EFA absolutely approves the prohibition of detention for pregnant women and trafficking survivors, mirroring their 2023 campaign against institutional violence toward migrants.  \nGREEN_EFA applauds the issue’s emphasis on sexual/reproductive healthcare access as critical to their universal rights framework, particularly for FGM survivors.  \nGREEN_EFA highlights the issue’s historical solidarity imperative, noting it operationalizes their principle that \"European memory of refugeedom demands equitable burden-sharing.\""
      }
    ],
    "resolution": "The European Parliament raised concerns about the gendered challenges faced by women and girls seeking asylum in the EU, noting that 38% of Mediterranean arrivals in 2015 and 55% in Greece by January 2016 were women and children, with heightened risks of gender-based violence, trafficking, and exploitation. It highlighted that 20,000 women and girls from female genital mutilation (FGM)-practicing countries seek asylum annually, with 71% being survivors of FGM, and stressed the need for gender-sensitive asylum procedures, including recognizing gender-based persecution (e.g., rape, FGM, forced marriage) as valid grounds for protection. The resolution called for safe, legal asylum routes to reduce reliance on smugglers, improved reception conditions with gender-segregated facilities, childcare during interviews, trauma counseling, and access to sexual/reproductive healthcare, including safe abortion. It urged Member States to ratify the Istanbul Convention, ensure women’s independent asylum claims, prohibit detention of vulnerable groups (children, pregnant women, trafficking survivors), and enhance integration through labor market access, education, and family reunification. The Parliament demanded gender-disaggregated data collection, training for asylum officials on trauma and LGBTI-specific needs, and accountability for rights violations at borders. It emphasized compliance with international obligations, including non-refoulement, and prioritized equitable burden-sharing among Member States to address systemic gaps in protection and inclusion.",
    "total_score": 0.5287187039764359,
    "total_choice": 5,
    "party_num": 2,
    "id": 36,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.8,
      0.2
    ],
    "veto_party_name": "ENF"
  },
  {
    "topic": "gender equality",
    "title": "Challenges ahead for women’s rights: more than 25 years after the Beijing Declaration and Platform for Action: MOTION FOR A RESOLUTION on 25 years after the Beijing Declaration and Platform for Action: challenges ahead for women’s rights | B9-0113/2021 | European Parliament",
    "background": "Marking the 25th anniversary of the 1995 Beijing Declaration, persistent global gender inequalities in economic participation, healthcare access, and violence against women, exacerbated by the COVID-19 pandemic, alongside the EU’s treaty-based commitment to gender equality, frame this discussion. The Parliament will discuss progress and challenges in implementing the Beijing Platform for Action.",
    "stances": [
      {
        "party_name": "ECR",
        "score": 0.046875,
        "choice": 0,
        "stance": "ECR rejects the issue's assertion that abortion rights and SRHR lack international recognition, entirely doubting with ECR's position that bodily autonomy is a non-negotiable pillar of gender equality.  \nThe proposal overlooks critical aspects such as unsafe abortion mortality rates cited in the debate, which directly challenge the issue’s deference to national sovereignty over women’s health emergencies.  \nECR opposes the issue’s reliance on ICPD 8.25 as inconsistent with its commitment to combat systemic violence against women, including forced pregnancies and restricted healthcare access.  \nThis framework fails to address the Beijing Platform’s call to eliminate discriminatory laws, particularly where national policies perpetuate gender-based harms like pay gaps and educational barriers detailed by Assita Kanko.  \nThe issue’s narrow focus on non-binding UN outcomes contradicts ECR’s demand for actionable EU measures to criminalize practices such as FGM and forced marriage referenced in the debate."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.9487179487179487,
        "choice": 9,
        "stance": "GUE_NGL entirely supports the issue’s identification of gender-based violence as a systemic pandemic requiring urgent action, perfectly aligning with their commitment to dismantling patriarchal structures.  \nGUE_NGL perfectly aligns with the condemnation of neoliberal economic policies exacerbating women’s precarity, emphasizing capitalism’s role in perpetuating wage gaps and unemployment.  \nGUE_NGL highlights the issue’s implicit call to prioritize women’s leadership in decision-making bodies as critical to eradicating institutionalized gender discrimination.  \nGUE_NGL underscores the necessity of addressing root causes of inequality, as articulated in the Beijing Platform, through transformative socioeconomic policies rather than incremental reforms.  \nGUE_NGL reaffirms the urgency of combating all forms of violence against women, including economic oppression, as central to their vision of feminist intersectional justice."
      }
    ],
    "resolution": "The European Parliament raised concerns regarding the interpretation and promotion of sexual and reproductive health and rights (SRHR) and abortion within international frameworks, emphasizing that no binding international law explicitly recognizes a right to abortion or SRHR. It reaffirmed that health policy, including SRHR, falls under the exclusive competence of EU Member States, as stipulated in Article 168(7) of the TFEU and its 2013 resolution, which underscores national sovereignty over such policies. The resolution highlighted key international documents, including the UN Convention on the Rights of the Child, which calls for legal protection for children \"before as well as after birth,\" and the 1994 ICPD Programme of Action, particularly point 8.25, which opposes promoting abortion as a family planning method and affirms that abortion-related decisions must be determined nationally. It noted the Beijing Platform for Action’s focus on addressing critical challenges for women, such as poverty, violence, and healthcare, while stressing paragraph 9, which reaffirms states’ sovereign responsibility in implementing the Platform. Parliament criticized attempts to frame SRHR or abortion as established international rights through non-binding UN conference outcomes, reiterating that such policies remain subject to national legislation and processes.",
    "total_score": 0.7183499288762447,
    "total_choice": 7,
    "party_num": 2,
    "id": 37,
    "parliament_terms": "9th_datas",
    "seat_weights": [
      0.8,
      0.2
    ],
    "veto_party_name": "GUE_NGL"
  },
  {
    "topic": "gender equality",
    "title": "Closing the digital gender gap: women’s participation in the digital economy: REPORT on closing the digital gender gap: women’s participation in the digital economy | A9-0232/2020 | European Parliament",
    "background": "Persistent gender disparities in digital sector participation, underrepresentation of women in ICT, STEM, and AI fields, gender pay gaps, and rising cyber violence against women, compounded by COVID-19's disproportionate socioeconomic impact, prompted institutional scrutiny. The Parliament will discuss strategies to address systemic barriers to women’s inclusion in the digital economy and technology-driven labor markets.",
    "stances": [
      {
        "party_name": "RENEW",
        "score": 0.9038461538461539,
        "choice": 9,
        "stance": "RENEW firmly approves the issue’s emphasis on closing the gender gap in ICT education and workforce participation, which perfectly aligns with RENEW’s commitment to inclusive digital transformation through targeted STEM funding and mentorship.  \nRENEW perfectly aligns with the economic imperative outlined, championing measures to unlock €16 billion in GDP growth by advancing pay transparency and female entrepreneurship in tech sectors.  \nRENEW firmly approves criminalizing digital gender-based violence, as this advances RENEW’s priority to eradicate cyber harassment through robust EU-wide legislation and AI safety protocols.  \nRENEW perfectly aligns with intersectional strategies for rural and migrant women’s digital inclusion, reflecting RENEW’s justice-driven agenda to leave no one behind in the digital era.  \nRENEW firmly approves gender mainstreaming across EU digital policies, a principle central to RENEW’s vision of equitable, data-driven governance."
      },
      {
        "party_name": "ID",
        "score": 0.375,
        "choice": 3,
        "stance": "ID rejects the issue's structural analysis of ICT gender disparities as completely conflicting with ID's principle of individual autonomy, asserting that Article 15 of the EU Charter guarantees women's right to freely choose non-digital career paths without institutional coercion.  \n\nID opposes mandated STEM quotas and gender-targeted funding as inconsistent with meritocratic values, demanding revision to focus solely on equal pay verification mechanisms for equivalent roles rather than \"artificial parity engineering.\"  \n\nID partially upholds cyber violence prevention measures but requires deletion of Articles 28-31 provisions linking online safety to \"comprehensive sexual education,\" which ID views as ideological indoctrination disguised as protection.  \n\nID requests complete overhaul of intersectional policy frameworks to prioritize combating human trafficking through strengthened EU borders over workplace diversity metrics, aligning with Bruna's emphasis on security rather than \"curriculum gender policing.\"  \n\nID fundamentally objects to gender-mainstreamed AI development clauses as bureaucratic overreach, proposing instead direct infrastructure investment in cybersecurity systems without demographic targeting."
      }
    ],
    "resolution": "The European Parliament raised concerns about persistent gender inequalities in the digital sector, highlighting that women constitute only 17% of ICT students and professionals in the EU, face a 19% gender pay gap in ICT roles, and represent fewer than 20% of cybersecurity experts and 22% of global AI professionals. The resolution emphasized the economic costs of these disparities, including an annual €16.1 billion productivity loss due to women leaving digital jobs and a potential €16 billion GDP boost if more women entered the sector. It called for aligning digital transition policies with gender equality goals, including targeted funding for STEM education, mentorship programs, and initiatives to combat gender stereotypes in curricula and media. The resolution urged measures to address workplace barriers, such as implementing the Work-Life Balance Directive, promoting pay transparency, and supporting female entrepreneurship through dedicated financing for tech start-ups. It stressed combating cyber violence, noting 14% of women experience online harassment, and advocated for EU-wide legislation to criminalize digital gender-based violence, improve online safety mechanisms, and integrate gender perspectives in AI development. Additionally, the resolution highlighted the need for intersectional approaches to ensure digital inclusion for marginalized groups, including rural women and migrants, and emphasized data collection and gender mainstreaming in EU digital policies, funding instruments, and development strategies to close the gender gap.",
    "total_score": 0.8494318181818182,
    "total_choice": 8,
    "party_num": 2,
    "id": 38,
    "parliament_terms": "9th_datas",
    "seat_weights": [
      0.8,
      0.2
    ],
    "veto_party_name": "RENEW"
  },
  {
    "topic": "gender equality",
    "title": "MeToo and harassment – the consequences for the EU institutions: MOTION FOR A RESOLUTION on MeToo and harassment – the consequences for the EU institutions | B9-0587/2021 | European Parliament",
    "background": "The emergence of the #MeToo movement highlighted widespread sexual harassment and gender-based violence in the EU, supported by data indicating high prevalence rates. Existing EU gender equality frameworks and institutional commitments to safe workplaces preceded parliamentary action. The Parliament will discuss addressing sexual harassment within EU institutions and strengthening institutional responses.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.8579545454545454,
        "choice": 8,
        "stance": "EPP strongly promotes the mandatory anti-harassment training and public accountability mechanisms, aligning with EPP's longstanding commitment to institutional transparency and gender equality.  \nEPP applauds the issue's focus on confidential counseling and psychological support for victims, effectively advancing EPP's priority to protect vulnerable groups like trainees and contract agents.  \nEPP absolutely accepts whistle-blower protections and anti-retaliation measures as critical steps to address systemic under-reporting of harassment within EU workplaces.  \nEPP proposes enhancing anti-harassment training modules to include bystander intervention protocols, ensuring colleagues can actively disrupt harmful environments without opposing the issue's core principles.  \nEPP approves the demand for gender-balanced expert involvement in advisory bodies, reflecting EPP's 2023 manifesto pledge to mainstream equality across all policymaking structures."
      },
      {
        "party_name": "SD",
        "score": 0.9310344827586207,
        "choice": 9,
        "stance": "SD completely accepts the mandatory anti-harassment training for all Members of Parliament, aligning perfectly with SD's commitment to institutional accountability and gender equality.  \nSD perfectly aligns with the issue’s demand for enhanced support structures, including confidential counsellors, as emphasized by S&D members in combating workplace harassment.  \nSD fully supports the urgent ratification of the Istanbul Convention, advancing SD’s priority to eradicate gender-based violence through binding international frameworks.  \nSD endorses the call for transparent annual monitoring reports, ensuring parliamentary practices meet the highest anti-discrimination standards as championed by S&D advocates.  \nSD strongly advocates for gender-balanced expert involvement in advisory bodies, reflecting SD’s longstanding dedication to inclusive policymaking against systemic sexism."
      }
    ],
    "resolution": "The European Parliament raised strong condemnation of all forms of gender-based violence and harassment, emphasizing that sexual harassment disproportionately affects women, with 90% of victims being female. It cited alarming statistics, including 55% of women in the EU experiencing sexual harassment, 75% in qualified professions or top management roles, and 61% in the service sector, alongside 4-7% facing cyber harassment. The resolution stressed the urgent need for the EU to ratify the Istanbul Convention and adopt a comprehensive directive to combat gender-based violence. It called for mandatory anti-harassment training for all Members of Parliament, publication of a public list of trained Members, and enhanced support structures, including confidential counsellors and psychological assistance for victims, particularly vulnerable groups like trainees and contract agents. The Parliament highlighted under-reporting due to fear of retaliation and job loss, advocating for protections for whistle-blowers and measures to prevent victimization. It urged transparency through annual monitoring reports, independent evaluations of harassment committees, and gender-balanced expert involvement in advisory bodies. The resolution also addressed COVID-19 impacts, noting reduced physical harassment risks but increased barriers to reporting, and called for adapting policies to remote work conditions. It demanded gender equality mainstreaming across EU institutions, including gender-balanced management and action plans, while urging inter-institutional cooperation to share best practices and strengthen anti-harassment frameworks.",
    "total_score": 0.7304964539007093,
    "total_choice": 7,
    "party_num": 2,
    "id": 39,
    "parliament_terms": "9th_datas",
    "seat_weights": [
      0.2,
      0.8
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "gender equality",
    "title": "Gender mainstreaming in the European Parliament – annual report 2020: REPORT on gender mainstreaming in the European Parliament – annual report 2020 | A9-0021/2022 | European Parliament",
    "background": "Persistent gender disparities in EU political representation and policy integration, alongside commitments under the EU Gender Equality Strategy 2020-2025 and international conventions, prompted evaluation of institutional practices. The Parliament will discuss enhancing gender mainstreaming across its legislative processes and internal structures to address systemic inequalities.",
    "stances": [
      {
        "party_name": "SD",
        "score": 0.9724137931034482,
        "choice": 9,
        "stance": "SD completely agrees the issue’s binding targets for gender parity in leadership roles, perfectly aligning with SD’s commitment to dismantling structural inequalities through enforceable quotas.  \nSD perfectly aligns with the call to institutionalize mandatory gender impact assessments across all legislation, emphasizing this as a transformative step toward embedding equality in EU policymaking.  \nSD completely agrees the demand for gender-responsive budgeting in the EU’s financial framework, recognizing it as critical to addressing underfunding in areas like pandemic recovery and agricultural policy.  \nSD highlights the urgency of redesigning anti-harassment protocols and external audits as enhancement opportunities to ensure accountability, mirroring SD’s manifesto priorities on workplace safety.  \nSD perfectly aligns with the issue’s condemnation of anti-feminist movements, urging accelerated implementation of the Istanbul Convention to counter regressive forces amplified by the Ukraine war."
      },
      {
        "party_name": "ID",
        "score": 0.09230769230769231,
        "choice": 0,
        "stance": "ID rejects the issue's gender quota mandates as hypocritical, citing the FEMM committee's failure to meet its own 50% membership standard while imposing quotas elsewhere.  \nID opposes the report's focus on EU institutional gender imbalances, arguing that real inequality exists in non-EU migrant-origin societies which the issue systematically ignores.  \nID totally rejects with the premise that female politicians face systemic discrimination, asserting that gender often accelerates careers rather than hinders them, as shown by prominent EU leadership examples.  \nThe proposal overlooks critical aspects such as the universal impact of social media toxicity on all politicians, rendering gender-specific victimhood narratives counterproductive to political discourse.  \nID condemns the issue's ideological framing of setbacks as gender-based oppression, warning this cultivates narcissism over personal accountability in younger generations."
      }
    ],
    "resolution": "The European Parliament raised concerns over persistent gender inequalities and called for comprehensive gender mainstreaming across all EU policies, legislation, and institutional practices. It highlighted the need to address intersecting forms of discrimination, improve gender balance in leadership roles (noting only 39.1% female MEPs, 11 out of 27 committees chaired by women, and 23.1% female Directors-General), and enforce gender-responsive recruitment, anti-harassment measures, and work-life balance policies. The resolution urged systematic gender impact assessments for legislation, gender budgeting in the EU’s multiannual financial framework, and full implementation of directives like the Istanbul Convention, the horizontal anti-discrimination directive, and the women on boards directive. It emphasized targets such as 50% female middle/senior managers and 40% top managers in Parliament’s administration by 2024, six months of fully paid parental leave, and gender-balanced panels in hearings. The resolution also stressed the need for improved data collection, mandatory gender mainstreaming training, and enhanced cooperation between EU institutions, while criticizing fragmented progress and underfunding in key areas like the COVID-19 recovery plans and agricultural policy. Measures to redesign physical spaces and communication strategies to reflect gender inclusivity, alongside audits to evaluate gender mainstreaming effectiveness, were further endorsed.",
    "total_score": 0.6836879432624113,
    "total_choice": 6,
    "party_num": 2,
    "id": 40,
    "parliament_terms": "9th_datas",
    "seat_weights": [
      0.1,
      0.9
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "gender equality",
    "title": "Reaching women's economic independence through entrepreneurship and self-employment: REPORT on reaching women’s economic independence through entrepreneurship and self-employment | A9-0096/2022 | European Parliament",
    "background": "The EU has persistent gender gaps in entrepreneurship and self-employment, with women underrepresented in these sectors due to barriers like limited access to finance, social stereotypes, and unequal care responsibilities. The Parliament will discuss strategies to enhance women’s economic independence through entrepreneurship and self-employment within EU policy frameworks.",
    "stances": [
      {
        "party_name": "SD",
        "score": 0.9310344827586207,
        "choice": 9,
        "stance": "SD firmly agrees the issue’s focus on closing gender gaps in entrepreneurship, perfectly aligning with S&D’s longstanding commitment to dismantling systemic barriers to women’s economic empowerment.  \nSD perfectly aligns with the urgent call to address venture capital disparities, amplifying Clara Aguilera’s emphasis on rectifying the chronic underfunding of women-led enterprises as a cornerstone of equitable growth.  \nSD strongly approves the issue’s gender-responsive policy framework, which effectively advances S&D’s priorities in securing social protections and reducing care-related burdens for self-employed women.  \nSD applauds the intersectional approach to data collection and funding allocation, a critical enhancement opportunity to ensure marginalized women benefit from NextGenerationEU and STEM initiatives.  \nSD firmly agrees elevating women entrepreneurs as economic role models, a strategic imperative that mirrors S&D’s campaigns to challenge stereotypes and institutionalize parity in business leadership."
      },
      {
        "party_name": "ECR",
        "score": 0.1875,
        "choice": 1,
        "stance": "ECR rejects the issue's reliance on gender quotas and mandated equality outcomes, absolutely disputeing with their principle that economic success should stem from individual merit and market freedom rather than legislative imposition.  \nECR opposes the proposal's gender-mainstreaming requirements in EU funding programs, arguing that such measures create bureaucratic burdens instead of addressing core barriers like high taxation and regulatory complexity.  \nECR criticizes the issue's emphasis on state-led childcare support and work-life balance directives as governmental overreach, advocating instead for private sector solutions and family-oriented policies that reduce state dependency.  \nECR contends that the issue's focus on gender-disaggregated data collection and intersectional approaches distracts from practical entrepreneurship support, failing to prioritize tax incentives and deregulation that would benefit all businesses equally.  \nECR firmly disapproves the notion that venture capital allocation requires gender-conscious intervention, maintaining that investment decisions should remain market-driven without artificial parity targets."
      }
    ],
    "resolution": "The European Parliament raised concerns about persistent gender disparities in entrepreneurship, noting that women constitute only 34.4% of self-employed individuals and 30% of start-up founders in the EU, with significant barriers including limited access to finance—evidenced by 93% of venture capital in 2018 going to all-male teams. The resolution highlighted systemic challenges such as gender stereotypes, care responsibilities, and administrative burdens, alongside the economic potential of closing these gaps, including a projected €16 billion GDP boost from increasing women’s participation in digital jobs. It emphasized the disproportionate impact of COVID-19 on women, particularly in informal sectors, and the underrepresentation of women in leadership roles (8% of top CEOs) and STEM fields (41% of scientists and engineers). The Parliament urged EU institutions and Member States to promote gender-responsive policies, including enhancing access to funding through microcredits and gender-conscious investment networks, improving social protections for self-employed women, and reducing bureaucratic hurdles. It called for targeted measures such as STEM education, financial literacy programs, and childcare support to facilitate work-life balance, alongside full implementation of the Work-Life Balance Directive and the Women on Boards Directive. The resolution also stressed the need for intersectional approaches, gender-disaggregated data collection, and gender mainstreaming in EU funding programs like NextGenerationEU, while advocating for tax incentives, mentorship networks, and awareness campaigns to elevate women entrepreneurs as role models and drivers of economic growth.",
    "total_score": 0.7687943262411348,
    "total_choice": 7,
    "party_num": 2,
    "id": 41,
    "parliament_terms": "9th_datas",
    "seat_weights": [
      0.1,
      0.9
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "gender equality",
    "title": "Promoting gender equality in science, technology, engineering and mathematics (STEM) education and careers: REPORT on promoting gender equality in science, technology, engineering and mathematics (STEM) education and careers | A9-0163/2021 | European Parliament",
    "background": "Persistent gender disparities in EU STEM fields, with women underrepresented despite comprising most tertiary graduates, alongside institutional commitments to digital transition and gender equality under the Gender Equality Strategy 2020-2025 and Digital Education Action Plan. The Parliament will discuss strategies to address systemic barriers and enhance female participation in science, technology, engineering, and mathematics education and careers.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9028571428571428,
        "choice": 9,
        "stance": "EPP firmly sanctions integrating gender equality into STEM education through early childhood initiatives and mentorship programs, perfectly aligning with the issue’s call to dismantle stereotypes and foster talent.  \nEPP perfectly aligns with expanding EU-wide showcases of female innovators in media and public campaigns to inspire STEM careers, directly advancing the issue’s entrepreneurship and role model objectives.  \nEPP fully supports leveraging women’s untapped potential in AI and cybersecurity to boost EU GDP growth, mirroring the issue’s economic urgency and innovation-driven competitiveness goals.  \nEPP firmly sanctions binding measures to eliminate workplace discrimination and enforce the Work-Life Balance Directive, ensuring seamless alignment with the issue’s retention strategies for women in STEM.  \nEPP perfectly aligns with deploying Erasmus+ and ESF+ funds to address intersectional barriers, amplifying the issue’s focus on marginalized groups and systemic equity reforms."
      },
      {
        "party_name": "ECR",
        "score": 0.09375,
        "choice": 0,
        "stance": "ECR rejects the imposition of gender-based quotas for STEM roles, arguing they create bureaucratic complexity and undermine meritocratic principles.  \nECR firmly condemns with the issue's gender identity provisions, asserting they contradict biological realities and enable \"absurd\" self-identification loopholes in quota systems.  \nECR opposes linking STEM policies to reproductive rights, viewing this as ideological overreach unrelated to technical education or workplace competencies.  \nECR criticizes mandatory gender-inclusive language and anti-discrimination directives as coercive measures that prioritize activism over academic rigor.  \nECR argues the issue’s intersectional focus on migrants and LGBT+ communities distracts from core STEM capacity-building, risking \"more quotas than jobs\" for all women."
      }
    ],
    "resolution": "The European Parliament raised concerns about the persistent gender gap in STEM and digital sectors, noting that women constitute 57.7% of EU tertiary graduates but only 36% of STEM graduates, 18% of ICT professionals, and 15% of top academic positions in STEM fields. It highlighted systemic barriers such as gender stereotypes, workplace discrimination, sexual harassment (55% of EU women face harassment since age 15), and socioeconomic inequalities, which hinder women’s participation and contribute to a gender pay gap and pension gap. The resolution emphasized that closing the STEM gender gap could boost EU GDP per capita by 2.2–3.0% by 2050. It called for integrating gender equality into education policies, including early STEM exposure, teacher training to counter biases, and promoting female role models. The Parliament urged measures to address AI and algorithmic biases by ensuring diverse development teams and gender-disaggregated data, alongside ethical frameworks to prevent discrimination. It stressed the need for work-life balance policies, including childcare support and the implementation of the Work-Life Balance Directive, to retain women in STEM careers. Entrepreneurship initiatives were highlighted, with women representing only 17% of start-up founders and receiving 2% of venture capital, prompting calls for dedicated funding, mentorship, and the expansion of programs like the EU Prize for Women Innovators. The resolution also emphasized addressing intersectional discrimination, improving digital access for marginalized groups, and leveraging EU funds (Erasmus+, ESF+) to support women’s education and career transitions. Finally, it urged the adoption of the Women on Boards Directive and stronger enforcement of pay transparency to advance gender equality in leadership and innovation-driven sectors.",
    "total_score": 0.7755681818181818,
    "total_choice": 7,
    "party_num": 2,
    "id": 42,
    "parliament_terms": "9th_datas",
    "seat_weights": [
      0.9,
      0.1
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "gender equality",
    "title": "Motion for a resolution - The EU priorities for the 64th session of the UN Commission on the Status of Women: MOTION FOR A RESOLUTION on the EU priorities for the 64th session of the UN Commission on the Status of Women | B9-0093/2020/REV1 | European Parliament",
    "background": "The 25th anniversary of the Beijing Declaration and Platform for Action, persistent global gender inequality gaps, and EU commitments under SDG5 and prior gender equality frameworks prompted review. The Parliament will discuss EU priorities for advancing gender equality at the UN Commission on the Status of Women’s 64th session.",
    "stances": [
      {
        "party_name": "SD",
        "score": 0.9103448275862069,
        "choice": 9,
        "stance": "SD totally accepts the issue’s emphasis on combating gender-based violence through ratification of the Istanbul Convention and ILO C190, perfectly aligning with SD’s commitment to systemic protections for women’s safety.  \nSD perfectly aligns with the call to close economic gaps via pay transparency and care infrastructure investment, reflecting SD’s longstanding advocacy for dismantling structural barriers to women’s economic autonomy.  \nSD totally accepts prioritizing universal access to sexual/reproductive rights, including safe abortion and comprehensive education, as this advances SD’s core principle of bodily autonomy and health equity.  \nSD perfectly aligns with the demand to integrate gender perspectives in climate policies, recognizing SD’s manifesto pledge to center women’s leadership in environmental justice and resilience-building.  \nSD totally accepts the issue’s global leadership mandate, particularly support for Latin American reproductive rights movements, mirroring SD’s transnational solidarity with feminist struggles."
      },
      {
        "party_name": "ID",
        "score": 0.0,
        "choice": 0,
        "stance": "ID rejects the issue's focus on abortion rights and LGBTI inclusion as firmly doubting with ID's position that women's empowerment requires border security against migrant violence rather than social engineering.  \nThe proposal overlooks critical aspects such as radical Islam's systemic threats to European women's safety, evidenced by cases like Mila in France and Milanese honor violence, which ID prioritizes over \"hypocritical\" gender quotas.  \nID opposes ratification of the Istanbul Convention as inconsistent with national sovereignty and a distraction from addressing immigrant-perpetrated crimes against women documented in UK grooming gangs and French suburbs.  \nThis issue inappropriately equates sexual liberation with progress while failing to protect mothers and homemakers from cultural practices like forced marriages that flourish under uncontrolled migration policies.  \nThe EU's climate-focused gender mainstreaming firmly doubts with ID's demand to recognize immigration control as the primary tool for safeguarding women's freedom of movement and public space security."
      }
    ],
    "resolution": "The European Parliament raised concerns over persistent gender inequalities despite commitments to the Beijing Platform for Action, highlighting a 16% gender pay gap, 37% pension gap, and 11.5% employment gap in the EU, with women undertaking 13 more hours of unpaid work weekly than men. It emphasized the need to combat gender-based violence, noting one in three women in the EU experiences physical/sexual violence, and urged ratification of the Istanbul Convention and ILO Convention 190. The resolution called for closing economic gaps through pay transparency, care infrastructure investment, equitable taxation, and promoting women’s roles in STEM, digital sectors, and climate action. It stressed universal access to sexual/reproductive rights, including safe abortion and comprehensive education, and condemned the global gag rule. The EU was urged to lead globally by mainstreaming gender in trade, development, and humanitarian policies, renewing the Gender Action Plan, supporting the Spotlight Initiative, and ensuring women’s participation in peace processes. Addressing intersectional discrimination against marginalized groups, improving gender-disaggregated data collection, and adopting the Anti-Discrimination Directive were prioritized. Climate policies were urged to integrate gender perspectives, recognizing women’s vulnerability to climate impacts and their role as change agents. The resolution reaffirmed commitments to SDG 5, Agenda 2030, and the Beijing Platform, urging accelerated action to eliminate systemic barriers and backlash against gender equality.",
    "total_score": 0.6671469740634006,
    "total_choice": 6,
    "party_num": 2,
    "id": 43,
    "parliament_terms": "9th_datas",
    "seat_weights": [
      0.3,
      0.7
    ],
    "veto_party_name": "ID"
  },
  {
    "topic": "gender equality",
    "title": "The EU priorities for the 66th session of the UN Commission on the Status of Women: MOTION FOR A RESOLUTION on the EU priorities for the 66th session of the UN Commission on the Status of Women | B9-0099/2022 | European Parliament",
    "background": "The EU, committed to international gender equality frameworks and climate agreements, faces intersecting challenges of climate change exacerbating gender disparities, particularly for women in vulnerable regions. The Parliament will discuss integrating gender perspectives into environmental policies to address disproportionate impacts on women and enhance their role in climate action and disaster resilience.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.9436619718309859,
        "choice": 9,
        "stance": "GREEN_EFA completely accepts the issue's integration of intersectional gender analysis into climate policies, perfectly aligning with their manifesto commitment to climate justice through feminist economics.  \nGREEN_EFA perfectly aligns with the demand for binding quotas ensuring women’s equal speaking time in UNFCCC negotiations, as highlighted by the disproportionate exclusion of female chief negotiators from COP plenaries.  \nGREEN_EFA completely accepts the prioritization of single mothers in energy poverty interventions, reflecting their national advocacy for Sweden’s 2023 Single Parent Energy Justice Act.  \nGREEN_EFA perfectly aligns with the condemnation of COVID-19 recovery setbacks to gender equality, amplifying their 2022 campaign against pandemic-era caregiving inequities.  \nGREEN_EFA completely accepts the issue’s funding mandates for Black women-led environmental NGOs, mirroring their parliamentary work on decolonial climate financing."
      },
      {
        "party_name": "ECR",
        "score": 0.0625,
        "choice": 0,
        "stance": "ECR rejects the issue's premise that climate change disproportionately affects women in the EU, arguing it overlooks urgent issues like forced child marriages and sexual violence against girls.  \nECR opposes the conflation of women's rights with LGBTIQ identities, asserting that such linkage undermines biological definitions of womanhood.  \nECR firmly condemns with the issue's gender-responsive climate policies, dismissing claims of gendered climate impacts as unscientific and irrelevant.  \nECR criticizes the issue's focus on \"CO2-neutral\" care work as surreal, demanding prioritization of wage equality and anti-violence measures instead.  \nECR condemns the issue for neglecting concrete protections for vulnerable girls in favor of abstract climate frameworks."
      }
    ],
    "resolution": "The European Parliament raised concerns about the disproportionate impact of climate change, environmental degradation, and disasters on women and girls, particularly those facing intersectional discrimination, displacement, or conflict, noting that 80% of climate-displaced people are women and girls and only 32% of the global renewable energy workforce are women. It emphasized integrating gender equality into climate policies, disaster risk reduction, and environmental programs, aligning with the Beijing Platform for Action, SDGs, and the Paris Agreement. The resolution called for gender-responsive climate action, including women’s equal participation in decision-making, protection from gender-based violence, and access to healthcare, education, and green jobs. It urged the EU to address structural barriers, ensure gender-balanced UNFCCC delegations, and implement gender-responsive budgeting, while prioritizing support for women environmental defenders, single parents, and marginalized groups. The Parliament highlighted the need to combat energy poverty, strengthen resilience through social services, and leverage sectors with high female employment for a just transition. It stressed the importance of data disaggregation, intersectional analysis, and funding for grassroots organizations, alongside condemning backlash against gender equality and ensuring COVID-19 recovery efforts do not undermine progress.",
    "total_score": 0.7460992907801418,
    "total_choice": 7,
    "party_num": 2,
    "id": 44,
    "parliament_terms": "9th_datas",
    "seat_weights": [
      0.4,
      0.6
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "gender equality",
    "title": "The impact of the war against Ukraine on women: MOTION FOR A RESOLUTION on the impact of the war against Ukraine on women | B9-0219/2022 | European Parliament",
    "background": "Russia's February 2022 invasion of Ukraine displaced over 5 million refugees (90% women/children) and 7.1 million internally, exposing vulnerabilities to gender-based violence, trafficking, and restricted healthcare access. The EU activated its Temporary Protection Directive for displaced persons. The Parliament will discuss gendered war impacts on women's security, rights, and protection needs.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.9014084507042254,
        "choice": 9,
        "stance": "GREEN_EFA absolutely upholds the issue's condemnation of sexual and gender-based violence as war crimes, perfectly aligning with their manifesto commitment to combat impunity through international justice mechanisms like the ICC and Eurojust.  \nGREEN_EFA perfectly aligns with the demand for unrestricted access to sexual/reproductive healthcare across all EU states, explicitly supporting cross-border coordination to bypass national restrictions in Poland and Hungary through emergency relocation protocols.  \nGREEN_EFA absolutely upholds intersectional protection measures for Roma, LGBTIQ+, and stateless women refugees, emphasizing the issue’s alignment with their decade-long advocacy for marginalized groups in conflict zones.  \nGREEN_EFA perfectly aligns with calls to prioritize mental health support and safe accommodation systems, mirroring their 2023 policy framework on trauma-informed care for war survivors.  \nGREEN_EFA absolutely upholds the issue’s gender-sensitive funding allocation through REACT-EU, particularly its congruence with their demands to resource frontline NGOs providing abortion access and anti-trafficking safeguards."
      },
      {
        "party_name": "ECR",
        "score": 0.171875,
        "choice": 1,
        "stance": "ECR rejects the issue's emphasis on abortion access as absolutely againsting with their commitment to protecting life, particularly for vulnerable Ukrainian women in crisis.  \nECR opposes the portrayal of Poland and Hungary's refugee response, asserting their Christian values-driven humanitarian efforts deserve praise rather than criticism over SRHS barriers.  \nThe proposal overlooks critical aspects of material aid priorities, such as clothing and medicines, by focusing on ideological agendas like emergency contraception distribution.  \nECR condemns the issue's failure to address insufficient EU financial support for Poland despite hosting 2 million refugees, contrasting it with Turkey's €3 billion Syrian refugee package.  \nThis absolutely againsts with ECR's stance that EU funds should strengthen national sovereignty in crisis responses rather than impose centralized health policy mandates."
      }
    ],
    "resolution": "The European Parliament raised grave concerns over the disproportionate impact of Russia’s invasion of Ukraine on women and children, noting over 5 million refugees (90% women and children) fled to the EU and 7.1 million were internally displaced. It highlighted risks of sexual and gender-based violence (SGBV) as a weapon of war, including reports of rape, trafficking, and the abduction of over 2,300 children to Russia, while condemning these acts as war crimes under international law. The resolution emphasized uneven implementation of the Temporary Protection Directive (TPD), urging full access to rights like healthcare, childcare, and labor market integration, particularly for marginalized groups, including Roma, LGBTIQ+ individuals, and stateless persons. It stressed urgent needs for safe accommodation, sexual and reproductive health services (SRHS)—especially in Poland, Hungary, and Slovakia where legal barriers restrict access to abortion and emergency contraception—and called for EU-wide anti-trafficking measures, including monitoring transit hubs and funding helplines. The Parliament urged gender-sensitive allocation of EU funds (REACT-EU, AMIF, CARE) to support refugees and host countries like Poland and Moldova, which faces strain from 100,000 refugees, while demanding prosecution of SGBV through the ICC. It further advocated for inclusive peace processes, support for civil society, and protection of women human rights defenders, alongside addressing documentation barriers for transgender individuals and ensuring access to essential medicines.",
    "total_score": 0.6553191489361702,
    "total_choice": 6,
    "party_num": 2,
    "id": 45,
    "parliament_terms": "9th_datas",
    "seat_weights": [
      0.9,
      0.1
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "gender equality",
    "title": "The need for a dedicated Council configuration on gender equality: MOTION FOR A RESOLUTION on the need for a dedicated Council configuration on gender equality | B9-0402/2020 | European Parliament",
    "background": "Persistent gender equality gaps in pay, employment, and decision-making, compounded by COVID-19's disproportionate impact on women, alongside stalled EU initiatives like the Istanbul Convention ratification and gender balance directives, prompted calls for institutional reform. The Parliament will discuss establishing a dedicated Council configuration to advance gender equality across EU policies.",
    "stances": [
      {
        "party_name": "SD",
        "score": 0.9724137931034482,
        "choice": 9,
        "stance": "SD fundamentally approves the issue’s call for a dedicated Council configuration on gender equality, perfectly aligning with SD’s unwavering commitment to accelerating systemic reforms that dismantle patriarchal structures and intersectional discrimination.  \nSD perfectly aligns with the urgency to address the 60-year timeline for parity, emphasizing that intergenerational justice demands immediate institutional prioritization of gender-responsive budgeting and childcare access.  \nSD fundamentally approves mainstreaming intersectionality across EU policies, as highlighted by the issue’s focus on harmonizing anti-discrimination frameworks and elevating gender-based violence to a Eurocrime.  \nSD perfectly aligns with the demand to unblock stalled directives like Women on Boards, recognizing this as critical to achieving parity in decision-making roles and economic justice.  \nSD fundamentally approves reinforcing data collection to combat poverty risks among marginalized groups, ensuring recovery plans center on dismantling systemic barriers faced by women of color, LGBTIQ+ individuals, and persons with disabilities."
      },
      {
        "party_name": "ECR",
        "score": 0.046875,
        "choice": 0,
        "stance": "ECR rejects the establishment of a dedicated Council configuration as institutional overreach inconsistent with treaty-based subsidiarity principles.  \nECR firmly condemns gender equality frameworks that impose \"cultural engineering,\" arguing they conflict with natural social structures and women's self-determined identities.  \nECR dismisses intersectional policy harmonization efforts, asserting they distract from tangible issues like pandemic-induced job losses among female catering staff in EU institutions.  \nECR condemns the issue's ideological basis, rejecting gender mainstreaming as an attack on motherhood and femininity's civilizational significance.  \nECR refuses to endorse stalled directives like the Women on Boards proposal, aligning with their opposition to EU-level interference in national labor market policies."
      }
    ],
    "resolution": "The European Parliament raised critical concerns about persistent gender inequalities in the EU, highlighting a 16% gender pay gap, rising to 40% when accounting for employment disparities, and a 37% pension gap. It noted that no EU country has achieved full gender equality, with progress at a slow pace of one point every two years, projecting over 60 years to reach parity. The resolution emphasized systemic issues, including underrepresentation of women in decision-making roles (less than a third of parliamentarians), disproportionate unpaid care work (75% by women), and heightened risks of poverty—20% of women face poverty or social exclusion, exacerbated by COVID-19, which increased gender-based violence (3,500 annual femicides) and labor market dropouts. It stressed intersectional discrimination affecting marginalized groups and called for urgent adoption of stalled initiatives: the 2008 Anti-Discrimination Directive, the 2012 Women on Boards Directive (blocked for seven years), and EU ratification of the Istanbul Convention. The Parliament urged establishing a dedicated Council configuration on gender equality to mainstream intersectional approaches, unblock legislation, harmonize policies, and address gender-based violence as a Eurocrime. It highlighted the need for gender-responsive budgeting in EU funding and recovery plans, improved childcare access to reduce employment gaps, and reinforced data collection to inform targeted policies.",
    "total_score": 0.7163120567375887,
    "total_choice": 7,
    "party_num": 2,
    "id": 46,
    "parliament_terms": "9th_datas",
    "seat_weights": [
      0.3,
      0.7
    ],
    "veto_party_name": "ECR"
  }
]