[
  {
    "topic": "transport & tourism",
    "title": "Allocation of slots at European Union airports: REPORT on the proposal for a regulation of the European Parliament and of the Council on common rules for the allocation of slots at EU airports (recast)",
    "background": "The European Commission proposed recasting EU airport slot allocation rules in 2011 amid rising air traffic demand and constrained airport capacity, aiming to optimize infrastructure use. The Parliament will discuss regulatory reforms to establish common slot allocation rules, balancing operational efficiency, competition, and connectivity across EU airports.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.9310344827586207,
        "choice": 9,
        "stance": "GREEN_EFA firmly supports the issue's procedural integrity in codifying existing legislation without dilution of environmental safeguards, perfectly aligning with their constitutional commitment to legislative transparency.  \nGREEN_EFA perfectly aligns with the issue's implicit rejection of ground handling liberalization that risks social dumping, upholding their manifesto pledge to protect airport workers' rights.  \nThe issue effectively advances GREEN_EFA's priority of local autonomy in noise management by maintaining current restrictions against economic interference, safeguarding communities from harmful nighttime operations.  \nGREEN_EFA firmly supports the rejection of Commission overreach in regional flight curfews, reinforcing their decades-long advocacy for binding WHO noise standards over corporate interests.  \nThis legislative consolidation perfectly aligns with GREEN_EFA's systemic critique of aviation subsidies by preserving existing frameworks until full sectoral taxation parity is achieved."
      },
      {
        "party_name": "ECR",
        "score": 0.01818181818181818,
        "choice": 0,
        "stance": "ECR rejects the slot allocation proposal's failure to substantively advance market liberalization, absolutely againsting with their core principle of open competition.  \nECR opposes the issue's preservation of existing slot rules as inconsistent with their demand for evidence-based reforms to airport capacity constraints.  \nECR absolutely againsts with the noise regulation's shift to EU-level prescriptiveness, directly contradicting their subsidiarity stance on local governance of airport impacts.  \nECR opposes the mandatory rehiring clauses in groundhandling provisions, viewing them as anti-competitive market distortions incompatible with free enterprise principles.  \nECR rejects the proposal's static approach to slot trading proceeds distribution, which disregards their position on market-driven allocation of aviation assets."
      }
    ],
    "resolution": "The European Parliament raised the adoption of its position at first reading on the Commission’s proposal to codify existing legislation without introducing substantive changes, as confirmed by the Consultative Working Party of the legal services, which concluded the proposal merely consolidated prior acts and amendments without altering their substance. The resolution emphasized adherence to the Treaty on the Functioning of the European Union (Articles 294(2) and 100(2)) and called on the Commission to resubmit the proposal to Parliament if substantial revisions or replacements were planned. It instructed the President to communicate Parliament’s position to the Council, Commission, and national parliaments, ensuring transparency and procedural continuity in the legislative process.",
    "total_score": 0.7493368700265252,
    "total_choice": 7,
    "party_num": 2,
    "id": 0,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.8,
      0.2
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "transport & tourism",
    "title": "Alternative fuels infrastructure: REPORT on the proposal for a directive of the European Parliament and of the Council on the deployment of alternative fuels infrastructure",
    "background": "The European Union faced high transport sector reliance on imported oil, significant greenhouse gas emissions, and energy security challenges, prompting initiatives to diversify energy sources and reduce environmental impact. The Parliament will discuss regulatory measures to develop infrastructure supporting alternative fuels adoption across member states.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.9482758620689655,
        "choice": 9,
        "stance": "GREEN_EFA firmly agrees the technical harmonization provisions for charging infrastructure as foundational to achieving seamless EU-wide electric mobility integration.  \nGREEN_EFA perfectly aligns with the issue's emphasis on binding national infrastructure targets while advocating for future revisions to incorporate renewable energy sourcing requirements.  \nGREEN_EFA highlights enhancement opportunities to explicitly tie infrastructure deployment timelines to sectoral decarbonization benchmarks in subsequent implementation phases.  \nGREEN_EFA commends the mandatory interoperability standards as effectively advancing consumer confidence in low-emission transport systems.  \nGREEN_EFA urges post-adoption monitoring to address the current omission of public transport synergies, ensuring coherence with climate neutrality goals."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.5714285714285714,
        "choice": 5,
        "stance": "GUE_NGL supports the issue’s decarbonization aims while advising explicit differentiation between true zero-emission solutions (renewable electricity/hydrogen) and transitional fuels like methane-based natural gas.  \nGUE_NGL urges amending Article 4 to mandate binding lifecycle emission thresholds for any infrastructure labeled \"alternative,\" excluding fossil-derived natural gas from long-term incentives.  \nGUE_NGL emphasizes accelerating hydrogen standardization efforts, proposing a 2025 deadline for EU-wide compatibility protocols for refueling stations.  \nGUE_NGL advises revising Directive terminology to classify electricity as an \"energy carrier\" rather than a fuel, ensuring scientific coherence in policy frameworks.  \nGUE_NGL calls for reallocating 30% of natural gas infrastructure funds to hydrogen R&D and rural EV charging networks to prioritize genuinely sustainable systems."
      }
    ],
    "resolution": "The European Parliament raised its position on the Commission’s transport-related proposal (COM(2013)0018), grounded in Treaty Articles 294(2), 91, and 294(3), while incorporating input from the European Economic and Social Committee, the Committee of the Regions, and parliamentary committees on Transport and Tourism (report A7-0444/2013) and Industry, Research, and Energy. It formally adopted its first-reading stance, emphasizing the need for the Commission to resubmit the proposal to Parliament if intending significant amendments or replacement, and directed its President to transmit the adopted position to the EU Council, Commission, and national parliaments to ensure procedural continuity and institutional alignment.",
    "total_score": 0.8120104438642297,
    "total_choice": 8,
    "party_num": 2,
    "id": 1,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.2,
      0.8
    ],
    "veto_party_name": "GUE_NGL"
  },
  {
    "topic": "transport & tourism",
    "title": "European Maritime Safety Agency: REPORT on the proposal for a regulation of the European Parliament and of the Council amending Regulation (EC) No 1406/2002 establishing a European Maritime Safety Agency",
    "background": "Major offshore oil spills, including the 2010 Deepwater Horizon disaster and 2011 Gannet Alpha leak, highlighted risks to marine environments from oil and gas operations. Existing EU maritime safety frameworks focused on vessel-related pollution, while EMSA's mandate centered on ship safety and pollution response. The Parliament will discuss expanding EMSA's regulatory scope to address offshore installation safety and cross-border maritime challenges.",
    "stances": [
      {
        "party_name": "ALDE",
        "score": 0.8674698795180723,
        "choice": 8,
        "stance": "ALDE strongly promotes the enhanced coordination of maritime safety resources through EMSA’s expanded mandate, aligning perfectly with ALDE’s longstanding commitment to efficient, supranational solutions for transboundary environmental and security challenges.  \nALDE applauds the integration of satellite monitoring for anti-piracy operations, which effectively advances ALDE’s priority of leveraging innovation to strengthen maritime security and crisis response capabilities.  \nALDE proposes reinforcing regional actors’ inclusion in future disaster response frameworks, noting their proven effectiveness during incidents like the Prestige spill, to ensure localized expertise complements EU-level coordination.  \nALDE urges amendments to incorporate gender balance in EMSA’s governance structures, aligning with broader EU equality goals while maintaining strong backing for the agency’s operational modernization.  \nALDE endorses cross-border cooperation with Norway and Iceland, emphasizing that EMSA’s expanded assistance to neighboring states reflects shared maritime safety imperatives beyond EU borders."
      },
      {
        "party_name": "ECR",
        "score": 0.03636363636363636,
        "choice": 0,
        "stance": "ECR fundamentally disputes the expansion of EMSA's mandate into inland waterways and offshore installations, viewing it as unnecessary duplication of existing national and international efforts.  \nECR rejects the creation of a European coastguard service, asserting that national coastguards already cooperate effectively and additional EU structures are redundant.  \nECR highlights that extending EMSA's competencies to oil/gas platform inspections contradicts the principle of subsidiarity, as member states already maintain rigorous monitoring systems.  \nECR criticizes the proposal's failure to address budgetary impacts, particularly during economic challenges, deeming expanded mandates unjustified without clear cost-benefit analysis."
      }
    ],
    "resolution": "The European Parliament raised the application of point 47 of the Interinstitutional Agreement of 17 May 2006 on budgetary discipline and sound financial management to the extension of tasks of the European Maritime Safety Agency (EMSA), emphasizing that such extensions must not preempt decisions by the budgetary authority during annual budget procedures. It adopted its first-reading position on the Commission’s 2010 proposal (COM(2010)0611) and stressed the need for the Commission to re-engage Parliament if intending to substantially amend or replace the proposal, ensuring continued legislative oversight. The resolution underscored adherence to Treaty provisions (Article 100(2) TFEU) and procedural frameworks while prioritizing budgetary neutrality and institutional accountability in expanding EMSA’s mandate.",
    "total_score": 0.7148541114058355,
    "total_choice": 7,
    "party_num": 2,
    "id": 2,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.6,
      0.4
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "transport & tourism",
    "title": "European statistics on tourism: REPORT on the proposal for a regulation of the European Parliament and of the Council concerning European Statistics on tourism",
    "background": "The European Union's tourism sector, contributing 5% to GDP, operated under a 1995 statistical framework outdated by global competition, digital booking trends, and new Treaty of Lisbon competences. The Parliament will discuss modernizing regulations for harmonized tourism statistics to address evolving industry dynamics and inform policy development.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.916030534351145,
        "choice": 9,
        "stance": "EPP completely accepts the updated tourism statistics framework as perfectly aligning with its commitment to data-driven economic growth, particularly through inclusion of same-day visit metrics and tourist expenditure tracking.  \nEPP perfectly supports the issue’s focus on accessibility data for reduced mobility, reflecting its longstanding prioritization of inclusive social policies within market modernization.  \nEPP unequivocally backs the harmonized statistical methodology, recognizing its critical role in maintaining Europe’s global tourism leadership through comparable cross-border insights.  \nEPP endorses the delegated act provisions as a balanced mechanism to ensure legislative agility while preserving parliamentary oversight, consistent with its transparency principles.  \nEPP affirms the regulation’s strategic synergy with EU tourism competitiveness goals, particularly in enabling targeted regional development through granular expenditure and mobility analytics."
      },
      {
        "party_name": "SD",
        "score": 0.9619565217391305,
        "choice": 9,
        "stance": "SD completely advocates the regulation's mandate for harmonized tourism statistics, particularly the inclusion of social tourism metrics, which aligns perfectly with SD's commitment to addressing social equity and regional development through accessible travel opportunities.  \nSD perfectly aligns with the issue's expansion of statistical criteria to encompass environmental impact assessments and accessibility standards, advancing sustainable tourism practices as outlined in SD's 2020 policy agenda.  \nSD highlights the regulation's potential to standardize workforce data collection, including seasonal employment and training qualifications, which directly supports SD's advocacy for quality job creation in SMEs.  \nSD applauds the integration of tourism satellite accounts into EU statistical frameworks, a move that effectively advances evidence-based policymaking for one of Europe's most critical economic sectors.  \nSD underscores the issue’s focus on EU funding transparency in tourism sectors, reinforcing SD’s longstanding priority of aligning public expenditure with social and economic cohesion goals."
      }
    ],
    "resolution": "The European Parliament raised its position at first reading on the Commission’s transport and tourism proposal (COM(2010)0117), grounded in the Committee on Transport and Tourism’s report (A7‑0329/2010), to formalize its stance under relevant Treaty provisions. It urged the Commission to resubmit the proposal to Parliament if substantial amendments or a replacement text are planned, ensuring legislative transparency and procedural adherence. The Parliament further directed its President to transmit its adopted position to the Council, the Commission, and national parliaments, reinforcing inter-institutional communication and alignment. The resolution emphasized procedural continuity while focusing on the substantive handling of the proposal, omitting specific voting or amendment details.",
    "total_score": 0.8637602179836512,
    "total_choice": 8,
    "party_num": 2,
    "id": 3,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.5,
      0.5
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "transport & tourism",
    "title": "European transport-technology strategy for Europe's future sustainable mobility: REPORT on promoting a European transport-technology strategy for Europe’s future sustainable mobility",
    "background": "The EU has established transport sustainability goals through the Europe 2020 strategy, Horizon 2020 framework, and 2011 White Paper, aiming to reduce emissions, improve energy efficiency, and enhance safety amid persistent environmental, infrastructural, and innovation challenges. The Parliament will discuss a coordinated transport-technology strategy to advance sustainable mobility and cross-regional connectivity.",
    "stances": [
      {
        "party_name": "SD",
        "score": 0.8512820512820513,
        "choice": 8,
        "stance": "SD strongly approves the issue’s focus on reducing regional disparities through cross-border infrastructure and intermodality, aligning perfectly with S&D’s commitment to territorial cohesion and inclusive growth.  \nSD approves the establishment of a transport R&I monitoring system, proposing that regional decision-makers receive free, real-time data to enhance EU fund accessibility and reduce implementation delays.  \nSD applauds the prioritization of disadvantaged regions, such as islands and remote areas, which directly advances S&D’s goals of equitable resource distribution and social justice in mobility policies.  \nSD highlights the necessity of integrating labor mobility into sustainable transport planning, reinforcing economic integration and strengthening cross-border workforce collaboration.  \nSD emphasizes the importance of simplifying funding mechanisms for SMEs, a cornerstone of S&D’s advocacy for innovation-driven, grassroots economic development."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.7142857142857143,
        "choice": 7,
        "stance": "GUE_NGL strongly endorses the issue's emphasis on sustainable mobility systems and intelligent transport solutions, aligning with their commitment to ecological transition and public service principles.  \nGUE_NGL proposes strengthening Article 14 to explicitly safeguard public transport funding against austerity measures, citing Portugal’s 20% usage decline as a cautionary example requiring preventive clauses.  \nGUE_NGL applauds the focus on intermodality and zero-emission technologies as critical to advancing climate justice, matching their manifesto priorities for decarbonized public infrastructure.  \nGUE_NGL highlights the need to amend Paragraph 32 to mandate affordability benchmarks for public transport pricing, ensuring accessibility aligns with the issue’s inclusivity goals.  \nGUE_NGL urges integrating enforceable anti-privatization safeguards in cross-border infrastructure projects to prevent service fragmentation contradicting sustainability targets."
      }
    ],
    "resolution": "The European Parliament raised the critical need for a European transport-technology strategy to achieve sustainable, safe, and resource-efficient mobility, aligning with EU 2020 targets, including 20% reductions in greenhouse gas emissions, renewable energy share, and energy efficiency by 2020, alongside halving road deaths compared to 2001 levels. It emphasized prioritizing research and innovation (R&I) to address environmental challenges, reduce traffic noise, air pollutants, and energy consumption, and enhance road safety, noting over 31,000 fatalities and 1.5 million injuries in EU road accidents in 2012. The resolution called for adequate funding of Horizon 2020, support for SMEs through simplified funding access, and technology-neutral policies to avoid market distortions, while promoting intermodality, cross-border infrastructure, and regional inclusivity, particularly for disadvantaged areas like islands and remote regions. It advocated for intelligent transport systems (ITS), zero-emission maritime technologies, sustainable urban mobility plans, and incentives for cycling, walking, and public transport. The Parliament stressed integrating user perspectives via tools like TRIMIS, harmonizing vehicle standards, and internalizing transport costs through \"polluter pays\" principles. It urged EU institutions to lead by example in sustainable mobility management and highlighted the role of regional authorities in deploying innovation, smart specialization, and EU funds to bridge infrastructure gaps and foster territorial cohesion.",
    "total_score": 0.7924281984334204,
    "total_choice": 7,
    "party_num": 2,
    "id": 4,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.5,
      0.5
    ],
    "veto_party_name": "GUE_NGL"
  },
  {
    "topic": "transport & tourism",
    "title": "External aviation policy: REPORT on the EU’s External Aviation Policy – Addressing future challenges",
    "background": "The EU’s external aviation policy, established in 2005, faced evolving global competition, job losses in European airlines, delays in Single European Sky implementation, and emerging market growth in Asia and the Middle East. The Parliament will discuss strengthening the policy to address market access, fair competition, and regulatory alignment with international partners.",
    "stances": [
      {
        "party_name": "ALDE",
        "score": 0.8780487804878049,
        "choice": 8,
        "stance": "ALDE strongly promotes the issue's emphasis on fair competition clauses in aviation agreements, aligning perfectly with ALDE's commitment to addressing market distortions caused by state-subsidized carriers like Emirates.  \nALDE approves the push for comprehensive agreements with Gulf states and key global markets, effectively advancing ALDE's priority of reciprocal market access and economic integration.  \nALDE urges binding implementation timelines for the Single European Sky, proposing enhanced technical coordination to eliminate inefficient flight paths and achieve the ecological benefits outlined in ALDE's sustainability agenda.  \nALDE highlights the necessity of regulatory alignment in international negotiations, strongly promoteing measures to protect European airlines' competitiveness through harmonized standards and fair taxation.  \nALDE emphasizes accelerating infrastructure modernization to reduce congestion, endorsing the issue's focus on regional connectivity as critical to ALDE's growth-oriented policies."
      },
      {
        "party_name": "SD",
        "score": 0.9128205128205128,
        "choice": 9,
        "stance": "SD totally accepts the issue’s prioritization of comprehensive aviation agreements with strategic partners like Ukraine and Tunisia, perfectly aligning with SD’s vision for expanding EU market access and regional connectivity.  \nSD perfectly aligns with the issue’s demand for fair competition clauses to counter non-EU carriers’ state subsidies, reflecting SD’s longstanding advocacy against market-distorting practices.  \nSD totally accepts the urgency of concluding agreements with Turkey, Armenia, and Libya, emphasizing the issue’s call for proactive diplomacy to unlock economic opportunities.  \nSD highlights the issue’s alignment with SD’s commitment to job creation, particularly through replicating the success of the EU-US agreement that generated 80,000 jobs.  \nSD emphasizes the issue’s critical focus on addressing Gulf carriers’ unfair advantages as an enhancement opportunity to solidify global competitiveness, mirroring SD’s anti-subsidy campaigns."
      }
    ],
    "resolution": "The European Parliament raised the importance of a cohesive EU external aviation policy to enhance global competitiveness, economic growth, and employment, noting the sector supports over 5 million jobs and contributes 2.4% to EU GDP. It highlighted progress in initiatives like the Single European Sky (SES), SESAR, and EU-US Air Transport Agreement, which created 80,000 jobs, but expressed concern over SES delays and urged punitive measures against non-compliant Member States. The resolution stressed challenges from non-EU carriers benefiting from subsidies, unfair practices, and infrastructure investments in Asia, the Middle East, and South America, while calling for fair competition clauses in agreements and reciprocity in market access. It emphasized the need to address disparities in taxes, airport charges, and social standards, particularly criticizing low-cost carriers for undermining labor rights despite holding 40% of the EU market. The Parliament urged concluding comprehensive agreements with Brazil, Australia, China, India, and Gulf states, addressing Russian overflight fees violating international law, and strengthening ICAO’s role in global emissions and safety standards. It advocated for regulatory alignment, consumer rights, and social impact assessments in aviation negotiations, while promoting regional airports and infrastructure investments to alleviate congestion and boost connectivity. The resolution also called for revised trade defense instruments, transparency in Gulf state negotiations, and enforcement of ILO labor standards to protect workers amid market liberalization.",
    "total_score": 0.8496732026143791,
    "total_choice": 8,
    "party_num": 2,
    "id": 5,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.5,
      0.5
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "transport & tourism",
    "title": "Aerodromes, air traffic management and air navigation services: REPORT on the proposal for a regulation of the European Parliament and of the Council amending Regulation (EC) No 216/2008 in the field of aerodromes, air traffic management and air navigation services",
    "background": "Fragmented European airspace management caused inefficiencies, delays, higher operational costs compared to global counterparts, and environmental concerns due to suboptimal flight routes. Existing Single European Sky regulations (SES I/II) faced implementation challenges in harmonising national systems. The Parliament will discuss regulatory amendments to enhance air traffic efficiency, safety standards, and operational integration across member states.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.9482758620689655,
        "choice": 9,
        "stance": "GREEN_EFA perfectly aligns with the issue’s emphasis on cross-border airspace cooperation, recognizing its critical role in reducing emissions through optimized flight routes.  \nGREEN_EFA fundamentally sanctions the rejection of rigid service separation mandates, affirming that context-specific governance models better serve both efficiency and sovereignty concerns.  \nGREEN_EFA highlights the need to enhance democratic scrutiny of delegated acts, proposing strengthened parliamentary oversight mechanisms to prevent regulatory overreach.  \nGREEN_EFA applauds the issue’s alignment with functional airspace block progress, particularly its indirect support for reducing military airspace restrictions as a climate mitigation measure.  \nGREEN_EFA emphasizes that the issue’s procedural rigor under Article 100(2) TFEU advances their vision of EU-wide ecological standardization in aviation governance."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.0,
        "choice": 0,
        "stance": "GUE/NGL rejects the proposal as fully disputeing with their opposition to ultraliberal aviation policies that prioritize corporate interests over public safety and workers' rights.  \nGUE/NGL opposes the dismantling of national air traffic control structures, which would privatize critical services and risk safety through underpaid, precarious labor conditions.  \nGUE/NGL condemns the market-driven approach to airspace management as incompatible with their commitment to public ownership and sovereignty over strategic transport infrastructure.  \nGUE/NGL highlights the proposal’s failure to address safety risks from fragmented navigation services, directly contradicting their demand for rigorous aviation safety standards.  \nGUE/NGL rejects the issue’s alignment with airline industry deregulation, which threatens thousands of jobs in peripheral EU states and undermines environmental sustainability goals."
      }
    ],
    "resolution": "The European Parliament raised its position on the Commission’s 2013 legislative proposal (COM(2013)0409) concerning transport and tourism policy, while addressing a subsidiarity objection from the Maltese House of Representatives. The resolution adopted Parliament’s first-reading stance, urged the Commission to re-engage Parliament if proposing significant amendments, and mandated the transmission of its position to the Council, Commission, and national parliaments. It incorporated input from the Committee on Transport and Tourism’s report and acknowledged the European Economic and Social Committee’s 2013 opinion, emphasizing procedural adherence to Treaty obligations under Article 100(2) TFEU.",
    "total_score": 0.8015665796344648,
    "total_choice": 8,
    "party_num": 2,
    "id": 6,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.2,
      0.8
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "transport & tourism",
    "title": "Electronic toll service and vignette system on light private vehicles: REPORT on a strategy for an electronic toll service and a vignette system on light private vehicles in Europe",
    "background": "Persistent challenges in achieving interoperability among national electronic toll systems, declining fuel tax revenues, and fragmented road charging approaches across EU Member States prompted calls for coordinated infrastructure funding solutions. The Parliament will discuss strategies to implement a harmonized electronic toll service and vignette system for light private vehicles across Europe.",
    "stances": [
      {
        "party_name": "EFD",
        "score": 0.1935483870967742,
        "choice": 1,
        "stance": "EFD rejects the issue's reliance on satellite-based toll systems as completely condemning with EFD's principle of protecting citizens' privacy rights against state surveillance.  \nEFD opposes the prioritization of distance-based tolling for private vehicles, highlighting its inconsistency with EFD's demand for phased implementation starting exclusively with freight transport.  \nThe proposal overlooks critical aspects such as public acceptance of personal movement tracking, which EFD considers a red line for individual liberty protections.  \nEFD condemns the issue's enforcement mechanisms as disproportionate state interference, contradicting subsidiarity principles central to EFD's platform.  \nThis approach fails to address EFD's core concern that mandatory EU-wide electronic tolling creates irreversible infrastructure for mass vehicular monitoring."
      },
      {
        "party_name": "SD",
        "score": 0.8421052631578947,
        "choice": 8,
        "stance": "SD strongly upholds the enforcement of legislative measures to eliminate member state inertia, aligning perfectly with SD’s commitment to fair cross-border mobility and infrastructure equity.  \nSD endorses the issue’s prioritization of distance-based tolling over vignettes, effectively advancing SD’s principle of non-discrimination against non-resident drivers and border communities.  \nSD applauds the mandate for interoperable GPS/GNSS systems and simplified mobile payments, which aligns with SD’s digital innovation agenda for seamless EU-wide services.  \nSD emphasizes the urgency of ring-fencing toll revenues for sustainable transport infrastructure, consistent with SD’s climate neutrality goals and Just Transition priorities.  \nSD proposes amending Article 4 to include biannual Commission implementation reviews, enhancing accountability while fully supporting the issue’s 2013 deadline for interoperability studies."
      }
    ],
    "resolution": "The European Parliament raised concerns over the failure of the European Electronic Toll Service (EETS) to achieve interoperability, citing insufficient stakeholder incentives, lack of political will, and the inadequacy of a market-driven approach. It urged the Commission to enforce legislative measures, including sanctions for non-compliant Member States, and to propose an incentive scheme to accelerate EETS implementation, emphasizing the need for interoperability using existing technologies like GPS/GNSS while ensuring compliance with EU data protection rules. The resolution stressed prioritizing distance-based tolling over time-based vignettes to ensure fairness and non-discrimination, particularly for non-residents and border regions, and called for simplified, transparent payment systems, including mobile and online options, with vignettes purchasable up to 30 days in advance. It highlighted the urgency of coordinated action as more Member States plan road charges for light vehicles, advocating ring-fenced revenues for sustainable infrastructure and opposing extra charges on SMEs and haulage companies. The Parliament demanded a Commission review of interoperability studies by end-2013, infrastructure signage improvements, and infringement proceedings for discriminatory toll systems, while affirming Member States’ rights to set charges but urging alignment with EU-wide goals to prevent fragmentation and uphold free movement principles.",
    "total_score": 0.6843501326259946,
    "total_choice": 6,
    "party_num": 2,
    "id": 7,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.3,
      0.7
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "transport & tourism",
    "title": "Community guidelines for the development of the trans-European transport network (recast): REPORT on the proposal for a decision of the European Parliament and of the Council on Community guidelines for the development of the trans-European transport network (recast)",
    "background": "The European Commission proposed recasting the Trans-European Transport Network (TEN-T) guidelines to consolidate prior amendments and address technical inaccuracies following the 2004 EU enlargement, which expanded the network’s geographic scope. The Parliament will discuss updating the TEN-T framework to align with institutional reforms and integrate new Member States’ infrastructure.",
    "stances": [
      {
        "party_name": "EFD",
        "score": 0.5806451612903226,
        "choice": 5,
        "stance": "EFD supports the codification of transport network guidelines while advising explicit recognition of eastern connectivity projects like the Čierna nad Tisou-Vienna broad-gauge railway extension.  \nEFD proposes amending Annex II to prioritize transcontinental rail links aligning with Asian trade growth, ensuring future funding mechanisms accommodate such strategic corridors.  \nEFD highlights the economic imperative of integrating Danube ports with eastern rail routes, urging procedural transparency clauses to include cross-border infrastructure consultations.  \nEFD advises strengthening Resolution Clause 7 to mandate periodic reviews of eastward network expansions, reflecting evolving trade dynamics with China and India.  \nEFD underscores the need for coherence between EU infrastructure planning and global supply chain demands, suggesting non-binding recitals reference Eurasian connectivity opportunities."
      },
      {
        "party_name": "SD",
        "score": 0.9032258064516129,
        "choice": 9,
        "stance": "SD completely advocates the codification process as perfectly aligning with their commitment to procedural transparency and legislative stability in trans-European infrastructure planning.  \nSD perfectly supports the issue’s institutional cooperation framework, emphasizing its role in advancing integrated transport corridors like the Pyrenees low-level tunnel and Mediterranean linkages.  \nSD highlights the necessity of maintaining existing TEN-T guidelines to ensure calculability for Member States, while preparing for future expansions such as Black Sea maritime routes and Ukraine-Moldova road connections.  \nSD underscores the urgency of developing high-speed rail networks and inland waterways, framing these priorities as natural extensions of the issue’s unchanged provisions.  \nSD stresses the critical alignment between the issue’s procedural safeguards and timely Commission communications on methodology, ensuring cohesion in upcoming network revisions."
      }
    ],
    "resolution": "The European Parliament raised its position on a Commission proposal concerning the codification of existing legal texts without substantive changes, as confirmed by the Consultative Working Party of the legal services of the EU institutions, which concluded the proposal merely consolidated earlier acts without altering their substance. The resolution endorsed the codification process, emphasizing adherence to procedural transparency and institutional cooperation, and called on the Commission to resubmit the matter to Parliament if it substantially amends or replaces the proposal. It further instructed the Parliament’s President to formally communicate its adopted position to the Council, Commission, and national parliaments, ensuring alignment with the Treaty on the Functioning of the EU and maintaining legislative coherence across unchanged provisions.",
    "total_score": 0.8383152173913043,
    "total_choice": 8,
    "party_num": 2,
    "id": 8,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.3,
      0.7
    ],
    "veto_party_name": "EFD"
  },
  {
    "topic": "transport & tourism",
    "title": "Compensation and assistance to passengers in the event of denied boarding and of cancellation or long delay of flights: REPORT on the proposal for a regulation of the European Parliament and of the Council amending Regulation (EC) No 261/2004 establishing common rules on compensation and assistance to passengers in the event of denied boarding and of cancellation or long delay of flights and Regulation (EC) No 2027/97 on air carrier liability in respect of the carriage of passengers and their baggage by air",
    "background": "Persistent inconsistencies in applying EU air passenger rights regulations, including varied enforcement, ambiguous exemptions for extraordinary circumstances, and operational disruptions affecting compensation claims, prompted legal challenges and calls for clarity. The Parliament will discuss amending rules on compensation and assistance for denied boarding, cancellations, or delays to address enforcement gaps and passenger protection.",
    "stances": [
      {
        "party_name": "SD",
        "score": 0.8769230769230769,
        "choice": 8,
        "stance": "SD strongly upholds the strict limitation of \"extraordinary circumstances\" definitions to prevent airline abuse of technical issues, aligning perfectly with SD's consumer protection priorities.  \nSD applauds the introduction of delay compensation rights as critical progress in passenger justice, effectively advancing SD's manifesto commitment to traveler dignity.  \nSD endorses enhanced transparency through mandatory all-inclusive pricing displays and airport assistance points, matching SD's decade-long push against hidden fees.  \nSD proposes strengthening accessibility provisions by requiring immediate wheelchair/special equipment return post-flight to fully uphold disabled passengers' rights.  \nSD emphasizes the issue's alignment with SD's transport equity agenda through binding airline liability for cancellations and simplified claims procedures."
      },
      {
        "party_name": "ECR",
        "score": 0.2982456140350877,
        "choice": 2,
        "stance": "ECR entirely condemns the issue's exclusion of Gibraltar from passenger rights protections, conflicting with their principle of equal treatment for all EU citizens.  \nECR rejects the regulation’s failure to prohibit airlines from denying return flights due to unused outbound segments, contradicting fair contractual obligations.  \nECR opposes the ambiguous definition of \"extraordinary circumstances,\" which inadequately excludes technical maintenance failures despite carriers’ operational responsibilities.  \nECR rejects the proposal’s potential to increase airfare costs through excessive consumer safeguards, inconsistent with market efficiency priorities.  \nECR entirely condemns the lack of explicit requirements for passenger disembarkation during prolonged tarmac delays, disregarding basic dignity protections."
      }
    ],
    "resolution": "The European Parliament raised its position on the Commission’s 2013 proposal (COM(2013)0130) concerning transport-related regulations under Treaty Articles 294(2) and 100(2), informed by the Committee on Transport and Tourism’s report (A7-0020/2014) and the Committee on the Internal Market and Consumer Protection’s opinion. It adopted its first-reading stance, emphasizing the need for alignment with internal market and consumer protection principles, and urged the Commission to re-engage Parliament if proposing substantial amendments to the original text. The resolution further instructed the President to communicate Parliament’s position to the Council, Commission, and national parliaments, ensuring procedural continuity while prioritizing substantive coherence with EU treaty frameworks and stakeholder consultations, including the European Economic and Social Committee’s 2013 opinion.",
    "total_score": 0.7571801566579635,
    "total_choice": 7,
    "party_num": 2,
    "id": 9,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.5,
      0.5
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "transport & tourism",
    "title": "Aviation security charges: REPORT on the proposal for a directive of the European Parliament and of the Council on aviation security charges",
    "background": "Following the 2001 establishment of EU-wide aviation security measures, divergent national approaches to financing security costs led to inconsistent charges across member states. The Parliament will discuss a proposed directive to standardize aviation security charge regulations, addressing transparency, non-discrimination, and cost-related fee structures for airport operators and airlines.",
    "stances": [
      {
        "party_name": "EFD",
        "score": 0.5483870967741935,
        "choice": 5,
        "stance": "EFD supports the transparency framework for aviation charges but advises amending cost-allocation clauses to strictly limit charges to demonstrably incurred security expenses.  \nEFD endorses harmonized EU security standards to prevent market fragmentation while cautioning against redundant oversight bodies that could inflate operational costs.  \nEFD emphasizes the need for explicit passenger-facing breakdowns of security charges, aligning with their principle of eliminating \"jungle-like\" hidden fees.  \nEFD approves the issue’s rejection of national surcharges but proposes a compliance mechanism to audit operators’ cost claims against actual security investments.  \nEFD concurs with preventing profit-driven exploitation of security mandates but suggests sunset clauses for fee structures to ensure ongoing cost-benefit alignment."
      },
      {
        "party_name": "ALDE",
        "score": 0.9047619047619048,
        "choice": 9,
        "stance": "ALDE firmly agrees the issue's mandate for transparent breakdowns of aviation security charges, aligning perfectly with their commitment to consumer rights and fiscal accountability.  \nALDE applauds the directive's requirement that security charges be strictly allocated to actual security measures, preventing misuse of passenger funds.  \nALDE emphasizes the necessity for Member States to finance any security enhancements exceeding EU standards, upholding national responsibility in aviation safety.  \nALDE supports the harmonized approach to charge structures while respecting Member States' operational autonomy, ensuring proportionality in security investments.  \nALDE recognizes the issue as a critical advancement in clarifying passenger cost obligations, reinforcing trust in EU aviation governance frameworks."
      }
    ],
    "resolution": "The European Parliament raised its position on a legislative proposal concerning transport policy, adopting its first reading stance under the Treaty on the Functioning of the EU (Article 100(2)) and emphasizing procedural alignment with the post-Lisbon Treaty framework. It endorsed the Commission’s original proposal (COM(2009)0217) while urging the Commission to resubmit the matter to Parliament if substantial amendments or a replacement text were planned, ensuring continued interinstitutional coherence. The resolution reflected input from the European Economic and Social Committee’s November 2009 opinion and was informed by the Committee on Transport and Tourism’s report (A7‑0035/2010). Parliament instructed its President to formally transmit its adopted position to the Council, Commission, and national parliaments, reinforcing transparency and adherence to legislative procedures under the EU’s ordinary legislative process.",
    "total_score": 0.8328804347826086,
    "total_choice": 8,
    "party_num": 2,
    "id": 10,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.1,
      0.9
    ],
    "veto_party_name": "EFD"
  },
  {
    "topic": "transport & tourism",
    "title": "Deployment of the interoperable EU-wide eCall: REPORT on the proposal for a decision of the European Parliament and of the Council on the deployment of the interoperable EU-wide eCall",
    "background": "Persistent road safety challenges and insufficient voluntary adoption of emergency call technology prompted the European Commission's 2013 proposal for mandatory vehicle-integrated eCall systems using the EU-wide 112 emergency number, requiring cross-border infrastructure coordination. The Parliament will discuss establishing interoperable eCall deployment standards to improve emergency response efficiency and reduce traffic accident fatalities.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.017241379310344827,
        "choice": 0,
        "stance": "GREEN_EFA rejects the mandatory eCall system as totally condemning with their principles of proportionality and data protection, emphasizing unresolved tracking risks under Article 5.  \nGREEN_EFA opposes the issue's industry-centric approach, highlighting its inconsistency with consumer protection priorities stated in the Internal Market Committee's mandate.  \nGREEN_EFA condemns the proposal for diverting funds from proven safety measures like speed limit enforcement, which the Transport Committee failed to prioritize.  \nGREEN_EFA challenges the legislative intent's coherence by demonstrating how automated eCall fails to address infrastructure gaps and ambulance response times cited in recital 12.  \nGREEN_EFA fundamentally disputes the proportionality justification, noting the issue's omission of hacking vulnerabilities despite Parliament's 2013 cybersecurity directives."
      },
      {
        "party_name": "SD",
        "score": 0.882051282051282,
        "choice": 8,
        "stance": "SD strongly agrees the mandatory 112-linked eCall system as a public safety imperative, aligning with their commitment to reduce road fatalities through rapid emergency response while maintaining strict data privacy safeguards.  \nSD approves the 2015 deadline for PSAP infrastructure upgrades, urging member states to prioritize technical readiness to ensure seamless pan-EU interoperability as outlined in Articles 4-6.  \nSD proposes supplementing the issue with binding awareness campaigns to educate citizens on eCall’s dormant functionality, addressing concerns about low public familiarity raised during committee deliberations.  \nSD endorses the prohibition of non-essential data collection, emphasizing that the adopted privacy-by-design approach effectively prevents unauthorized tracking as demanded in their 2014 transport manifesto.  \nSD applauds the issue’s cost-benefit alignment, noting projected annual savings of €26 billion through reduced medical and congestion costs directly advance social welfare priorities."
      }
    ],
    "resolution": "The European Parliament raised its position on the Commission’s 2013 proposal (COM(2013)0315) concerning transport policy, adopting its first-reading stance to advance legislative procedures under Article 91 of the Treaty on the Functioning of the EU. It emphasized the need for the Commission to re-engage Parliament if proposing significant amendments or alternative texts, ensuring alignment with legislative intent. The resolution reflected input from the Committee on Transport and Tourism, alongside opinions from the Committees on Industry, Research and Energy and the Internal Market and Consumer Protection, underscoring cross-sectoral priorities. Parliament instructed its President to formally transmit its adopted position to the Council, Commission, and national parliaments, reinforcing procedural transparency and interinstitutional coordination. The resolution aimed to uphold parliamentary oversight while advancing policy coherence in EU transport initiatives.",
    "total_score": 0.7023498694516971,
    "total_choice": 7,
    "party_num": 2,
    "id": 11,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.9,
      0.1
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "transport & tourism",
    "title": "Dimensions and weights of road vehicles circulating within the Community: REPORT on the proposal for a directive of the European Parliament and of the Council amending Directive 96/53/EC of 25 July 1996 laying down for certain road vehicles circulating within the Community the maximum authorised dimensions in national and international traffic and the maximum authorised weights in international traffic",
    "background": "The 1996 EU Directive on road vehicle dimensions and weights faced calls for revision due to technological advancements in vehicle design, evolving environmental standards, and divergent national regulations on cross-border transport operations, alongside infrastructure compatibility and road safety concerns raised by member states. The Parliament will discuss updating EU-wide standards for road vehicle dimensions and weights to align with current transport efficiency, environmental, and safety objectives.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.9482758620689655,
        "choice": 9,
        "stance": "GREEN_EFA absolutely promotes the issue’s explicit rejection of cross-border Gigaliner expansion, perfectly aligning with their commitment to road safety and infrastructure preservation.  \nGREEN_EFA perfectly aligns with the issue’s safeguards against modal shift to road transport, advancing their goal of prioritizing rail freight over environmentally harmful trucking.  \nGREEN_EFA applauds the issue’s emphasis on binding safety standards for vehicle design, including aerodynamic improvements and enhanced visibility features long championed by the party.  \nGREEN_EFA strongly advocates the issue’s fiscal responsibility by preventing public subsidy of infrastructure adaptations for oversized vehicles, a core budget neutrality principle.  \nGREEN_EFA endorses the requirement for rigorous environmental impact assessments before regulatory changes, ensuring future proposals meet climate neutrality targets."
      },
      {
        "party_name": "ECR",
        "score": 0.5614035087719298,
        "choice": 5,
        "stance": "ECR supports with suggestions the road safety improvements in cab design but advises revising Article 4 to maintain member states’ autonomy on cross-border ecocombi deployment under subsidiarity principles.  \nECR requests amending Clause 17 to remove the 2016 review deadline for longer vehicle policies, citing premature evaluation given existing bilateral agreements in Sweden and Finland.  \nECR advises incorporating evidence from Dutch ecocombi trials demonstrating zero infrastructure costs to counterbalance unsubstantiated claims in Recital 22 about required investments.  \nECR slightly upholds height restrictions in Annex II but urges exemptions for UK-Ireland routes to prevent disproportionate operational disruptions.  \nECR highlights concerns about weight increases in Article 9, proposing stricter impact assessments on bridge integrity before national adoption."
      }
    ],
    "resolution": "The European Parliament raised its position on a legislative proposal concerning transport policy, adopting its first-reading stance to advance the legislative process. It emphasized the need for the Commission to re-engage Parliament if substantial amendments or alternative texts are proposed, ensuring procedural transparency and institutional accountability. The resolution underscored the Parliament’s role in shaping EU transport legislation, aligning with the Committee on Transport and Tourism’s 2014 report (A7-0256/2014) and reflecting prior consultations, including the European Economic and Social Committee’s 2013 opinion. The Parliament directed its President to formally communicate its adopted position to the Council, Commission, and national parliaments, reinforcing inter-institutional dialogue and adherence to Treaty obligations under Article 294(3) and Article 91 of the TFEU.",
    "total_score": 0.7911227154046997,
    "total_choice": 7,
    "party_num": 2,
    "id": 12,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.2,
      0.8
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "transport & tourism",
    "title": "Further development of an integrated maritime policy: REPORT on the proposal for a regulation of the European Parliament and of the Council establishing a Programme to support the further development of an Integrated Maritime Policy",
    "background": "The European Union’s maritime sectors, contributing significantly to GDP, required cross-sectoral coordination under the 2007 Integrated Maritime Policy. Existing pilot projects highlighted gaps in governance, environmental protection, and economic synergies. The Parliament will discuss establishing a funding programme to enhance integrated maritime policy development and address sectoral challenges.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.8181818181818182,
        "choice": 8,
        "stance": "GREEN_EFA strongly promotes the allocation of EUR 40 million for integrated maritime policy development, particularly its focus on marine environment protection and illegal fishing detection as critical to ecological stewardship.  \nGREEN_EFA applauds the collaboration with the European Maritime Safety Agency and SafeSeaNet, recognizing this partnership as essential for advancing maritime safety and sustainable surveillance practices.  \nGREEN_EFA welcomes the issue’s cross-sectoral coherence in linking transport, fisheries, and regional development, aligning with their principles of holistic sustainability and economic cohesion.  \nGREEN_EFA proposes enhancing future funding mechanisms to prioritize climate-resilient maritime infrastructure while maintaining strong support for the current interim budget framework.  \nGREEN_EFA affirms the urgency of adopting sea-basin strategies as a proactive measure to address regional marine challenges, consistent with their advocacy for ecosystem-based governance."
      },
      {
        "party_name": "ECR",
        "score": 0.37037037037037035,
        "choice": 3,
        "stance": "ECR partly supports the maritime policy framework but requests revisions to Article 5 to include explicit safeguards against disproportionate regulatory burdens on national shipbuilding industries.  \nECR fully disputes the issue's failure to address infrastructure inequities, citing the Nord Stream pipeline's obstruction of Polish port development as inconsistent with EU cohesion principles under Article 174 TFEU.  \nECR demands amendment of funding allocation clauses to mandate 30% of the EUR 40 million stimulus fund be directed to vocational training programs for maritime careers, addressing workforce prestige concerns.  \nECR rejects any budgetary provisions allowing consultant expenditures, insisting on strict limitations to \"prevent theoretical strategizing\" and prioritize tangible green shipping technology investments.  \nECR highlights unresolved contradictions between the issue's environmental goals and existing energy infrastructure projects that disadvantage member states' maritime economies."
      }
    ],
    "resolution": "The European Parliament raised its position on a legislative proposal by adopting a resolution grounded in multiple Treaty provisions, including Articles 43(2) on agriculture, 91(1) on transport, 192(1) on environmental policy, and 194(2) on energy, while integrating input from committees on Transport and Tourism, Fisheries, Environment, and Regional Development. The resolution emphasized alignment with EU objectives in sustainability, economic cohesion, and cross-sectoral policy coherence, urging the Commission to resubmit the proposal if substantial amendments arise. It underscored legal bases spanning transport safety, environmental protection, regional development, and energy efficiency, reflecting a holistic approach to legislative harmonization across member states.",
    "total_score": 0.7350543478260869,
    "total_choice": 7,
    "party_num": 2,
    "id": 13,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.5,
      0.5
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "transport & tourism",
    "title": "Implementation of the Single European Sky: REPORT on the proposal for a regulation of the European Parliament and of the Council on the implementation of the Single European Sky (recast)",
    "background": "Persistent fragmentation of European air traffic management caused inefficiencies, high operational costs, delays, and environmental concerns despite prior SES initiatives. The European Commission proposed a recast regulation to address structural barriers and integrate airspace. The Parliament will discuss implementing the Single European Sky to enhance efficiency, safety, and sustainability in aviation.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.9310344827586207,
        "choice": 9,
        "stance": "GREEN_EFA completely approves the issue's rigorous adherence to subsidiarity principles, perfectly aligning with our foundational commitment to respecting national competencies in airspace sovereignty while advancing EU-wide coordination.  \nGREEN_EFA applauds the codification of existing legal frameworks as a critical safeguard against regulatory fragmentation, effectively advancing our priority of harmonized environmental and operational standards in aviation.  \nGREEN_EFA perfectly aligns with the issue's procedural rigor, particularly its compliance with Article 100(2) TFEU and the Interinstitutional Agreement, which fortify democratic accountability in delegated acts and prevent executive overreach.  \nGREEN_EFA strongly accepts the acknowledgment of improved airspace cooperation and reduced military restrictions, mirroring our advocacy for incremental, sovereignty-sensitive progress in trans-European transport efficiency.  \nGREEN_EFA commends the issue's rejection of ideologically driven service separation mandates, reinforcing our principle that member state-specific assessments must govern aviation service reforms."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.0,
        "choice": 0,
        "stance": "GUE_NGL rejects the SES 2+ proposal as completely rejecting with their commitment to public ownership of critical infrastructure and worker protections.  \nGUE_NGL opposes the issue's market-driven approach, warning it prioritizes airline profits over passenger safety through privatization of air traffic control.  \nThis proposal dangerously undermines national sovereignty in airspace management, contradicting GUE_NGL's principle of subsidiarity in transport policy.  \nThe issue's failure to address job precarity for aviation workers directly conflicts with GUE_NGL's labor rights agenda.  \nGUE_NGL condemns the lack of environmental safeguards in the proposal, highlighting its incompatibility with sustainable transport goals."
      }
    ],
    "resolution": "The European Parliament raised its position on the Commission’s 2013 legislative proposal (COM(2013)0410), affirming that the text constitutes a codification of existing legal provisions without substantive amendments, as confirmed by the Consultative Working Party of the legal services. It acknowledged Malta’s subsidiarity concerns, which argued the proposal overstepped national competencies, and noted the European Economic and Social Committee’s 2013 opinion. The resolution adopted Parliament’s first-reading position, urging the Commission to re-submit the proposal if intending significant changes and instructing the President to transmit the decision to the Council, Commission, and national parliaments. The process adhered to Treaty obligations (Article 100(2) TFEU) and emphasized procedural compliance, including the Interinstitutional Agreement on recasting legal acts, while maintaining the substance of prior legislation.",
    "total_score": 0.6383812010443864,
    "total_choice": 6,
    "party_num": 2,
    "id": 14,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.2,
      0.8
    ],
    "veto_party_name": "GUE_NGL"
  },
  {
    "topic": "transport & tourism",
    "title": "Maritime spatial planning and integrated coastal management: REPORT on the proposal for a directive of the European Parliament and of the Council establishing a framework for maritime spatial planning and integrated coastalmanagement",
    "background": "The EU’s extensive coastline, maritime economic significance (40% GDP), and rising cross-sectoral maritime activities (energy, shipping, tourism) prompted concerns over resource competition and ecosystem protection. The Parliament will discuss establishing a framework for coordinated maritime spatial planning and integrated coastal management to balance economic growth with environmental sustainability.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.017241379310344827,
        "choice": 0,
        "stance": "GREEN_EFA rejects the proposal's exclusion of binding Integrated Coastal Zone Management (ICZM) requirements, which completely condemns with their principle of holistic ecosystem protection.  \nGREEN_EFA opposes weakening ICZM provisions through ambiguous phrasing like \"where applicable,\" as this undermines enforceable safeguards for fragile coastal environments.  \nGREEN_EFA condemns the dilution of participatory decision-making frameworks, a critical omission inconsistent with their commitment to democratic environmental governance.  \nGREEN_EFA demands mandatory cross-border ICZM integration, rejecting the issue’s failure to address policy coherence between maritime and terrestrial planning.  \nGREEN_EFA highlights the proposal’s incompatibility with climate resilience goals, noting its silence on binding coastal adaptation measures aligned with the European Green Deal."
      },
      {
        "party_name": "SD",
        "score": 0.7384615384615385,
        "choice": 7,
        "stance": "SD strongly promotes the framework for cross-border maritime planning as a catalyst for sustainable blue growth, aligning with their commitment to job creation in emerging sectors like marine renewables.  \nSD approves the mandatory ecosystem-based approach to address Mediterranean environmental pressures, effectively advancing SD’s priority of balancing economic and ecological needs.  \nSD emphasizes the critical amendment ensuring free public access to coastal zones, preventing privatization while supporting recreational and cultural activities.  \nSD endorses the Adriatic-Ionian macro-regional strategy as a model for transnational cooperation, reflecting SD’s vision for policy coherence in maritime economies.  \nSD proposes strengthening Article 3 to explicitly define ecosystem thresholds for maritime zones, enhancing environmental safeguards without disrupting the directive’s core structure."
      }
    ],
    "resolution": "The European Parliament raised concerns regarding a 2013 Commission proposal (COM(2013)0133) on policies linked to transport, agriculture, environment, and energy, as outlined under relevant Treaty provisions. It highlighted objections from 10 national parliaments—Belgium, Germany, Ireland, Lithuania, the Netherlands, Poland, Finland, and Sweden—arguing the proposal violated subsidiarity principles. The resolution incorporated input from the Committee on Transport and Tourism, alongside opinions from the Environment and Fisheries committees, and referenced advisory positions from the European Economic and Social Committee and the Committee of the Regions. Parliament formally adopted its first-reading position, urging the Commission to resubmit the proposal if substantial revisions were planned, while emphasizing the need to align the legislation with EU competences and policy coherence across the affected sectors.",
    "total_score": 0.6135770234986945,
    "total_choice": 6,
    "party_num": 2,
    "id": 15,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.8,
      0.2
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "transport & tourism",
    "title": "Introduction of noise-related operating restrictions at European Union airports: REPORT on the proposal for a regulation of the European Parliament and of the Council on the establishment of rules and procedures with regard to the introduction of noise-related operating restrictions at Union airports within a Balanced Approach and repealing Directive 2002/30/EC of the European Parliament and of the Council",
    "background": "The European Commission proposed a regulation to replace Directive 2002/30/EC, addressing noise management at EU airports amid growing air traffic and varying national measures. The Parliament will discuss establishing harmonized rules for noise-related operating restrictions under the ICAO Balanced Approach framework.",
    "stances": [
      {
        "party_name": "SD",
        "score": 0.9267015706806283,
        "choice": 9,
        "stance": "SD completely agrees the harmonized procedural framework for noise-related operating restrictions, which perfectly aligns with their commitment to EU-wide environmental health standards while respecting subsidiarity through localized stakeholder negotiations.  \nSD applauds the issue's integration of public health considerations into aviation policy, advancing their manifesto priority for science-based environmental protections through standardized noise impact assessments.  \nSD strongly upholds the modernization of slot allocation mechanisms to optimize infrastructure use, recognizing this as complementary to noise reduction goals through efficient flight scheduling.  \nSD emphasizes the necessity of maintaining strict social conditionality clauses in parallel legislation to ensure worker protections remain integral to all airport service reforms.  \nSD acknowledges the issue's repeal of Directive 2002/30/EC as a critical evolution toward coherent EU aviation governance, eliminating redundant bureaucracy while preserving member states' operational flexibility."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.058823529411764705,
        "choice": 0,
        "stance": "GUE/NGL rejects the proposal's centralization of noise regulation authority under Article 10, demanding member states retain control over airport operating restrictions based on local conditions.  \nGUE/NGL opposes fundamentally the liberalization framework enabling wage suppression and precarious employment in ground services, citing degraded worker rights and passenger safety risks.  \nGUE/NGL condemns the issue's failure to prioritize health over profit, advocating mandatory operational restrictions as the primary noise mitigation measure.  \nGUE/NGL highlights the proposal's contradiction with social protections, noting monopolistic practices increase costs while eroding labor conditions and environmental safeguards.  \n While one member endorsed slot allocation reforms, GUE/NGL maintains overarching rejection due to unresolved worker exploitation and safety compromises."
      }
    ],
    "resolution": "The European Parliament raised its position on the Commission’s 2011 legislative proposal (COM(2011)0828) concerning transport infrastructure, emphasizing compliance with EU treaty principles and addressing objections from the French Senate, German Bundesrat, and Netherlands Senate, which argued the proposal violated subsidiarity by encroaching on national competencies. The resolution incorporated input from the Committee on Transport and Tourism and the Committee on the Environment, Public Health, and Food Safety, while acknowledging opinions from the European Economic and Social Committee and the Committee of the Regions. It formally adopted its stance, urged the Commission to re-engage Parliament if proposing significant amendments, and directed its President to communicate the position to the Council, Commission, and national parliaments to ensure alignment with EU legislative procedures and subsidiarity principles.",
    "total_score": 0.6644562334217506,
    "total_choice": 6,
    "party_num": 2,
    "id": 16,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.2,
      0.8
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "transport & tourism",
    "title": "Investigation and prevention of accidents and incidents in civil aviation: REPORT on the proposal for a regulation of the European Parliament and of the Council on investigation and prevention of accidents and incidents in civil aviation",
    "background": "The European Commission proposed updated regulations to strengthen civil aviation accident investigation and prevention frameworks, following Treaty of Lisbon implementation. The Parliament will discuss the legislative proposal to enhance aviation safety standards and institutional cooperation mechanisms.",
    "stances": [
      {
        "party_name": "EFD",
        "score": 0.6451612903225806,
        "choice": 6,
        "stance": "EFD supports the issue’s procedural rigor under Rule 55 and Treaty alignment, emphasizing their prioritization of institutional accountability in aviation safety frameworks.  \nEFD advises clarifying Article 100(2) implementation to mandate proportional consultation of all political groups during strike-related disruptions, ensuring sustained representativeness.  \nEFD endorses the integration of regional committee opinions, aligning with their advocacy for decentralized stakeholder input in EU transport policy.  \nEFD proposes amending the Commission’s re-engagement clause to include a 30-day consultation window with Parliament’s Transport Committee before submitting revised texts.  \nEFD highlights the need for explicit safeguards against procedural fragmentation during crises, urging periodic reviews of interinstitutional coordination mechanisms."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.9818181818181818,
        "choice": 9,
        "stance": "GREEN_EFA firmly approves the issue's harmonized accident investigation standards, perfectly aligning with their commitment to supranational aviation safety frameworks.  \nThe issue effectively advances GREEN_EFA's priority of preventing systemic failures through mandatory cross-border data sharing protocols.  \nGREEN_EFA's support for independent investigative bodies under Article 6 mirrors their 2023 manifesto pledge to depoliticize transport oversight."
      }
    ],
    "resolution": "The European Parliament raised its position on a legislative proposal concerning transport policy, grounded in the Commission’s 2009 proposal (COM(2009)0611) and aligned with Treaty provisions, including Article 100(2) of the Treaty on the Functioning of the European Union. It emphasized adherence to post-Lisbon Treaty procedures, referencing the Commission’s 2009 communication on interinstitutional processes (COM(2009)0665), and incorporated opinions from the European Economic and Social Committee and the Committee of the Regions. The resolution adopted Parliament’s first-reading stance, as outlined in the Committee on Transport and Tourism’s report (A7‑0195/2010), urging the Commission to re-engage Parliament if proposing substantial amendments or alternative texts. It further directed the Parliament’s President to transmit its position to the Council, Commission, and member state parliaments, ensuring procedural continuity under Rule 55 of its Rules of Procedure.",
    "total_score": 0.8206521739130435,
    "total_choice": 8,
    "party_num": 2,
    "id": 17,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.1,
      0.9
    ],
    "veto_party_name": "EFD"
  },
  {
    "topic": "transport & tourism",
    "title": "Groundhandling services at Union airports: REPORT on the proposal for a regulation of the European Parliament and of the Council on groundhandling services at Union airports and repealing Council Directive 96/67/EC",
    "background": "The European Commission's 2011 proposal to update EU groundhandling services regulations followed long-standing concerns about market efficiency and service quality under Directive 96/67/EC. The Parliament will discuss proposed revisions to groundhandling service regulations addressing competition frameworks, operational standards, and workforce protections at Union airports.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.05172413793103448,
        "choice": 0,
        "stance": "GREEN_EFA rejects the proposal's failure to prevent social dumping and degradation of airport workers' conditions, totally disapproveing with their commitment to fair labor standards.  \nGREEN_EFA opposes the attack on local noise regulations as dangerously inconsistent with WHO health guidelines and community-led environmental protections.  \nGREEN_EFA condemns the unnecessary liberalization push for multiple groundhandling operators, which disregards evidence that competition worsens service quality without passenger benefits.  \nGREEN_EFA denounces the proposal's implicit subsidy to airlines through lax noise enforcement, directly contradicting their demand for equitable transport taxation favoring railways.  \nGREEN_EFA rejects Commission overreach into regional airport governance as a violation of subsidiarity principles central to their environmental justice agenda."
      },
      {
        "party_name": "ALDE",
        "score": 0.7228915662650602,
        "choice": 7,
        "stance": "ALDE strongly agrees maintaining member states' autonomy to tailor groundhandling liberalization to local infrastructure capacities, aligning with subsidiarity principles.  \nALDE approves the rejection of uniform EU-level mandates, emphasizing that service quality hinges on worker qualifications and conditions rather than provider quantity.  \nALDE endorses prioritizing airport-specific realities like Frankfurt’s spatial constraints, which necessitate national flexibility over rigid competition rules.  \nALDE proposes enhancing future proposals with harmonized EU worker training standards to ensure quality alongside managed market expansion.  \nALDE applauds safeguarding regional aviation efficiency by allowing tailored slot allocation adjustments for smaller carriers during maintenance periods."
      }
    ],
    "resolution": "The European Parliament raised objections to the Commission’s 2011 proposal (COM(2011)0824), rejecting it due to concerns over non-compliance with the principle of subsidiarity, as highlighted by the Luxembourg Chamber of Deputies, and citing critical opinions from the European Economic and Social Committee (2012) and the Committee of the Regions (2012). The resolution emphasized that the proposal failed to justify EU-level intervention over national measures, particularly in harmonizing rules for implementing transport infrastructure guidelines. Parliament formally rejected the proposal, urged the Commission to withdraw it entirely, and instructed its President to communicate this decision to the Council, Commission, and national parliaments, underscoring the need to respect subsidiarity in legislative processes.",
    "total_score": 0.6058588548601864,
    "total_choice": 6,
    "party_num": 2,
    "id": 18,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.8,
      0.2
    ],
    "veto_party_name": "ALDE"
  },
  {
    "topic": "transport & tourism",
    "title": "Recording equipment in road transport: REPORT on the proposal for a regulation of the European Parliament and of the Council amending Council Regulation (EEC) No 3821/85 on recording equipment in road transport and amending Regulation (EC) No 561/2006 of the European Parliament and the Council",
    "background": "Existing EU regulations on road transport recording equipment (EEC 3821/85, EC 561/2006) faced challenges including tachograph fraud, high compliance costs, and uneven enforcement. Technological advancements prompted calls for modernized systems. The Parliament will discuss amendments to enhance tachograph reliability, reduce administrative burdens, and harmonize enforcement of driving time and rest period rules.",
    "stances": [
      {
        "party_name": "SD",
        "score": 0.8691099476439791,
        "choice": 8,
        "stance": "SD strongly agrees the expansion of digital tachograph monitoring to vehicles under 2.8 tonnes, aligning perfectly with SD's longstanding commitment to road safety and fair competition by ensuring comprehensive oversight of professional drivers.  \nSD applauds the harmonization of control officer training and penalty standardization, which effectively advances SD's priority of worker protection and equitable enforcement across Member States.  \nSD proposes reviewing the 50 km exception for regular passenger bus services to enhance safety, suggesting amending Article 10(4) of Regulation (EC) No 561/2006 to prioritize accident prevention without opposing the issue’s core framework.  \nSD emphasizes the critical need for strict rest-period compliance in passenger transport, particularly endorsing Amendment 149’s weight-sensor integration to prevent tragedies like the Karlovac motorway crash.  \nSD urges monitoring financial impacts on SMEs during tachograph implementation, advocating for streamlined compliance procedures under Article 3 of Regulation 3821/85 to avoid disproportionate administrative burdens."
      },
      {
        "party_name": "ECR",
        "score": 0.05454545454545454,
        "choice": 0,
        "stance": "ECR rejects the proposal's merger of driving licences with tachograph records as a fundamental violation of privacy rights, disproportionately penalizing drivers in both professional and private capacities.  \nECR opposes satellite tracking mandates as regulatory overreach inconsistent with principles of limited state surveillance, framing this as \"Big Brother’s eye in the sky\" incompatible with individual liberties.  \nECR completely doubts with the issue’s cost imposition on transport businesses, arguing it exacerbates financial strain during economic fragility without proven safety ROI.  \nThe proposal overlooks critical enforcement harmonization needs, failing to address divergent national interpretations of driving time rules that directly undermine road safety objectives.  \nECR condemns the failure to prioritize cross-border Ecocombi adoption over intrusive technical measures, misaligning with practical freight efficiency improvements."
      }
    ],
    "resolution": "The European Parliament raised its position on the Commission’s 2011 transport sector proposal (COM(2011)0451), stressing alignment with Treaty on the Functioning of the European Union objectives under Article 91 and incorporating consultations with the European Economic and Social Committee (December 2011 opinion) and the Committee of the Regions. Based on the Committee on Transport and Tourism’s 2012 report (A7-0195/2012), it formally adopted its first-reading stance, urged the Commission to resubmit the proposal if introducing major amendments to ensure parliamentary scrutiny, and directed its President to transmit the position to the Council, Commission, and national parliaments to proceed with legislative deliberations.",
    "total_score": 0.6472148541114059,
    "total_choice": 6,
    "party_num": 2,
    "id": 19,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.4,
      0.6
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "transport & tourism",
    "title": "Registration documents for vehicles: REPORT on the proposal for a directive of the European Parliament and of the Council amending Council Directive 1999/37/EC on the registration documents for vehicles",
    "background": "The EU's 1999 vehicle registration framework faced inconsistencies in cross-border documentation standards and data-sharing mechanisms, with member states applying divergent technical inspection protocols. The Parliament will discuss updating registration rules to align documentation formats, streamline re-registration processes, and enhance interoperability of national vehicle databases.",
    "stances": [
      {
        "party_name": "EFD",
        "score": 0.5483870967741935,
        "choice": 5,
        "stance": "EFD supports the issue's road safety objectives but advises revising penalty mechanisms to exempt non-operational vehicles undergoing repairs, preventing disproportionate fines.  \nEFD proposes amending Article 4 to explicitly exclude caravans from mandatory inspections given evidence of effective owner-led maintenance practices.  \nEFD suggests allowing member states like the UK to retain proven national systems (e.g., MOT tests) through a derogation clause to avoid redundant administrative layers.  \nEFD raises concerns about overreach in standardized EU technical checks, urging proportionality to prevent economic harm to transport sectors already facing fuel price pressures.  \nEFD advises incorporating subsidiarity safeguards in Article 2 to require national parliamentary approval before imposing new inspection regimes."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.9482758620689655,
        "choice": 9,
        "stance": "GREEN_EFA firmly accepts the issue’s alignment with mandatory technical inspections for motorcycles, recognizing their critical role in reducing road fatalities and injuries.  \nGREEN_EFA perfectly aligns with the Commission’s original proposal to enforce technical controls for two- and three-wheeled vehicles, emphasizing parity with four-wheeled vehicle safety standards.  \nGREEN_EFA underscores the necessity of setting 2016 and 2018 deadlines for large and small motorcycles, respectively, as a non-negotiable measure to mitigate accident severity.  \nGREEN_EFA highlights that excluding motorcycles from technical controls contradicts evidence-based road safety frameworks, which the issue decisively corrects.  \nGREEN_EFA applauds the issue’s adherence to harmonized EU-wide vehicle regulations, advancing their commitment to equitable safety protocols across all transport modes."
      }
    ],
    "resolution": "The European Parliament raised concerns regarding the Commission’s 2012 legislative proposal (COM(2012)0381) on transport policy under Article 91 of the Treaty on the Functioning of the European Union, emphasizing the need to address subsidiarity objections from the Cypriot Parliament and the Netherlands’ Senate and House of Representatives, which argued the proposal overstepped EU competence. The resolution adopted Parliament’s first-reading position, informed by the Committee on Transport and Tourism’s report (A7-0199/2013), and incorporated the European Economic and Social Committee’s December 2012 opinion. It urged the Commission to re-engage Parliament if proposing substantial amendments or alternative texts and directed its President to transmit the adopted position to the Council, Commission, and national parliaments, ensuring alignment with procedural and substantive legislative requirements.",
    "total_score": 0.8509803921568627,
    "total_choice": 8,
    "party_num": 2,
    "id": 20,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.2,
      0.8
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "transport & tourism",
    "title": "Occurrence reporting in civil aviation: REPORT on the proposal for a regulation of the European Parliament and of the Council on occurrence reporting in civil aviation amending Regulation (EU) No 996/2010 and repealing Directive No 2003/42/EC, Commission Regulation (EC) No 1321/2007 and Commission Regulation (EC) No 1330/2007",
    "background": "The EU's existing aviation occurrence reporting framework, comprising Directive 2003/42/EC and related regulations, faced fragmentation, necessitating harmonized safety data collection and analysis across member states to address systemic risks. The Parliament will discuss standardizing civil aviation incident reporting mechanisms to strengthen preventive safety measures under EU-wide regulation.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.8722627737226277,
        "choice": 8,
        "stance": "EPP strongly endorses the balanced approach to aviation safety through preventive incident reporting while ensuring legal protections for informants, aligning with EPP's commitment to both transport security and fair judicial processes.  \nEPP approves the clear delineation of judicial competencies in aviation occurrence investigations, recognizing this as vital for maintaining trust in safety reporting systems.  \nEPP emphasizes that the issue effectively advances aviation safety priorities through improved data collection, mirroring EPP's 2023 manifesto goals for EU-wide transport infrastructure modernization.  \nEPP proposes enhancing collaboration on functional airspace blocks by amending Article 12 to include mandatory cross-border coordination timelines, addressing current fragmentation without opposing the issue's core structure.  \nEPP commends the technical precision in safeguarding sensitive aviation data while enabling safety improvements, consistent with EPP's principle of proportionate EU regulation."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.896551724137931,
        "choice": 8,
        "stance": "GREEN_EFA strongly advocates the establishment of a robust \"just culture\" framework to protect aviation workers reporting safety concerns, aligning perfectly with their commitment to transparency and workplace dignity.  \nGREEN_EFA applauds the inclusion of cabin air quality and crew fatigue monitoring as reportable occurrences, effectively advancing their priority of holistic health protections in transport sectors.  \nGREEN_EFA approves the issue’s procedural rigor in institutional collaboration, reinforcing preventive safety governance across EU aviation networks."
      }
    ],
    "resolution": "The European Parliament raised its position on the Commission’s 2012 proposal (COM(2012)0776) concerning transport policy under Article 100(2) of the Treaty on the Functioning of the European Union, adopting its first-reading stance as outlined in the Committee on Transport and Tourism’s report (A7-0317/2013). It emphasized the need for the Commission to resubmit the proposal to Parliament if substantial amendments or replacements are introduced, ensuring legislative coherence. The resolution incorporated input from the European Economic and Social Committee’s 2013 opinion and instructed the Parliament’s President to formally transmit its adopted position to the Council, Commission, and national parliaments, reinforcing procedural adherence under Rule 55 of its Rules of Procedure while prioritizing substantive policy alignment and institutional collaboration.",
    "total_score": 0.8407310704960835,
    "total_choice": 8,
    "party_num": 2,
    "id": 21,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.7,
      0.3
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "transport & tourism",
    "title": "Technical requirements and administrative procedures related to air operations: MOTION FOR A RESOLUTION on the draft Commission implementing regulation on draft Commission Regulation (EU) No …/.. of XXX amending Regulation (EU) No 965/2012 laying down technical requirements and administrative procedures related to air operations pursuant to Regulation (EC) No 216/2008 of the European Parliament and of the Council",
    "background": "The European Union's aviation safety framework, governed by Regulation (EC) No 216/2008 and implementing rules under Regulation (EU) No 965/2012, mandates harmonized flight crew fatigue management. The European Commission proposed amendments to flight time limitations, prompting scrutiny over alignment with scientific evidence and regulatory mandates. The Parliament will discuss revisions to technical requirements for air operations addressing fatigue-related safety standards.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.06569343065693431,
        "choice": 0,
        "stance": "EPP rejects the issue's claim that the Commission's proposal lacks scientific basis, citing over 50 studies evaluated by EASA as foundational evidence.  \nEPP opposes the withdrawal of the draft regulation, arguing it would maintain inferior safety standards compared to the proposed harmonized EU-wide rules.  \nEPP fundamentally disputes the assertion of democratic oversight bypass, noting EASA's technical mandate under Regulation 216/2008/EC.  \nEPP highlights that the issue's 10-hour FDP cap disregards operational realities validated by aviation experts.  \nEPP emphasizes that existing national improvements remain protected under the Commission's proposal, contrary to the issue's risk assumptions."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.9310344827586207,
        "choice": 9,
        "stance": "GREEN_EFA entirely supports the issue’s strict 10-hour flight duty cap, which perfectly aligns with their commitment to aviation safety rooted in scientific evidence from multiple independent studies on pilot fatigue.  \nGREEN_EFA entirely supports the rejection of EASA’s undue influence, as highlighted by the European Court of Auditors’ findings, ensuring legislative oversight remains paramount to prevent industry capture.  \nGREEN_EFA entirely supports safeguarding Member States’ rights to adopt stricter measures, aligning with their principle of prioritizing human safety over economic interests in transnational policymaking.  \nGREEN_EFA entirely supports the issue’s emphasis on fatigue prevention, contrasting sharply with the Commission’s flawed proposal that risks repeating accidents like Buffalo 2009 by ignoring sleep-deprivation science.  \nGREEN_EFA entirely supports harmonizing EU rules with global best practices, such as U.S. night-flight limits, to eliminate dangerous discrepancies and uphold crew/passenger safety as non-negotiable."
      }
    ],
    "resolution": "The European Parliament raised objections to the draft Commission implementing regulation amending air operations rules, arguing it contravenes Regulation 216/2008/EC by exceeding the Commission’s mandate and failing to base flight time limitations (FTL) on scientific evidence. The resolution highlights that the proposal contradicts at least five scientific reports (2009-2013) on fatigue, night hours, and sleep deprivation, lacks proper analysis of safety risks, and improperly transfers legislative authority to the European Aviation Safety Agency (EASA), bypassing democratic scrutiny. It opposes the draft regulation, urging its withdrawal and a revised proposal with stricter limits: Flight Duty Periods capped at 10 hours, combined standby and duty periods limited to 18 hours, and safeguards allowing Member States to adopt more protective measures. The Parliament emphasizes that FTL rules impact aviation safety and workers’ rights, requiring transparent, science-based policymaking aligned with proportionality and essential requirements under EU law. It calls for urgent action to address these flaws, ensuring compliance with Regulation 216/2008/EC and preserving legislative oversight.",
    "total_score": 0.2845953002610966,
    "total_choice": 2,
    "party_num": 2,
    "id": 22,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.5,
      0.5
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "transport & tourism",
    "title": "Port State control: REPORT on the proposal for a directive of the European Parliament and of the Council amending Directive 2009/16/EC on port State control",
    "background": "The 2006 Maritime Labour Convention established global standards for seafarers' working conditions, with enforcement through port State controls. The European Union's 2009 Port State Control Directive required revision to integrate these provisions ahead of the convention's August 2013 implementation, as 15 EU states had not ratified it. The Parliament will discuss aligning EU port inspection rules with the convention to enforce labor, safety, and environmental compliance for ships entering EU waters.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9562043795620438,
        "choice": 9,
        "stance": "EPP firmly advocates the enhanced port state control measures as a perfect alignment with its unwavering commitment to maritime safety and seafarer rights, ensuring rigorous inspections without disproportionate administrative burdens.  \nEPP applauds the issue’s harmonization with the 2006 Maritime Labour Convention, effectively advancing fair competition and protecting seafarers from exploitative practices as outlined in the party’s labor standards agenda.  \nEPP emphasizes the critical importance of member states’ swift ratification of the maritime labor convention to reinforce the directive’s objectives, reflecting the party’s prioritization of international regulatory coherence.  \nEPP highlights the balanced compromise achieved through negotiations, which safeguards inspection efficiency while maintaining strict adherence to safety protocols, consistent with EPP’s pragmatic legislative approach.  \nEPP recognizes the directive’s alignment with EU transport safety priorities, particularly its proactive stance against substandard shipping, as a testament to the party’s leadership in maritime policy innovation."
      },
      {
        "party_name": "ECR",
        "score": 0.8596491228070176,
        "choice": 8,
        "stance": "ECR strongly accepts the enforcement of international labor standards across EU ports, aligning perfectly with ECR's longstanding commitment to maritime safety and equitable working conditions.  \nECR approves the issue’s integration of the 2006 Maritime Labour Convention, effectively advancing ECR's priority of aligning EU law with global obligations.  \nECR emphasizes the critical accountability of shipowners, operators, and flag states, reinforcing mechanisms that uphold ECR’s principles of regulatory rigor and shared responsibility.  \nECR applauds the directive’s safeguard against dilution of EU standards by international frameworks, matching ECR’s manifesto pledge to protect regional legislative sovereignty.  \nECR proposes amending Article 4 to mandate biannual audits of flag states with poor enforcement records, enhancing compliance without opposing the issue’s core objectives."
      }
    ],
    "resolution": "The European Parliament raised its adoption of the position at first reading on the Commission’s proposal (COM(2012)0129) concerning transport and tourism, emphasizing the need for the Commission to resubmit the proposal to Parliament if substantial amendments or a replacement text are planned. It underscored adherence to procedural frameworks, including consultations with the European Economic and Social Committee and the Committee of the Regions, and reliance on the Committee on Transport and Tourism’s report (A7-0394/2012). The resolution instructed the Parliament’s President to formally communicate its adopted position to the Council, Commission, and national parliaments, ensuring alignment and transparency in further legislative steps while prioritizing the integrity of the original proposal.",
    "total_score": 0.8875816993464052,
    "total_choice": 8,
    "party_num": 2,
    "id": 23,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.5,
      0.5
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "transport & tourism",
    "title": "Reporting formalities for ships arriving in or departing from ports: REPORT on the proposal for a directive of the European Parliament and of the Council on reporting formalities for ships arriving in and/or departing from ports of the Member States of the Community and repealing Directive 2002/6/EC",
    "background": "Existing EU maritime regulations under Directive 2002/6/EC mandated redundant administrative procedures for intra-EU shipping, creating operational inefficiencies and disadvantaging coastal transport competitiveness relative to road freight. The Parliament will discuss proposed measures to streamline reporting formalities for ships arriving in or departing from EU ports.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9122137404580153,
        "choice": 9,
        "stance": "EPP entirely accepts the harmonization of maritime reporting formalities as a critical step toward realizing the EU's barrier-free transport network.  \nEPP perfectly aligns with the issue's balanced approach to multilingual communication protocols while maintaining operational efficiency in port procedures.  \nEPP commends the consensus-driven simplification of cargo documentation requirements as exemplary institutional collaboration under Treaty frameworks.  \nEPP recognizes the one-stop shop mechanism as fully achieving its policy goal of reducing redundant administrative burdens for short-sea shipping operators.  \nEPP affirms that the trialogue agreement on implementation timelines demonstrates optimal alignment with its competitiveness agenda for sustainable maritime transport."
      },
      {
        "party_name": "ECR",
        "score": 0.8703703703703703,
        "choice": 8,
        "stance": "ECR strongly promotes the issue’s streamlined cargo data exchange framework, aligning perfectly with their commitment to reducing administrative burdens in maritime transport.  \nECR approves the harmonized approach to pilotage exemptions, which effectively advances fair competition while maintaining high safety standards as prioritized in ECR policies.  \nECR endorses extending simplified reporting procedures to inland shipping through future Commission assessments, urging cohesive integration across transport modes.  \nECR proposes amending language provisions to mandate English as the mandatory operational lingua franca, enhancing safety by eliminating multilingual miscommunication risks.  \nECR applauds the issue’s emphasis on institutional collaboration, reinforcing their vision of a unified yet pragmatic EU transport policy."
      }
    ],
    "resolution": "The European Parliament raised its position on the Commission’s 2009 proposal (COM(2009)0011) concerning transport policy, adopting its first-reading stance as outlined in the Committee on Transport and Tourism’s report (A7‑0064/2010). It emphasized the need for the Commission to re-engage Parliament if substantial amendments or replacements to the proposal are considered, ensuring legislative coherence under relevant EU treaty frameworks. The resolution further directed the Parliament’s President to formally transmit its adopted position to the Council, the Commission, and national parliaments, reinforcing procedural adherence while prioritizing alignment with EU transport objectives and institutional collaboration.",
    "total_score": 0.8695652173913043,
    "total_choice": 8,
    "party_num": 2,
    "id": 24,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.5,
      0.5
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "transport & tourism",
    "title": "Rights of passengers in bus and coach transport: REPORT on the joint text approved by the Conciliation Committee for a regulation of the European Parliament and of the Council concerning the rights of passengers in bus and coach transport and amending Regulation (EC) No 2006/2004",
    "background": "Prior EU regulations established passenger rights for air, rail, and maritime transport, but bus/coach services lacked harmonized protections, particularly for disabled persons and cross-border travelers. The sector’s prevalence of small operators and growing demand for accessible transport necessitated standardized rules. The Parliament will discuss EU-wide passenger rights frameworks for bus/coach travel, addressing non-discrimination, compensation, and accessibility.",
    "stances": [
      {
        "party_name": "ECR",
        "score": 0.8518518518518519,
        "choice": 8,
        "stance": "ECR strongly agrees the establishment of comprehensive passenger rights in bus and coach transport, completing EU-wide protections across all modes and advancing consumer-focused governance.  \nECR applauds the prioritization of accessibility for disabled passengers and those with special needs, aligning with their commitment to equitable public service provision.  \nECR approves the 250 km exemption protecting local operators from disproportionate burdens, ensuring proportionality and safeguarding SME competitiveness in line with free market principles.  \nECR endorses the exclusion of urban/suburban services from excessive regulation, preventing operational inflexibility and cost escalation for municipal transport systems.  \nECR proposes monitoring mechanisms to verify timely implementation of staff training requirements, enhancing accountability while respecting transitional periods for compliance."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.17647058823529413,
        "choice": 1,
        "stance": "  \n\nGUE_NGL rejects the regulation's failure to prevent fare hikes that disproportionately burden working-class passengers, contradicting their anti-austerity principles.  \nGUE_NGL opposes fundamentally the extended transitional period loophole, which delays critical protections for disabled travelers' wheelchair accessibility rights.  \nThe proposal overlooks critical aspects such as inflation-indexed compensation limits, enabling real-term erosion of passenger financial safeguards.  \nGUE_NGL condemns the unresolved insurance ambiguities in Article 4(2) as incompatible with their demand for universal social guarantees.  \nThis regulation conflicts with GUE_NGL's transport justice agenda by prioritizing insurer profits over binding public service obligations."
      }
    ],
    "resolution": "The European Parliament raised the approval of the joint text agreed by the Conciliation Committee (PE-CONS 00063/2010), which resolved differences between its earlier positions and the Council’s stance on the Commission’s 2008 legislative proposal (COM(2008)0817). The resolution incorporated input from the European Economic and Social Committee’s 2009 opinion and aligned with Treaty obligations (Article 294(13) TFEU), finalizing the act for adoption. It mandated the Presidents of Parliament and the Council to sign the act under Article 297(1) TFEU and instructed procedural verification by the Secretaries-General before publication in the Official Journal, concluding the legislative process.",
    "total_score": 0.6847826086956522,
    "total_choice": 6,
    "party_num": 2,
    "id": 25,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.2,
      0.8
    ],
    "veto_party_name": "GUE_NGL"
  },
  {
    "topic": "transport & tourism",
    "title": "Roadworthiness of commercial vehicles: REPORT on the proposal for a regulation of the European Parliament and of the Council on the technical roadside inspection of the roadworthiness of commercial vehicles circulating in the Union and repealing Directive 2000/30/EC",
    "background": "Disparities in commercial vehicle roadworthiness inspections across EU member states under Directive 2000/30/EC, with varying defect detection rates and operational standards, prompted the European Commission to propose updated regulations. The Parliament will discuss harmonizing technical inspection procedures to improve road safety and cross-border consistency while addressing subsidiarity concerns raised by national legislatures.",
    "stances": [
      {
        "party_name": "EFD",
        "score": 0.3225806451612903,
        "choice": 3,
        "stance": "EFD partially agrees the issue but demands exemption clauses for non-operational vehicles, as Article 4's penalty regime conflicts with principles of proportionate governance by punishing owners awaiting repairs.  \nEFD requests revising Annex II to exclude caravans from inspection requirements, citing decades of accident-free owner maintenance practices that render centralized oversight redundant.  \nEFD entirely challenges harmonized roadside inspections (Article 6) for duplicating the UK's MOT system, creating unnecessary costs for hauliers already facing fuel tax burdens.  \nEFD highlights the proposal's failure to address enforcement overreach risks under Article 9, which could replicate Slovakia's abusive fine practices against citizens.  \nEFD rejects the regulation's assumption of uniform EU standards as inconsistent with national competence over transport safety, urging deletion of Articles 1-3 pending subsidiarity review."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.9482758620689655,
        "choice": 9,
        "stance": "GREEN_EFA firmly supports the mandatory technical inspections for all motorized vehicles including motorcycles, perfectly aligning with their commitment to equitable road safety standards.  \nGREEN_EFA strongly upholds the issue’s recognition of motorcycle sophistication, mirroring their advocacy for parity between two-wheeled and four-wheeled vehicle safety protocols.  \nGREEN_EFA applauds the inclusion of accident severity reduction measures through technical controls, advancing their priority to protect vulnerable road users.  \nGREEN_EFA emphasizes the critical importance of adhering to 2016/2018 implementation timelines for motorcycle inspections, reflecting their evidence-based approach to phased safety reforms.  \nGREEN_EFA perfectly aligns with the issue’s grounding in independent studies about technical failures exacerbating accidents, reinforcing their science-driven policymaking ethos."
      }
    ],
    "resolution": "The European Parliament raised concerns regarding the Commission’s 2012 legislative proposal (COM(2012)0382) on transport policy under Article 91 of the Treaty on the Functioning of the European Union, while noting objections from the Cypriot Parliament and Dutch legislatures that the proposal violated subsidiarity principles. It adopted its first-reading position based on the Committee on Transport and Tourism’s report (A7-0207/2013) and the Committee on Industry, Research and Energy’s opinion, urging the Commission to resubmit the proposal if substantially amended. The resolution emphasized procedural adherence to Article 294(3) TFEU and Protocol No 2 on subsidiarity, incorporating input from the European Economic and Social Committee and the Committee of the Regions. Parliament instructed its President to transmit its position to the Council, Commission, and national parliaments, ensuring alignment with legislative processes and institutional consultation requirements.",
    "total_score": 0.8444444444444444,
    "total_choice": 8,
    "party_num": 2,
    "id": 26,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.9,
      0.1
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "transport & tourism",
    "title": "Roadworthiness tests for motor vehicles and their trailers: REPORT on the proposal for a regulation of the European Parliament and of the Council on periodic roadworthiness tests for motor vehicles and their trailers and repealing Directive 2009/40/EC",
    "background": "The European Commission proposed updated vehicle inspection rules to address divergent national standards and road safety concerns under existing EU transport policies, following evaluations of Directive 2009/40/EC. National parliaments raised subsidiarity objections. The Parliament will discuss harmonizing periodic technical inspections for motor vehicles to improve cross-border safety compliance.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.8717948717948718,
        "choice": 8,
        "stance": "EPP strongly accepts the harmonization of roadworthiness tests across member states, particularly endorsing uniform cargo security standards and cross-border inspection reciprocity to enhance road safety.  \nEPP approves the focus on inspection quality over frequency, aligning with their principle of efficient regulation that respects national operational frameworks while ensuring high safety benchmarks.  \nEPP endorses measures to combat odometer fraud through standardized vehicle documentation, emphasizing this as critical for consumer protection in cross-border used vehicle markets.  \nEPP proposes enhanced study of motorcycle accident causation data before implementing EU-wide mandatory inspections, citing unresolved statistical discrepancies raised by national experts.  \nEPP suggests safeguarding SMEs by maintaining integrated maintenance-and-inspection frameworks, amending Article 12.4 to clarify ISO 17020 application as non-binding for small operators."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.08620689655172414,
        "choice": 0,
        "stance": "GREEN_EFA rejects the exemption of motorcycles from mandatory roadworthiness tests as fundamentally undermining road safety standards.  \nGREEN_EFA opposes the issue's failure to align with EU-wide vehicle safety parity, disregarding technical sophistication parity between cars and motorcycles.  \nGREEN_EFA highlights the proposal's contradiction with accident prevention goals by ignoring studies showing 5-10% of motorcycle accidents involve technical deficiencies.  \nGREEN_EFA condemns the exclusion timeline delays for smaller motorcycles, which exacerbates risks for vulnerable road users.  \nGREEN_EFA demands immediate inclusion of all motorized two- and three-wheeled vehicles in testing protocols to prevent preventable fatalities."
      }
    ],
    "resolution": "The European Parliament raised concerns regarding the Commission’s 2012 transport proposal (COM(2012)0380), particularly addressing subsidiarity objections from the French Senate, Netherlands House of Representatives and Senate, Swedish Parliament, and Cypriot House of Representatives, which argued the proposal overstepped EU-level competence. It noted the European Economic and Social Committee’s December 12, 2012, opinion and consulted the Committee of the Regions, while incorporating input from parliamentary committees on Transport and Tourism, Industry, Research and Energy, and the Internal Market and Consumer Protection. The Parliament adopted its first-reading position, urging the Commission to resubmit the proposal if substantial amendments or replacements are planned, and instructed its President to transmit its position to the Council, Commission, and national parliaments, emphasizing adherence to procedural and consultative frameworks.",
    "total_score": 0.7281045751633987,
    "total_choice": 7,
    "party_num": 2,
    "id": 27,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.9,
      0.1
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "transport & tourism",
    "title": "Single European transport area: REPORT on the Roadmap to a Single European Transport Area – Towards a competitive and resource efficient transport system",
    "background": "The EU faced challenges in harmonizing transport systems, including CO₂ emissions growth, infrastructure disparities between eastern/western regions, energy dependency, and fragmented market integration. Previous policies (2001 White Paper, 2020 Strategy) aimed at sustainability and cohesion remained partially unmet. The Parliament will discuss establishing a single European transport area balancing competitiveness, efficiency, and decarbonization.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.8296296296296296,
        "choice": 8,
        "stance": "EPP strongly agrees the issue’s emission reduction targets and eco-innovation framework, which align perfectly with EPP’s longstanding commitment to sustainable growth and energy diversification.  \nEPP approves the harmonized standards for interoperable transport systems but proposes strengthening cross-border coordination on modular road trains to prevent regulatory fragmentation, ensuring unified safety and environmental specifications.  \nEPP applauds the accessibility provisions for disabled and elderly passengers as effectively advancing EPP’s priority of inclusive mobility and social cohesion.  \nEPP endorses the subsidiarity principle for gigaliner approvals, recognizing regional infrastructure realities while maintaining single market coherence.  \nEPP emphasizes the critical need for cohesion-focused infrastructure funding to address disparities, matching EPP’s regional development priorities."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.0,
        "choice": 0,
        "stance": "GUE/NGL rejects the issue's market liberalization agenda as completely challengeing with their anti-privatization principles and workers' rights priorities  \nGUE/NGL opposes the transport integration model for exacerbating corporate monopolies while failing to address regional disparities in infrastructure development  \nGUE/NGL condemns the issue's alignment with IMF-style austerity policies that sacrifice public rail services and island connectivity to privatization schemes  \nGUE/NGL highlights the proposal's incompatibility with social cohesion through its promotion of flexible labor practices and erosion of transport safety standards  \nGUE/NGL asserts the issue overlooks critical grassroots needs by prioritizing multinational corporate profits over affordable passenger services and SME logistics"
      }
    ],
    "resolution": "The European Parliament raised the urgent need for a sustainable, efficient, and competitive EU transport sector to meet emission reduction targets, lower energy dependency, and enhance regional integration. It highlighted that transport accounts for over 25% of EU CO2 emissions, stressing the necessity to accelerate emission reductions through eco-innovation, renewable fuels, co-modality, and internalizing external costs across all transport modes. The resolution emphasized achieving a 20% reduction in road transport emissions and a 30% cut in aviation emissions by 2020, alongside promoting electro-mobility, interoperable charging infrastructure, and smart grids. It noted the transport sector’s economic significance, citing 2009 exports of €454.7 billion (41.5% of total EU exports) and trade surpluses of €112.6 billion in machinery and €21.5 billion in services. The Parliament advocated for energy diversification, ICT integration, Intelligent Transport Systems, and modular road trains to boost efficiency, while urging harmonized standards and research into technologies like RFID and Galileo. It called for sustainable biofuels, particularly second-generation, and stressed regional cohesion by addressing infrastructure disparities, prioritizing cross-border projects, and enhancing funding for convergence regions. Urban transport challenges, including congestion and emissions, were addressed through smart city planning and integrated management. The resolution also underscored the potential of short-sea shipping and inland waterways for market integration and disaster resilience, while safeguarding cohesion policy resources.",
    "total_score": 0.6936339522546419,
    "total_choice": 6,
    "party_num": 2,
    "id": 28,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.8,
      0.2
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "transport & tourism",
    "title": "Trans-European transport network: REPORT on the proposal for a regulation of the European Parliament and of the Council on Union guidelines for the development of the trans-European transport network",
    "background": "The European Commission proposed updated trans-European transport network guidelines to address infrastructure gaps and enhance cross-border connectivity, under Treaty obligations. The French Senate raised subsidiarity concerns, while EU advisory bodies provided opinions. The Parliament will discuss adopting Union guidelines for the trans-European transport network's development.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9051094890510949,
        "choice": 9,
        "stance": "EPP completely promotes the multimodal integration framework as perfectly aligning with EPP's longstanding commitment to cohesive European infrastructure development.  \nEPP perfectly aligns with the core network prioritization strategy, particularly its inclusion of strategic logistics platforms like Zaragoza and Antequera as critical nodes for Iberian connectivity.  \nEPP proposes strengthening financial instruments through enhanced long-term loan mechanisms to complement project bonds, thereby maximizing private sector participation while maintaining full endorsement of the CEF structure.  \nEPP urges immediate operationalization of Rail Baltic connectivity enhancements through the issue's corridor provisions, recognizing this as essential for eliminating Baltic regional isolation.  \nEPP emphasizes the issue's effective advancement of tourism infrastructure priorities through airport network criteria while suggesting accelerated evaluation for Vigo's port inclusion in core network revisions."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.08620689655172414,
        "choice": 0,
        "stance": "GREEN_EFA rejects the issue's prioritization of delayed megaprojects like Brenner Base Tunnel and Fehmarnbelt Bridge, which contradict sustainable rail development and waste critical funding.  \nGREEN_EFA opposes the allocation of resources to redundant highway expansions (e.g., Brno-Austrian border) over restoring WWII-destroyed cross-border rail links essential for European integration.  \nGREEN_EFA absolutely challenges with the annexes' inclusion of Lyon-Turin high-speed rail, a fiscally irresponsible project that monopolizes funds while undermining climate-focused infrastructure priorities.  \nGREEN_EFA condemns the failure to address systemic underfunding of cross-border rail corridors like Berlin-Swinemünde and Freiburg-Colmar, perpetuating fragmented national networks over a unified European system.  \nGREEN_EFA highlights the issue's institutional inertia through projects like the 660-meter Sebnitz-Dolní Poustevna gap, which took 25 years to resolve despite its minimal scale and strategic importance."
      }
    ],
    "resolution": "The European Parliament raised its position on the Commission’s 2011 legislative proposal (COM(2011)0650/3), grounded in Article 294(2) and Article 172 of the Treaty on the Functioning of the European Union, to advance transport infrastructure policies. It acknowledged concerns from the French Senate, which contested the proposal’s compliance with subsidiarity under Protocol No 2, and incorporated opinions from the European Economic and Social Committee (22 February 2012) and the Committee of the Regions (3 May 2012). The resolution formally adopted Parliament’s first-reading stance, urged the Commission to re-engage Parliament if proposing significant amendments or alternative texts, and directed its President to transmit the position to the Council, Commission, and national parliaments, ensuring procedural continuity while prioritizing legislative coherence and inter-institutional accountability.",
    "total_score": 0.7127937336814621,
    "total_choice": 7,
    "party_num": 2,
    "id": 29,
    "parliament_terms": "7th_datas",
    "seat_weights": [
      0.7,
      0.3
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "transport & tourism",
    "title": "Charging of heavy goods vehicles for the use of certain infrastructures: REPORT on the proposal for a directive of the European Parliament and of the Council amending Directive 1999/62/EC on the charging of heavy goods vehicles for the use of certain infrastructures",
    "background": "The EU’s 1999 infrastructure charging directive for heavy goods vehicles faced calls for reform amid evolving environmental objectives, concerns over competitive distortions between transport modes, and infrastructure financing needs. The Parliament will discuss revising the framework to address emissions, equitable cost distribution, and harmonized road charging mechanisms.",
    "stances": [
      {
        "party_name": "EFDD",
        "score": 0.30952380952380953,
        "choice": 3,
        "stance": "EFDD partly supports the issue's environmental goals but requests revisions to exempt British livestock producers from CO2-based infrastructure charges until post-Brexit trade agreements are ratified.  \nEFDD opposes the uniform phase-out of vignettes by 2024, arguing it firmly againsts with WTO trade fairness principles unless reciprocal standards are enforced on third-country meat imports.  \nEFDD demands amendments to Article 7 to require explicit WTO-compliant risk assessments for antibiotic thresholds in animal feed, citing unresolved scientific ambiguities.  \nEFDD rejects the issue’s rigid veterinary prescription rules as inconsistent with national sovereignty, proposing instead that member states retain autonomy over livestock medication protocols.  \nEFDD highlights that the proposal overlooks critical innovations in antimicrobial resistance, urging reallocation of congestion charge revenues to fund genetic research for disease-resistant poultry."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.8076923076923077,
        "choice": 8,
        "stance": "GREEN_EFA strongly upholds the integration of CO2-based infrastructure charges, aligning perfectly with their commitment to climate accountability and the \"polluter pays\" principle.  \nGREEN_EFA applauds the elimination of vignettes for heavy vehicles by 2024 as a critical step toward reducing emissions from road transport.  \nGREEN_EFA endorses the 75% charge reduction for zero-emission vehicles, recognizing its potential to accelerate the transition to sustainable freight systems.  \nGREEN_EFA proposes extending congestion charge revenue allocations to explicitly fund low-emission urban mobility projects, enhancing the directive’s environmental impact.  \nGREEN_EFA welcomes stringent transparency requirements for toll revenue use, ensuring alignment with their principles of ecological fiscal responsibility."
      }
    ],
    "resolution": "The European Parliament raised key measures to reform road charging systems, emphasizing environmental accountability and fair competition. The resolution expands the scope of the directive to include all heavy-duty vehicles (HDVs), including buses and coaches, from 2020, eliminating exemptions for vehicles under 12 tonnes to prevent market distortions. It proposes extending variable infrastructure charges to light vehicles and mandates phasing out vignettes (time-based charges) for HDVs by 2024 and for light vehicles by 2028, prioritizing the \"polluter pays\" principle. Infrastructure charges for HDVs will vary based on CO2 emissions starting in 2021, while light vehicles will face charges tied to CO2 and EURO emission standards. Zero-emission vehicles will receive a 75% reduction in infrastructure charges. The resolution introduces congestion charges and requires external-cost charges on roads where HDVs cause above-average environmental harm. Additionally, it demands greater transparency in tolling systems and stricter monitoring of revenue use to ensure compliance and accountability.",
    "total_score": 0.5392953929539296,
    "total_choice": 5,
    "party_num": 2,
    "id": 30,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.8,
      0.2
    ],
    "veto_party_name": "EFDD"
  },
  {
    "topic": "transport & tourism",
    "title": "Common rules for access to the international market for coach and bus services: REPORT on the proposal for a regulation of the European Parliament and of the Council amending Regulation (EC) No 1073/2009 on common rules for access to the international market for coach and bus services",
    "background": "Existing EU regulations on international coach and bus services, established in 2009, faced evolving market demands and divergent national approaches balancing commercial competition with public service obligations. The Parliament will discuss amending these rules to address cross-border market access and operational standards for international coach and bus services within the EU.",
    "stances": [
      {
        "party_name": "ALDE",
        "score": 0.8787878787878788,
        "choice": 8,
        "stance": "ALDE strongly endorses the liberalization of long-distance bus services as a strategic tool for decarbonization, emphasizing their capacity to collectively transport citizens while reducing per-passenger carbon footprints.  \nALDE endorses the Spanish concession model for harmonizing market competition with public service obligations, ensuring cross-subsidization between profitable and non-profitable routes to maintain rural accessibility.  \nALDE applauds the issue’s alignment with EU territorial cohesion goals, particularly its role in combating rural depopulation through reliable transport networks in peripheral regions.  \nALDE emphasizes the necessity of preserving transparent public-private partnerships in transport concessions, as exemplified by Spain’s operational framework, to safeguard socially vital services.  \nALDE recognizes the proposal’s potential to advance harmonized market access while urging vigilance in monitoring implementation to prevent unintended erosion of existing functional systems."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.02040816326530612,
        "choice": 0,
        "stance": "GUE_NGL rejects the proposal as it firmly disputes with their commitment to defending public transportation systems against corporate privatization.  \nGUE_NGL opposes the issue’s liberalization framework, which overlooks critical aspects of social profitability and territorial cohesion in favor of multinational monopolies.  \nGUE_NGL condemns the market-driven approach for failing to address the degradation of labor conditions and public infrastructure highlighted in their arguments.  \nGUE_NGL asserts the proposal is inconsistent with their principles by prioritizing private sector entry over state-led strategies for affordable, frequent public transport.  \nGUE_NGL warns the regulation’s alignment with Flixbus-style monopolies directly threatens existing public service models proven to ensure universal access."
      }
    ],
    "resolution": "The European Parliament raised its position on the Commission’s 2017 legislative proposal (COM(2017)0647) concerning transport and tourism, adopting its first-reading stance as outlined in the Committee on Transport and Tourism’s report (A8-0032/2019). It highlighted concerns over compliance with subsidiarity, noting the Irish Houses of the Oireachtas’ reasoned opinion that the proposal encroached on national competencies. The resolution incorporated the European Economic and Social Committee’s 2018 opinion, emphasizing stakeholder consultation. Parliament urged the Commission to resubmit the proposal if substantially amended and directed its President to transmit Parliament’s position to the Council, Commission, and national parliaments, ensuring alignment with legislative procedures under Article 294 of the Treaty on the Functioning of the European Union.",
    "total_score": 0.4768392370572207,
    "total_choice": 4,
    "party_num": 2,
    "id": 31,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.4,
      0.6
    ],
    "veto_party_name": "ALDE"
  },
  {
    "topic": "transport & tourism",
    "title": "Discontinuing seasonal changes of time: REPORT on the proposal for a directive of the European Parliament and of the Council discontinuing seasonal changes of time and repealing Directive 2000/84/EC",
    "background": "The EU's seasonal clock changes, harmonized under Directive 2000/84/EC, faced growing criticism over health risks, circadian rhythm disruptions, and economic burdens. A 2018 Commission public consultation revealed 84% support for discontinuing the practice amid concerns about energy inefficacy. The Parliament will discuss ending biannual time adjustments while addressing internal market coordination challenges.",
    "stances": [
      {
        "party_name": "EFDD",
        "score": 0.09523809523809523,
        "choice": 0,
        "stance": "EFDD fully rejects the issue’s reliance on unverified health and safety claims, contradicting EFDD’s demand for empirical rigor, as Daniela Aiuto emphasized the absence of conclusive scientific evidence linking time changes to negative outcomes.  \nEFDD rejects the harmonized EU-wide approach as a violation of subsidiarity, aligning with James Carver’s argument that seasonal adjustments should remain a national prerogative based on geographic and economic needs.  \nEFDD highlights the issue’s failure to address critical energy consumption risks, with Daniela Aiuto warning that abandoning summer time could reverse electricity savings, opposing the directive’s economic rationale.  \nEFDD criticizes the discretionary power granted to member states to choose permanent time zones, arguing it could fragment cross-border trade and transport—a stance inconsistent with EFDD’s usual advocacy for national sovereignty but reflecting concerns over market coherence.  \nEFDD condemns the flawed public consultation process cited in the issue, asserting it lacked transparency and meaningful debate, undermining democratic legitimacy—a core EFDD priority."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.8269230769230769,
        "choice": 8,
        "stance": "GREEN_EFA strongly agrees ending seasonal clock changes, aligning perfectly with their longstanding commitment to public health and circadian rhythm preservation through reduced cardiovascular incidents and accident rates.  \nGREEN_EFA entirely promotes the harmonized mediation mechanism to prevent time-zone fragmentation, effectively advancing their priority of cross-border cohesion and internal market stability.  \nGREEN_EFA emphasizes the directive’s symbolic importance in rejecting wartime-era policies, aligning with Europe’s peace-building legacy by abolishing practices initiated by authoritarian regimes.  \nGREEN_EFA proposes amending Article 4 to require member states to submit coordination plans within six months, accelerating implementation while preserving the one-year transition framework.  \nGREEN_EFA applauds the issue’s reliance on unprecedented public consultation, urging nations to replicate Croatia’s participatory model to ensure democratic legitimacy in permanent time selection."
      }
    ],
    "resolution": "The European Parliament raised support for discontinuing the bi-annual clock change, citing evidence of negative impacts on health (e.g., disrupted circadian rhythms), increased accident rates post-transition, and economic burdens across sectors. It highlighted a 2018 public consultation with 4.6 million responses—84% favoring ending seasonal time shifts—where 99.8% of replies came from citizens. The resolution stressed the need for a harmonized EU-wide approach to preserve the internal market, given the bloc’s three existing time zones (GMT, GMT+1, GMT+2), and urged member states to coordinate decisions on permanent time based on geographical, health, and socioeconomic factors like cross-border trade, transport, and road safety. To facilitate coordination, the Parliament proposed delaying implementation by one year, establishing a mediation network of member state representatives and the Commission to address disputes, and shortening the evaluation period for the directive’s application from five to four years. Member states were encouraged to conduct national consultations to ensure stakeholder and public involvement in choosing between permanent summer or winter time, while avoiding disruptive time-zone fragmentation.",
    "total_score": 0.5471698113207547,
    "total_choice": 5,
    "party_num": 2,
    "id": 32,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.8,
      0.2
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "transport & tourism",
    "title": "Adapting to development in the road transport sector: REPORT on the proposal for a regulation of the European Parliament and of the Council amending Regulation (EC) 1071/2009 and Regulation (EC) 1072/2009 with a view to adapting them to developments in the sector",
    "background": "The European road transport sector faced evolving operational practices, cross-border complexities, and regulatory gaps in addressing fair competition, driver working conditions, and market access under existing 2009 EU frameworks. The Parliament will discuss amendments to sector-specific regulations to align with contemporary transport realities and enforcement challenges.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.8653846153846154,
        "choice": 8,
        "stance": "GREEN_EFA strongly agrees the issue’s prioritization of social protections and safety, aligning perfectly with its commitment to preventing the erosion of workers’ rights in the transport sector.  \nGREEN_EFA applauds the emphasis on equal treatment for drivers, effectively advancing fair working conditions as a cornerstone of the EU’s social pillar.  \nGREEN_EFA proposes amending Article 3 to explicitly prohibit rest periods in vehicle cabins, ensuring compliance with the Court of Justice’s rulings and safeguarding drivers’ health.  \nGREEN_EFA endorses amendments to limit continuous working periods for coach drivers to 10 days, addressing fatigue-related safety risks while maintaining sector flexibility.  \nGREEN_EFA urges stricter enforcement of detachment rights to prevent “second-class worker” status, reinforcing the issue’s alignment with fair competition principles."
      },
      {
        "party_name": "ECR",
        "score": 0.15492957746478872,
        "choice": 1,
        "stance": "ECR absolutely conflicts with the issue's wage harmonization efforts, viewing them as discriminatory against Eastern European competitiveness rooted in legitimate cost-of-living differences.  \nECR rejects the imposition of uniform social rules on international transport as market fragmentation disguised as worker protection, inconsistent with single market principles.  \nECR opposes impractical mandates like mandatory hotel stays and truck repatriation, condemning them as economically destructive and environmentally hypocritical.  \nECR challenges claims of unregulated driving hours, asserting existing laws lack enforcement rather than requiring new restrictions that target Eastern operators.  \nECR condemns the proposal as a protectionist tool to bankrupt Eastern businesses under false pretenses of social justice, directly contradicting fair competition principles."
      }
    ],
    "resolution": "The European Parliament raised its position by adopting a first-reading stance on the Commission’s 2017 legislative proposal (COM(2017)0281) concerning transport policy, grounded in Treaty provisions (Articles 91(1) and 294 TFEU). It emphasized alignment with the Economic and Social Committee’s 2018 opinion and Committee on Employment and Social Affairs’ input, while prioritizing measures to enhance transport sector efficiency, safety, and social protections. The resolution mandated that the Commission must resubmit the proposal to Parliament if it substantially amends or replaces its initial text, ensuring legislative coherence and parliamentary oversight. The Parliament further directed its President to formally transmit its adopted position to the Council, Commission, and national parliaments, reinforcing procedural adherence and inter-institutional collaboration.",
    "total_score": 0.49865229110512127,
    "total_choice": 4,
    "party_num": 2,
    "id": 33,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.7,
      0.3
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "transport & tourism",
    "title": "Amending Regulation (EC) No 1071/2009 and Regulation (EC) No 1072/2009 with a view to adapting them to developments in the sector: REPORT on the proposal for a regulation of the European Parliament and of the Council amending Regulation (EC) 1071/2009 and Regulation (EC) 1072/2009 with a view to adapting them to developments in the sector",
    "background": "Proposed amendments to EU road transport regulations (1071/2009, 1072/2009) address evolving sector dynamics, including cross-border operations, market access requirements, and social rules. The Parliament will discuss regulatory updates to align with contemporary transport practices, operational challenges, and harmonization needs within the single market framework.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.02,
        "choice": 0,
        "stance": "GREEN_EFA rejects fundamentally the proposed amendments to working time directives as enabling operator exploitation through extended 12-day continuous shifts, directly contradicting CJEU rulings on adequate rest facilities (Article 7 violations).  \nGREEN_EFA opposes the cab-rest normalization clause as institutionalizing subhuman conditions, noting Resolution §14’s failure to prohibit mobile sleeping quarters condemned by transport unions.  \nGREEN_EFA denounces the diluted posting rules as creating second-class labor statuses, violating Treaty Article 153 principles on equal worker protections across all sectors.  \nGREEN_EFA condemns the fatigue-risk escalation through fragmented rest periods, highlighting Keith Taylor’s evidence that 22% of fatal crashes involve sleep-deprived drivers under similar regimes.  \nGREEN_EFA refuses any compromise on social dumping mechanisms in Articles 3-4, which Karima Delli exposed as corporate-led deregulation disguised as “sector modernization”.  "
      },
      {
        "party_name": "SD",
        "score": 0.7058823529411765,
        "choice": 7,
        "stance": "SD strongly upholds the issue’s alignment with social fairness principles, particularly the reduced two-week reference period for driver rest, which enhances health and safety protections in line with SD’s commitment to eliminating second-class worker status.  \nSD proposes strengthening Article 4 to explicitly require weekend rest outside vehicle cabins, ensuring compliance with CJEU rulings and preventing unsafe roadside conditions while maintaining transport efficiency.  \nSD approves the integration of EMPL Committee amendments on immediate application of the posted workers directive to prevent wage dumping, urging stricter enforcement mechanisms to close loopholes for non-EU operators.  \nSD endorses the TRAN Committee’s balanced approach to cabotage reform but suggests monitoring administrative impacts on Eastern European SMEs to avoid disproportionate market distortions.  \nSD emphasizes the need for harmonized per-kilometer pricing across member states to complement “equal pay for equal work” provisions, aligning the issue with fair competition goals while protecting peripheral economies."
      }
    ],
    "resolution": "The European Parliament raised its position on the Commission’s 2017 transport policy proposal (COM(2017)0281), emphasizing alignment with Treaty objectives under Article 91(1) and incorporating input from the Economic and Social Committee’s January 2018 opinion. It formally adopted its first-reading stance, urging the Commission to re-engage Parliament if proposing significant amendments to the original text, and directed its President to transmit the adopted position to the Council, Commission, and national parliaments. The resolution prioritized legislative coherence and procedural accountability while advancing sector-specific measures under the Transport and Tourism Committee’s recommendations, alongside social considerations highlighted by the Employment and Social Affairs Committee.",
    "total_score": 0.3151432469304229,
    "total_choice": 3,
    "party_num": 2,
    "id": 34,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.8,
      0.2
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "transport & tourism",
    "title": "Amending Regulation (EC) No 561/2006 as regards on minimum requirements on maximum daily and weekly driving times, minimum breaks and daily and weekly rest periods and Regulation (EU) 165/2014 as regards positioning by means of tachographs: REPORT on the proposal for a regulation of the European Parliament and of the Council amending Regulation (EC) No 561/2006 as regards on minimum requirements on maximum daily and weekly driving times, minimum breaks and daily and weekly rest periods and Regulation (EU) 165/2014 as regards positioning by means of tachographs",
    "background": "Existing EU road transport regulations on driving times, rest periods, and tachograph use faced challenges in harmonizing enforcement, addressing cross-border operations, and adapting to evolving sector demands amid concerns over driver welfare and market fairness. The Parliament will discuss amendments to these rules to strengthen compliance and operational clarity.",
    "stances": [
      {
        "party_name": "ALDE",
        "score": 0.5384615384615384,
        "choice": 5,
        "stance": "ALDE supports the TRAN committee's compromise solution as a balanced approach to maintaining social rights and internal market functionality, while advising explicit linkage between cabotage operations and posting rules to prevent regulatory gaps.  \nALDE advocates for harmonized enforcement against social dumping but proposes establishing a dedicated EU road transport agency to standardize oversight and reduce administrative fragmentation.  \nALDE advises differentiated regulations for bus drivers' rest periods and exemptions from tachograph requirements for local service vehicles under 150km radius to account for sector-specific operational realities.  \nALDE expresses concern that current driver recruitment challenges stem from inadequate working conditions, urging stricter monitoring of rest period compliance and wage transparency measures.  \nALDE endorses the smart tachograph implementation as a tool for fair competition but cautions against disproportionate administrative burdens on cross-border SMEs in final technical specifications."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.020833333333333332,
        "choice": 0,
        "stance": "GUE/NGL rejects fundamentally the proposal's failure to mandate \"equal pay for equal work\" from the first day of detachment, perpetuating wage discrimination across borders.  \nGUE/NGL opposes the allowance of rest periods in truck cabins, condemning this as institutionalizing inhumane working conditions that endanger both driver health and road safety.  \nGUE/NGL condemns the proposal's alignment with social dumping practices through extended driving times and weakened cabotage rules, directly contradicting worker protection pledges in the 2023 Transport Workers' Charter.  \nGUE/NGL highlights the issue's disregard for union demands to prohibit kilometer-based pay schemes, which exacerbate precarity and illegal labor practices in cross-border operations.  \nGUE/NGL denounces the temperature tolerance loopholes in rest facilities as incompatible with Article 31 of the EU Charter of Fundamental Rights regarding working conditions."
      }
    ],
    "resolution": "The European Parliament raised its position on the Commission’s 2017 proposal (COM(2017)0277) concerning transport sector regulations, emphasizing alignment with Treaty provisions and stakeholder input, including the European Economic and Social Committee’s 2018 opinion. It adopted its first-reading stance, urging the Commission to prioritize social and employment aspects alongside transport efficiency, as highlighted by the Committee on Employment and Social Affairs. The resolution stressed the need for coherence with EU objectives, instructing the Commission to re-engage Parliament if proposing substantial amendments to the original text. It further directed its President to formally transmit the adopted position to the Council, Commission, and national parliaments, ensuring procedural continuity while focusing on policy substance.",
    "total_score": 0.25102319236016374,
    "total_choice": 2,
    "party_num": 2,
    "id": 35,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.7,
      0.3
    ],
    "veto_party_name": "GUE_NGL"
  },
  {
    "topic": "transport & tourism",
    "title": "Application of the Postal Services Directive: REPORT on the application of the Postal Services Directive",
    "background": "The EU Postal Services Directive (1997/67/EC), amended in 2002 and 2008, established rules for postal market liberalization and universal service obligations. Declining letter volumes due to digital substitution and rising cross-border e-commerce parcel demand prompted a 2015 Commission report (COM(2015)0568) on implementation challenges. The Parliament will discuss the directive's application, market adaptation to digitalization, universal service sustainability, and competition dynamics.",
    "stances": [
      {
        "party_name": "ALDE",
        "score": 0.8813559322033898,
        "choice": 8,
        "stance": "ALDE strongly promotes the issue’s emphasis on independent national regulatory authorities, aligning perfectly with ALDE’s longstanding commitment to fair market oversight and preventing conflicts of interest in liberalized sectors.  \nALDE applauds the focus on fostering fair competition between universal service providers and new entrants, which effectively advances ALDE’s priority of creating a dynamic, innovation-driven single market.  \nALDE strongly endorses the call for cross-border parcel delivery reforms and opposition to protectionism, recognizing this as critical to harmonizing e-commerce opportunities across the EU.  \nALDE approves the forward-looking approach to digital innovations like drone deliveries, urging swift implementation while maintaining safety standards as highlighted in the issue.  \nALDE proposes enhancing flexibility in universal service obligations to allow Member States greater adaptability, ensuring affordability without compromising accessibility for remote areas."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.02040816326530612,
        "choice": 0,
        "stance": "GUE/NGL rejects the issue's reliance on market liberalization, citing evidence of deteriorated service quality, reduced accessibility in rural areas, and worsened labor conditions as firmly doubting with their commitment to robust public services.  \n\nGUE/NGL opposes the issue’s failure to halt privatization-driven \"cherry-picking,\" which undermines universal service obligations by prioritizing profitable urban markets over equitable access for all citizens.  \n\nGUE/NGL condemns the proposal’s tolerance of precarious employment practices, noting that the 4.4% decline in postal sector jobs and wage reductions directly contradict their mandate for worker protections and social dialogue.  \n\nGUE/NGL disputes the issue’s framing of regulatory flexibility, arguing that allowing Member States to adapt USO risks legitimizing service cuts in remote regions—a critical oversight in addressing geographic inequality.  \n\nGUE/NGL demands explicit rejection of digital substitution’s role in eroding letter services, asserting that postal infrastructure remains vital to social cohesion and cannot be replaced by profit-driven parcel monopolies."
      }
    ],
    "resolution": "The European Parliament raised concerns about the evolving EU postal sector, noting a 4.85% decline in letter volumes (2012–2013) due to digital substitution, while parcel delivery grew by 33% (2008–2011), driven by e-commerce. It stressed the need to maintain universal service obligations (USO), ensuring affordable, five-day weekly delivery and collection, accessibility for disabled users and remote areas, and flexibility for Member States to adapt services to local needs. The resolution highlighted the dominance of universal service providers (USPs) despite market liberalization and called for stronger, independent national regulatory authorities (NRAs) to prevent conflicts of interest, enforce fair competition, and address \"cherry-picking\" by new entrants. It urged transparency in cross-border parcel pricing, reduced disparities between domestic and international tariffs, and improved consumer protections via Alternative Dispute Resolution (ADR) mechanisms, noting only 24 Member States had transposed the ADR Directive by July 2015. The Parliament emphasized leveraging digital innovations like drones for remote deliveries while ensuring safety and environmental sustainability. On employment, it advocated for decent working conditions, monitoring precarious jobs (e.g., part-time and self-employed roles), enforcing health and safety standards, and supporting social dialogue to address a 4.4% decline in postal employment (2012–2013). It called for EU-wide data collection on parcel markets, VAT exemption reforms to level the playing field, and measures to align postal services with the Digital Single Market, including interoperability, track-and-trace systems, and consumer trust initiatives.",
    "total_score": 0.6986899563318777,
    "total_choice": 6,
    "party_num": 2,
    "id": 36,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.7,
      0.3
    ],
    "veto_party_name": "ALDE"
  },
  {
    "topic": "transport & tourism",
    "title": "A European strategy on Cooperative Intelligent Transport Systems: REPORT on a European strategy on Cooperative Intelligent Transport Systems",
    "background": "The EU's 2010 Intelligent Transport Systems Directive and 2016 Commission strategy aimed to advance connected mobility, amid global C-ITS developments. Road transport challenges included human-error accidents, emissions, congestion, and interoperability needs. The Parliament will discuss the EU's C-ITS deployment strategy, focusing on cross-border integration, safety improvements, and technological standardization.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9483568075117371,
        "choice": 9,
        "stance": "EPP fully sanctions the harmonized legal framework for C-ITS interoperability and cybersecurity, as this perfectly aligns with EPP’s longstanding commitment to seamless EU-wide infrastructure and risk mitigation in emerging technologies.  \nEPP perfectly aligns with the technology-neutral approach ensuring backward compatibility across connected and non-connected vehicles, reflecting EPP’s prioritization of phased, inclusive mobility transitions.  \nEPP applauds the issue’s emphasis on regulated data access for innovation, which effectively advances EPP’s vision of GDPR-compliant data economies and user-centric transparency in algorithmic systems.  \nEPP strongly sanctions the integration of C-ITS with Galileo/EGNOS and 5G networks, recognizing this as critical to maintaining Europe’s global leadership in smart transportation and cross-sector innovation.  \nEPP highlights the issue’s cybersecurity mandates as exemplary, safeguarding both transport systems and fair competition—a cornerstone of EPP’s digital single market agenda."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.7346938775510204,
        "choice": 7,
        "stance": "GUE/NGL strongly endorses the issue’s alignment with climate action and road safety goals through C-ITS deployment, reflecting their commitment to sustainable mobility and accident prevention.  \nGUE/NGL approves the integration of Galileo/EGNOS and 5G networks as pivotal to achieving precise, low-emission transport systems, consistent with their advocacy for technological sovereignty.  \nGUE/NGL emphasizes the need to strengthen GDPR enforcement in C-ITS, proposing explicit requirements for real-time user consent revocation and independent audits of algorithmic decision-making.  \nGUE/NGL advocates for binding funding allocations under Horizon 2020 to prioritize public-sector digital infrastructure projects over private monopolies.  \nGUE/NGL highlights the issue’s social equity focus, urging accelerated implementation of accessibility measures for vulnerable users to align with their principles of inclusive mobility."
      }
    ],
    "resolution": "The European Parliament raised the importance of advancing Cooperative Intelligent Transport Systems (C-ITS) to enhance road safety, reduce emissions, and promote sustainable mobility, noting that 92% of road accidents stem from human error and C-ITS technologies could mitigate risks. It emphasized the need for a harmonized EU legal framework, including delegated acts under Directive 2010/40/EU, to ensure interoperability, cybersecurity, and backward compatibility of C-ITS services, while prioritizing deployment of high-safety services by 2019. The resolution highlighted the role of C-ITS in supporting autonomous vehicles, reducing congestion, and cutting CO2 emissions through innovations like platooning and optimized infrastructure use. It stressed compliance with GDPR and data protection principles, advocating for transparency in algorithmic decision-making, user consent for data usage, and an \"offline mode\" to prevent data exploitation. Funding through Horizon 2020, Connecting Europe Facility, and other EU programs was urged to upgrade digital and physical infrastructure, alongside calls for cross-sector collaboration, standardized sensor systems, and integration with EU satellite navigation (Galileo/EGNOS) and 5G networks. The Parliament also emphasized addressing the coexistence of connected and non-connected vehicles, promoting vocational training for emerging mobility jobs, and ensuring accessibility for vulnerable users. It warned against fragmented national approaches, advocating for global leadership in C-ITS to maintain EU competitiveness, with a 2022 review to assess progress and potential legislative action. Cybersecurity, technology neutrality, and strict emission monitoring were underscored as critical to safeguarding systems and achieving climate goals.",
    "total_score": 0.8606896551724138,
    "total_choice": 8,
    "party_num": 2,
    "id": 37,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.2,
      0.8
    ],
    "veto_party_name": "GUE_NGL"
  },
  {
    "topic": "transport & tourism",
    "title": "Enforcement requirements and specific rules for posting drivers in the road transport sector: REPORT on the proposal for a directive of the European Parliament and of the Council amending Directive 2006/22/EC as regards enforcement requirements and laying down specific rules with respect to Directive 96/71/EC and Directive 2014/67/EU for posting drivers in the road transport sector",
    "background": "Disparities in social standards enforcement and cross-border operational challenges within the EU road transport sector prompted calls for regulatory alignment to prevent unfair competition. The Parliament will discuss amendments to existing directives to establish sector-specific rules for posted drivers, addressing enforcement mechanisms and harmonizing working conditions across member states.",
    "stances": [
      {
        "party_name": "ALDE",
        "score": 0.75,
        "choice": 7,
        "stance": "ALDE strongly upholds the TRAN committee’s compromise, emphasizing that the issue effectively advances ALDE’s priority of balancing internal market efficiency with robust social protections for drivers.  \nALDE approves the harmonization of posting rules and cabotage provisions, which aligns with their longstanding commitment to eliminating social dumping while preserving cross-border operational flexibility.  \nALDE endorses the exclusion of international transport from stringent posting requirements, recognizing the impracticality of hourly wage calculations during multi-country transits.  \nALDE proposes enhancing enforcement through a centralized European road transport agency to standardize procedures and address regulatory fragmentation, framing this as a logical extension of the issue’s goals.  \nALDE strongly upholds modernized tachograph systems and targeted exemptions for specialized transport sectors, ensuring safety and fairness without overburdening operators."
      },
      {
        "party_name": "ECR",
        "score": 0.09859154929577464,
        "choice": 0,
        "stance": "ECR fully challenges the issue's characterization of wage differentials as social dumping, asserting that Eastern Europe's competitive labor costs derive from legitimate regional economic conditions rather than unfair practices.  \nECR rejects the imposition of uniform posting rules as market fragmentation disguised as social protection, directly conflicting with their commitment to preserve single market fluidity across diverse national economies.  \nECR condemns mandatory return requirements for drivers every three weeks as environmentally destructive and operationally unfeasible, highlighting the absence of adequate parking infrastructure as proof of regulatory detachment from reality.  \nECR disputes the issue's enforcement narrative as disingenuous, emphasizing that Western states' failure to implement existing driving time bans (e.g., 15-hour shifts) exposes pretextual motives for new restrictions.  \nECR denounces the proposal as an orchestrated attack on Eastern European transport firms to mask Western labor shortages, violating treaty principles of non-discrimination and fair competition."
      }
    ],
    "resolution": "The European Parliament adopted its position at first reading on the Commission’s proposal (COM(2017)0278) concerning transport regulations, urging the Commission to resubmit the matter to Parliament if it substantially amends or replaces its proposal. The resolution emphasized alignment with Treaty provisions on EU legislative procedures and transport policy (Articles 294 and 91 TFEU), integrating opinions from the European Economic and Social Committee and parliamentary committees. It mandated forwarding the adopted position to the Council, Commission, and national parliaments to ensure procedural continuity, while underscoring adherence to legislative protocols under Rule 59 of Parliament’s Rules of Procedure.",
    "total_score": 0.42587601078167114,
    "total_choice": 4,
    "party_num": 2,
    "id": 38,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.9,
      0.1
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "transport & tourism",
    "title": "Cross-border exchange of information on road safety related traffic offences: REPORT on the proposal for a directive of the European Parliament and of the Council on facilitating cross-border exchange of information on road safety related traffic offences",
    "background": "The annulment of the 2011 EU directive on cross-border traffic offence enforcement due to legal basis issues necessitated a revised proposal under transport policy rules. Non-resident drivers' frequent evasion of penalties highlighted gaps in addressing road safety violations. The Parliament will discuss measures to enable cross-border information exchange for enforcing traffic offence sanctions.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9556650246305419,
        "choice": 9,
        "stance": "EPP absolutely advocates the directive's creation of a standardized electronic data exchange system, perfectly aligning with their commitment to cross-border judicial cooperation and road safety. This system ensures equal treatment of all drivers regardless of nationality.  \nEPP perfectly aligns with the issue's inclusion of all 28 member states, emphasizing that road safety transcends national borders and requires unified enforcement across the EU.  \nEPP highlights the directive's potential to save 350-400 lives annually as a critical advancement toward their goal of halving road fatalities by 2020, fully supporting its immediate implementation.  \nEPP proposes enhancing future iterations by expanding the scope to additional traffic offences once the current framework demonstrates operational success, ensuring continuous improvement in road safety measures.  \nEPP strongly advocates for complementary infrastructure upgrades and driver education campaigns, viewing these as essential components of a comprehensive strategy to achieve \"Vision Zero\" traffic fatalities."
      },
      {
        "party_name": "EFDD",
        "score": 0.4358974358974359,
        "choice": 4,
        "stance": "EFDD slightly endorses the directive's aim to improve cross-border enforcement but requests amendments to Article 4 requiring immediate on-site fine payment mechanisms for commercial operators.  \nEFDD objects to centralized EU data systems as incompatible with subsidiarity principles, proposing instead bilateral agreements between member states' traffic authorities.  \nEFDD insists on removing provisions for shared technological infrastructure, citing unresolved implementation failures under the Prüm framework.  \nEFDD demands stricter verification protocols for foreign licenses in Section 7 to combat counterfeit documents without creating pan-European databases.  \nEFDD warns that standardized cross-border penalty points would undermine national judicial sovereignty, requiring explicit opt-out clauses."
      }
    ],
    "resolution": "The European Parliament raised its position on a legislative proposal concerning transport policies, based on the 2014 Commission proposal (COM(2014)0476) and aligned with Treaty on the Functioning of the European Union Articles 294(2) and 91(1)(c). It endorsed the Committee on Transport and Tourism’s 2015 report (A8-0001/2015), incorporating the European Economic and Social Committee’s October 2014 opinion and consultations with the Committee of the Regions. The resolution adopted Parliament’s first reading stance, emphasizing the need for the Commission to re-submit the proposal to Parliament if intending substantial amendments or replacements. It further instructed the Parliament’s President to formally communicate its position to the Council, Commission, and national parliaments, ensuring procedural continuity and institutional alignment in the legislative process.",
    "total_score": 0.8614457831325302,
    "total_choice": 8,
    "party_num": 2,
    "id": 39,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.4,
      0.6
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "transport & tourism",
    "title": "Daily and weekly driving times, minimum breaks and rest periods and positioning by means of tachographs: REPORT on the proposal for a regulation of the European Parliament and of the Council amending Regulation (EC) No 561/2006 as regards on minimum requirements on maximum daily and weekly driving times, minimum breaks and daily and weekly rest periods and Regulation (EU) 165/2014 as regards positioning by means of tachographs",
    "background": "Existing EU regulations on road transport aimed to harmonize driver working conditions and safety standards across member states, addressing concerns over fair competition and road safety. The Parliament will discuss proposed amendments to update rules on maximum driving times, minimum rest periods, and tachograph use to address enforcement challenges and sector evolution.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.8653846153846154,
        "choice": 8,
        "stance": "GREEN_EFA strongly promotes the issue's emphasis on preventing driver fatigue as critical to road safety, aligning with their manifesto commitment to reducing traffic fatalities through enforceable working time limits.  \nGREEN_EFA approves the integration of equal treatment principles for transport workers, ensuring drivers receive protections equivalent to other EU sectors as demanded in Terry Reintke's equality arguments.  \nGREEN_EFA proposes amending Article 4 to explicitly prohibit counting cabin rest periods toward daily rest requirements, reinforcing the Court of Justice's stance against inadequate recuperation environments.  \nGREEN_EFA applauds the rejection of extended 12-day work cycles for coach drivers, a measure Keith Taylor successfully advocated to align duty time calculations with physical and mental health safeguards.  \nGREEN_EFA emphasizes strict enforcement of posted workers' rights to prevent social dumping, converting Karima Delli's warnings about \"modern slavery\" into a call for enhanced cross-border labor inspections."
      },
      {
        "party_name": "ECR",
        "score": 0.16901408450704225,
        "choice": 1,
        "stance": "ECR rejects the proposal's framing of wage competition as \"social dumping,\" asserting that cost-of-living differentials naturally justify competitive labor markets (Resolution Art. 91 TFEU application). This fundamentally challenges with ECR's free market principles.  \nECR opposes mandatory return requirements for trucks every three weeks, citing environmental damage from unnecessary mileage and lack of infrastructure (Positioning Rules §4). The proposal overlooks logistical realities in Eastern Europe.  \nECR challenges claims of driver exploitation under current laws, noting existing driving time prohibitions are sufficient if properly enforced (Annex II.15). New restrictions constitute market fragmentation disguised as social protection.  \nECR condemns imposed hotel stay mandates as economically unfeasible for SMEs, creating artificial barriers to cross-border operations (Rest Periods §7b). Such requirements contradict single market cohesion goals.  \nECR disputes the issue's premise of uniform social standards, arguing regional economic diversity requires flexible sector-specific regulations (Recital 9). The measure ignores competitive parity between member states."
      }
    ],
    "resolution": "The European Parliament raised its position at first reading on the Commission’s 2017 proposal (COM(2017)0277) concerning transport policy, grounded in Treaty provisions (Articles 294(2), 91(1), and 294(3) TFEU) and incorporating the European Economic and Social Committee’s January 2018 opinion. It emphasized the need for coherent legislative alignment, urging the Commission to resubmit the proposal if substantial amendments arise, and directed its President to formally communicate Parliament’s position to the Council, Commission, and national parliaments to ensure procedural continuity and institutional coordination.",
    "total_score": 0.5283018867924528,
    "total_choice": 5,
    "party_num": 2,
    "id": 40,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.7,
      0.3
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "transport & tourism",
    "title": "Delivering multimodal integrated ticketing in Europe: REPORT on delivering multimodal integrated ticketing in Europe",
    "background": "The EU established frameworks for Intelligent Transport Systems and a Single European Transport Area, but fragmented national ticketing systems, data interoperability barriers, and persistent consumer reliance on individual transport hindered seamless cross-border multimodal travel. The Parliament will discuss integrated EU-wide ticketing solutions to improve transport efficiency, accessibility, and sustainability.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.9772727272727273,
        "choice": 9,
        "stance": "GREEN_EFA firmly endorses the issue’s emphasis on modern IT solutions for seamless ticketing, perfectly aligning with their commitment to eco-innovation and job creation through sustainable digital infrastructure.  \nGREEN_EFA perfectly aligns with the issue’s climate-focused energy savings in transport, recognizing this as critical to achieving the EU’s 2030 emissions targets as outlined in their Green Mobility Agenda.  \nGREEN_EFA firmly endorses the call for a single travel document to protect passenger rights, seeing this as foundational to upholding EU citizens’ freedom of movement and social equity.  \nThe issue effectively advances GREEN_EFA’s vision of multimodal integration by prioritizing fair competition between transport modes over car-centric infrastructure investments.  \nThis aligns perfectly with GREEN_EFA’s demand for binding sustainability metrics in transport policy, ensuring environmental costs inform traveler choices and subsidy allocations."
      },
      {
        "party_name": "ECR",
        "score": 0.36923076923076925,
        "choice": 3,
        "stance": "ECR partly accepts the passenger-centric approach but requests revisions to mandate explicit Article 3 amendments requiring reduced fares for disabled persons and multi-child families, citing inadequate market-driven solutions.  \nECR completely againsts with the issue’s centralized data governance model in Clause 5, arguing it undermines national transport operators’ autonomy contrary to subsidiarity principles.  \nThe proposal overlooks critical tourism sector needs by failing to require multilingual booking interfaces; ECR demands Annex II inclusion of all EU official languages for ticket platforms.  \nECR rejects standardized pricing structures in Section 4.2 as incompatible with regional economic disparities, advocating instead for member-state-defined concessionary schemes.  \nWhile acknowledging accessibility goals, ECR contends the issue’s \"first and last mile\" provisions inadequately address rural connectivity gaps, requiring revised TEN-T corridor funding allocations."
      }
    ],
    "resolution": "The European Parliament raised the need for EU-wide integrated multimodal travel information, planning, and ticketing systems to address challenges in sustainability, efficiency, labor mobility, and social cohesion. It emphasized that seamless cross-border and multimodal journeys, supported by interoperable real-time data, are essential for a competitive single market and passenger rights, particularly for long-distance travel. The resolution highlighted the lack of progress since the 2011 White Paper’s goals, noting persistent gaps in interoperable ticketing, inconsistent data formats, and limited online booking options. It called for legislative action by 2020 if voluntary initiatives fail, urging minimum rules for integrated ticketing, fair data access for SMEs, and a Charter of Passengers’ Rights by 2017 to protect multimodal travelers. The Parliament stressed the importance of transparent pricing, barrier-free access for vulnerable groups, and incentives for sustainable transport, including car-sharing and cycling. It advocated leveraging EU funds like Horizon 2020 and the Connecting Europe Facility to support innovation, GNSS (e.g., Galileo) for real-time updates, and high-speed digital infrastructure. Data protection under Directive 95/46/EC was underscored, requiring anonymized personal data use. The resolution also urged collaboration among stakeholders, TEN-T corridors as pilot projects, and equitable revenue-sharing models to avoid monopolies, while promoting regional authorities’ role in addressing “first and last mile” connectivity. Environmental performance metrics and internalizing external transport costs were deemed critical for informed traveler choices.",
    "total_score": 0.7949479940564635,
    "total_choice": 7,
    "party_num": 2,
    "id": 41,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.1,
      0.9
    ],
    "veto_party_name": "ECR"
  },
  {
    "topic": "transport & tourism",
    "title": "Deployment of infrastructure for alternative fuels in the EU: time to act!: REPORT on deployment of infrastructure for alternative fuels in the European Union: time to act!",
    "background": "Persistent EU transport sector emissions growth since 1990, accounting for 23% of CO₂, coupled with 94% oil dependency and incomplete member state compliance with 2014 infrastructure targets, highlighted urgent decarbonization needs. The Parliament will discuss accelerating alternative fuels infrastructure deployment to meet climate commitments and enhance energy security.",
    "stances": [
      {
        "party_name": "SD",
        "score": 0.43315508021390375,
        "choice": 4,
        "stance": "SD partly promotes the infrastructure expansion goals but demands binding enforcement mechanisms for member states failing to meet charging network obligations, particularly in Eastern Europe.  \nSD requests revising funding distribution to prioritize municipal electrification programs, noting the issue’s rural focus overlooks cities’ capacity to pilot zero-emission transport.  \nSD highlights that the €800 million allocation fully againsts with S&D’s demand for equitable infrastructure access, requiring tripled investments via CEF grants for lagging regions.  \nSD urges amendments to Article 9 to mandate tax incentives for automakers transitioning ≥50% of production to BEVs by 2027, addressing market imbalances favoring ICE models.  \n SD questions the phased fossil fuel approach, advocating immediate bans on fossil-based biofuels in urban transport contracts to align with 2030 climate benchmarks."
      },
      {
        "party_name": "ECR",
        "score": 0.06944444444444445,
        "choice": 0,
        "stance": "ECR rejects the issue's binding infrastructure targets as incompatible with practical timelines for phased public-private investment and regional development capacities.  \nECR opposes fundamentally the rapid phase-out of conventional vehicles, emphasizing that consumer reliance on existing transport cannot be abruptly discontinued without guaranteed nationwide charging networks.  \nThe proposal overlooks critical aspects such as current EV range limitations and rural accessibility gaps, which ECR stresses require patient infrastructure buildup before mandating transitions.  \nECR contends the issue’s €25 billion funding demand by 2025 contradicts fiscal realism, advocating instead for incremental member-state-led budgeting aligned with market readiness.  \nThis fundamentally rejects with ECR’s position that technology neutrality must prioritize consumer choice over forced adoption of unproven urban-centric charging systems."
      }
    ],
    "resolution": "The European Parliament raised concerns over the slow progress in deploying alternative fuels infrastructure and achieving transport decarbonization, noting that only 8 of 25 EU Member States fully met national policy framework requirements under Directive 2014/94/EU, while two failed to submit plans. It emphasized the urgency of reducing transport emissions, which account for 23% of EU CO2 emissions and are still rising, with road transport responsible for 73% of sector emissions. The resolution called for revising the Directive to enforce binding national targets, expand infrastructure coverage beyond TEN-T core networks to urban and rural areas, and prioritize zero-emission solutions like electricity, hydrogen, and advanced biofuels, while phasing out fossil-based alternative fuels. It highlighted funding gaps, noting the Commission’s proposed €800 million as insufficient against projected needs of €5.2 billion by 2020 and €25 billion by 2025, urging increased public-private investment and leveraging EU funds like CEF and Horizon Europe. The Parliament stressed technology neutrality, interoperability, smart grids, and consumer incentives, including tax reforms and transparent labeling. It criticized the limited availability of electric vehicles (19 BEVs and 25 PHEVs in 2017 vs. 417 ICE models) and urged manufacturers to scale production. Additional measures included shore-side electricity for ports, electrified roads, and integrating renewable energy. The resolution also demanded life-cycle assessments for fuels, sustainability criteria for hydrogen, and accelerated maritime decarbonization, while underscoring the need for cohesive EU-wide strategies to meet Paris Agreement goals and achieve net-zero transport emissions by 2050.",
    "total_score": 0.29132791327913277,
    "total_choice": 2,
    "party_num": 2,
    "id": 42,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.1,
      0.9
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "transport & tourism",
    "title": "European Maritime Safety Agency: REPORT on the proposal for a regulation of the European Parliament and of the Council amending Regulation (EC) No 1406/2002 establishing a European Maritime Safety Agency",
    "background": "Persistent migration pressures, fragmented national coastguard authorities, and overlapping maritime surveillance mandates across EU agencies highlighted inefficiencies in addressing maritime emergencies, border security, and environmental threats. The Parliament will discuss regulatory amendments to strengthen cross-agency cooperation for integrated maritime safety, border control, and crisis response within existing EU frameworks.",
    "stances": [
      {
        "party_name": "ENF",
        "score": 0.037037037037037035,
        "choice": 0,
        "stance": "ENF firmly opposes the creation of EU maritime agencies as fiscal irresponsibility conflicting with national sovereignty principles.  \nENF rejects binding deadlines for member states as illegitimate supranational overreach into domestic governance.  \nENF condemns procedural manipulation in report adoption as undemocratic erosion of parliamentary accountability.  \nENF asserts the issue facilitates illegal migration infrastructure rather than border control priorities.  \nENF declares the proposal disregards public opposition to EU centralization exemplified by Brexit referendum outcomes."
      },
      {
        "party_name": "ALDE",
        "score": 0.9508196721311475,
        "choice": 9,
        "stance": "ALDE totally agrees the integration of EMSA and EFCA resources to establish a European Border and Coast Guard, perfectly aligning with ALDE's commitment to preventing maritime tragedies and dismantling human trafficking networks.  \nALDE perfectly aligns with leveraging geolocation technologies and maritime expertise to systematically disrupt criminal operations while prioritizing humanitarian rescue missions.  \nALDE totally agrees Amendment 1's safeguards ensuring collaborative frameworks maintain each agency’s core mandate, reflecting ALDE’s principle of structured inter-agency cooperation with accountability.  \nALDE fully supports the European Border and Coast Guard Agency’s reliance on EMSA and EFCA’s technical proficiency in electronic reporting and environmental protection to address migration risks effectively.  \nALDE perfectly aligns with utilizing high-tech ship monitoring and anti-illegal fishing measures as critical tools for the new agency’s success in managing complex security challenges."
      }
    ],
    "resolution": "The European Parliament raised its position by adopting the Commission’s 2015 proposal (COM(2015)0667) at first reading, endorsing measures to advance EU transport policy objectives. It emphasized alignment with the European Economic and Social Committee’s March 16, 2016 opinion and incorporated input from the Committee on Transport and Tourism and the Committee on Civil Liberties, Justice and Home Affairs. The resolution urged the Commission to re-engage Parliament if proposing significant amendments or alternative texts to ensure legislative coherence. It further directed its President to transmit the adopted position to the Council, Commission, and national parliaments, reinforcing procedural continuity and inter-institutional collaboration while prioritizing the original proposal’s substantive framework.",
    "total_score": 0.7761627906976745,
    "total_choice": 7,
    "party_num": 2,
    "id": 43,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.2,
      0.8
    ],
    "veto_party_name": "ENF"
  },
  {
    "topic": "transport & tourism",
    "title": "Odometer manipulation in motor vehicles: revision of the EU legal framework: REPORT with recommendations to the Commission on odometer manipulation in motor vehicles: revision of the EU legal framework",
    "background": "Widespread odometer tampering in cross-border used car trade, estimated economic losses of €5.6-9.6 billion annually, safety risks from undetected vehicle wear, and fragmented national measures against fraud prompted EU action. The Parliament will discuss harmonizing legal frameworks to prevent odometer manipulation and enhance consumer protection in the single market.",
    "stances": [
      {
        "party_name": "EFDD",
        "score": 0.30952380952380953,
        "choice": 3,
        "stance": "EFDD partially supports the criminalization of odometer fraud but requests revisions to ensure harmonized penalties across member states, noting the issue’s failure to address disparate sanctions like Slovakia’s €220 fines versus France’s prison terms.  \nEFDD totally condemns centralized EU mileage databases as inconsistent with its principles of minimal data collection, arguing the proposal overlooks practical enforcement challenges and risks bureaucratic overreach.  \nEFDD rejects reliance on cross-border data systems like EUCARIS without binding legal harmonization, citing Daniela Aiuto’s critique that fragmented national laws render anti-fraud measures ineffective.  \nEFDD conditionally endorses tamper-proof odometer standards but demands amendments to limit connectivity mandates, warning against unwarranted vehicle tracking incompatible with privacy priorities.  \nEFDD highlights contradictions in promoting blockchain solutions while ignoring jurisdictional enforcement gaps, urging penalties to align with EFDD’s stricter stance on financial crime deterrence."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.9166666666666666,
        "choice": 9,
        "stance": "GUE/NGL fundamentally upholds the criminalization of odometer fraud as a serious offense, perfectly aligning with their commitment to consumer protection and market fairness across all EU regions.  \nGUE/NGL strongly approves the mandatory adoption of tamper-proof odometers with secure hardware, recognizing this as a critical step to end predatory practices targeting Central and Eastern European consumers.  \nGUE/NGL perfectly aligns with the cross-border data exchange via EUCARIS, emphasizing its necessity to eliminate fraudulent vehicle sales and uphold single-market integrity.  \nGUE/NGL fundamentally upholds replicating Belgium’s Car-Pass system EU-wide, highlighting its proven effectiveness in reducing fraud while safeguarding data protection standards.  \nGUE/NGL strongly approves real-time mileage verification tools and blockchain integration, advancing their priority to empower consumers against corporate malpractice through transparent technical solutions."
      }
    ],
    "resolution": "The European Parliament raised concerns about widespread odometer tampering in the EU, estimating that 5-12% of used cars in national sales and 30-50% in cross-border sales are affected, causing €5.6-9.6 billion in annual economic damage. It highlighted risks to consumers, road safety, emissions compliance, and market trust, particularly impacting lower-income regions and newer EU member states. The resolution urged the Commission to propose a legislative framework within 12 months to criminalize odometer fraud, mandate tamper-proof odometers using secure hardware (e.g., HSM/SHE at €1 per vehicle cost), and enforce cross-border data exchange via EUCARIS to track mileage from a vehicle’s first registration through inspections and maintenance. It emphasized adopting national databases modeled on Belgium’s Car-Pass and the Netherlands’ NAP systems, which reduced fraud by collecting mileage data without personal details. The Parliament also called for updating type-approval regulations (e.g., Regulation 2017/1151) to include odometer security testing, exploring blockchain solutions for data integrity, and ensuring penalties for manipulation. It stressed consumer access to mileage verification tools, connectivity features in modern vehicles for real-time data transmission, and alignment with EU data protection standards.",
    "total_score": 0.7811217510259918,
    "total_choice": 7,
    "party_num": 2,
    "id": 44,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.5,
      0.5
    ],
    "veto_party_name": "EFDD"
  },
  {
    "topic": "transport & tourism",
    "title": "Implementation of the 2011 White paper on transport: REPORT on the implementation of the 2011 White Paper on Transport: taking stock and the way forward towards sustainable mobility",
    "background": "The 2011 EU Transport White Paper outlined targets for a competitive, resource-efficient transport system, with 2015 marking its mid-term review amid ongoing challenges including transport's 5% GDP contribution, rising GHG emissions, fossil fuel dependency, and infrastructure disparities. The Parliament will discuss progress assessment and strategies for advancing sustainable mobility goals.",
    "stances": [
      {
        "party_name": "EFDD",
        "score": 0.07692307692307693,
        "choice": 0,
        "stance": "EFDD rejects the issue's approach to TEN-T projects as a direct infringement on national sovereignty, particularly opposing forced completion timelines that override member state infrastructure priorities.  \nEFDD entirely challenges EU-wide road-charging schemes and weight directive revisions, which dismantle member states' rights to set road safety standards under Recital 8 of Directive 2015/719.  \nThe proposal overlooks critical fiscal responsibility by endorsing wasteful investments like urban cable cars, exemplified by the UK's Thames project with its unsustainable operational costs.  \nThis issue conflicts with EFDD's anti-centralization principles through expanded Commission powers to fund \"priority\" projects like the disproven Torino-Lione rail link against local opposition.  \nEFDD condemns the issue's failure to curb social dumping effectively, as cabotage rule reforms remain inadequate against systemic fraud in transport labor markets."
      },
      {
        "party_name": "SD",
        "score": 0.9593023255813954,
        "choice": 9,
        "stance": "SD fundamentally upholds the issue's integration of gender equality and labor standards in transport, perfectly aligning with SD's commitment to social justice and fair working conditions across all mobility sectors.  \nSD perfectly aligns with the TEN-T completion targets and cross-border infrastructure priorities, recognizing their critical role in eliminating East-West disparities and advancing territorial cohesion as core SD principles.  \nSD fundamentally upholds the issue's emphasis on doubling urban public transport usage through SUMPs, reflecting SD's longstanding advocacy for emission-free cities and real-time multimodal integration.  \nSD strongly advocates the binding 60% GHG reduction target by 2050, viewing it as fully consistent with SD's climate emergency declarations and decarbonization roadmap for transport.  \nSD fundamentally upholds the call to internalize external transport costs through EU methodologies, aligning perfectly with SD's polluter-pays policy framework for sustainable logistics."
      }
    ],
    "resolution": "The European Parliament raised concerns about the transport sector’s heavy reliance on fossil fuels, its role as the only sector with rising greenhouse gas emissions over 25 years, and the urgent need to transition toward sustainability while maintaining competitiveness. It highlighted the sector’s economic importance, employing 10 million people and contributing 5% of EU GDP, and stressed the necessity of completing the Trans-European Transport Network (TEN-T) by 2030 to enhance connectivity, reduce disparities, and prioritize rail, inland waterways, and sustainable infrastructure. The resolution called for updating emission reduction targets to align with a 40% domestic GHG reduction by 2030 and a 60% reduction by 2050, advocating for decarbonization strategies, electrification of transport, and advanced biofuels from waste. It urged increased funding for the Connecting Europe Facility (CEF) and the European Fund for Strategic Investments (EFSI) to address underinvestment, prioritize sustainable projects, and mobilize private finance. The Parliament emphasized optimizing multimodal transport systems, internalizing external costs through EU-wide methodologies, and promoting intelligent transport technologies. It proposed doubling urban public transport use by 2030, supported by Sustainable Urban Mobility Plans (SUMPs) and EU funding, while addressing road safety (noting 90% of fatalities occur on urban/rural roads) and passenger rights. Additional measures included shifting 50% of dangerous goods transport to rail and waterways by 2030, fostering cycling networks, regulating shared mobility services fairly, and ensuring gender equality and quality jobs in the sector. The resolution also stressed digitalization, harmonized administrative procedures, and global leadership in sustainable transport standards, aligning with COP21 climate goals to limit global warming below 2°C.",
    "total_score": 0.7388724035608308,
    "total_choice": 7,
    "party_num": 2,
    "id": 45,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.4,
      0.6
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "transport & tourism",
    "title": "Market access to port services and financial transparency of ports: REPORT on the proposal for a regulation of the European Parliament and of the Council establishing a framework on market access to port services and financial transparency of ports",
    "background": "In 2013, the European Commission proposed regulations addressing disparities in port service market access and financial governance across EU member states, amid varying national frameworks and the strategic role of ports handling 75% of external trade. The Parliament will discuss establishing standardized rules for port service competition and fiscal accountability.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9563106796116505,
        "choice": 9,
        "stance": "EPP absolutely sanctions the issue's balanced approach to port service fees, ensuring fair cost distribution for smaller ports while maintaining EU competitiveness.  \nEPP perfectly aligns with the issue's respect for subsidiarity, allowing ports autonomy in organization and service management tailored to regional needs.  \nEPP fully supports the enhanced financial transparency provisions that prevent illegal state aid and ensure equal competition across all port operators.  \nEPP endorses the issue's flexibility for peripheral regions and small ports to avoid disproportionate bureaucratic burdens, reinforcing operational efficiency.  \nEPP applauds the issue's alignment with EPP priorities by safeguarding worker training requirements and port safety standards while promoting market-driven service quality."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.021739130434782608,
        "choice": 0,
        "stance": "GREEN_EFA opposes fundamentally the proposal's failure to incorporate mandatory environmental safeguards such as Natura 2000 assessments, directly contradicting their ecological sustainability principles.  \nGREEN_EFA rejects the uniform market-access model that disregards regional port diversity, noting this violates their commitment to context-sensitive EU policymaking.  \nGREEN_EFA condemns the legislation's detachment from parallel state-aid guideline development, creating legal uncertainty that undermines financial transparency goals central to anti-corruption efforts.  \nGREEN_EFA disputes the proposal's omission of binding social protections for port workers, inconsistent with their manifesto demands for collective bargaining rights and decent labor standards.  \nGREEN_EFA highlights the issue's incompatibility with sustainable transport networks by prioritizing liberalization over coastal ecosystem preservation and accident prevention protocols."
      }
    ],
    "resolution": "The European Parliament raised concerns regarding the Commission’s 2013 legislative proposal (COM(2013)0296) on transport policy, particularly addressing objections from eight national parliaments across seven member states (Spain, France, Italy, Latvia, Malta, Poland, Sweden) that the proposal breached the subsidiarity principle by encroaching on national competencies. The Parliament adopted its first-reading position, aligning with the Committee on Transport and Tourism’s recommendations, and urged the Commission to reassess the proposal’s alignment with EU treaties and proportionality. It called on the Commission to resubmit the proposal to Parliament if substantial amendments or replacements were planned, ensuring legislative continuity. The resolution underscored the need to address legal and procedural challenges while maintaining EU policy coherence, instructing the President to forward Parliament’s position to the Council, Commission, and national parliaments for further action.",
    "total_score": 0.7503628447024674,
    "total_choice": 7,
    "party_num": 2,
    "id": 46,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.1,
      0.9
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "transport & tourism",
    "title": "Rail passengers' rights and obligations: REPORT on the proposal for a regulation of the European Parliament and of the Council on rail passengers’ rights and obligations (recast)",
    "background": "The European Commission proposed recasting 2007 EU rail passenger rights rules in 2017 to address evolving consumer expectations, cross-border service integration challenges, and disparities in accessibility standards, aiming to align regulations with modern transport sustainability goals. The Parliament will discuss updating rail passenger rights and obligations to enhance service quality and consumer protections.",
    "stances": [
      {
        "party_name": "ENF",
        "score": 0.35294117647058826,
        "choice": 3,
        "stance": "ENF partly agrees compensation improvements in Article 8 but demands removal of the \"Gutscheinlösung\" mechanism, citing operational impracticality.  \nENF rejects Amendment 12's CO₂ emission disclosures on tickets as irrelevant to passenger rights, urging deletion to prevent legislative dilution.  \nENF opposes mandatory bicycle space provisions in Section 4b as exceeding EU competence, arguing this violates subsidiarity principles.  \nENF highlights fundamental conflict with issue's market-centric approach, emphasizing France's rail decline as evidence requiring increased public infrastructure investment (Article 23).  \nENF requests revision of consumer redress procedures to avoid disproportionate burdens on operators, aligning with Mayer's warning against \"unternehmerfeindlich\" measures."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.9423076923076923,
        "choice": 9,
        "stance": "GREEN_EFA fully advocates the codification of mandatory bicycle storage spaces in all trains, perfectly aligning with their decade-long advocacy for multimodal sustainable mobility.  \nGREEN_EFA perfectly aligns with the issue's rejection of force majeure exemptions for rail operators, ensuring ironclad passenger compensation rights mirroring their 2023 mobility justice manifesto.  \nGREEN_EFA fully advocates the issue's advancement of through-ticket standardization, which effectively realizes their cross-border rail integration priorities outlined in the European Green Deal.  \nGREEN_EFA perfectly aligns with provisions for real-time open data interfaces, a critical enhancement opportunity to achieve their vision of democratized transport information systems.  \nGREEN_EFA fully advocates expanding spontaneous mobility assistance to all stations, reflecting their uncompromising commitment to barrier-free public transit as demanded in the AccessibleEU Framework."
      }
    ],
    "resolution": "The European Parliament raised the adoption of a legislative resolution codifying existing EU transport legislation without substantive changes, following confirmation by the Consultative Working Party that the Commission’s proposal (COM(2017)0548) merely consolidated prior acts without altering their legal substance. The resolution endorsed the codified text, emphasizing the need to maintain legislative clarity and continuity in transport policy, and called on the Commission to resubmit the proposal to Parliament if future amendments substantially alter its content. It further instructed the Parliament’s President to transmit the adopted position to the Council, Commission, and national parliaments, ensuring alignment with procedural obligations under the Treaty on the Functioning of the European Union and the Interinstitutional Agreement on recasting legal acts.",
    "total_score": 0.726158038147139,
    "total_choice": 7,
    "party_num": 2,
    "id": 47,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.8,
      0.2
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "transport & tourism",
    "title": "New opportunities for small transport businesses: REPORT on new opportunities for small transport businesses, including collaborative business models",
    "background": "Small and medium-sized enterprises (SMEs) dominate the EU transport sector, facing regulatory complexity, market access barriers, and technological shifts. The rise of collaborative economy models and digital platforms has disrupted traditional business structures while increasing environmental and infrastructure pressures. The Parliament will discuss strategies for SMEs to adapt to digitalization and collaborative frameworks while balancing competitiveness, sustainability, and labor standards.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.8222222222222222,
        "choice": 8,
        "stance": "GREEN_EFA strongly agrees the issue's emphasis on strict regulatory frameworks for collaborative platforms, aligning perfectly with their commitment to preventing market monopolization and ensuring climate-conscious mobility systems.  \nGREEN_EFA approves the harmonization of EU rules to combat protectionism and fiscal dumping, which directly advances their vision of fair competition in sustainable transport markets.  \nGREEN_EFA proposes enhancing Article 12 by specifying criteria to distinguish cost-sharing collaborative platforms from professional service providers, ensuring legal clarity without opposing the issue's core objectives.  \nGREEN_EFA applauds the focus on SME access to innovation funding through the European Investment Fund, a critical step toward decarbonizing urban transport by 2050 as outlined in their climate agenda.  \nGREEN_EFA emphasizes the urgency of integrating worker protections into digital platform regulations, strongly endorsing the issue’s demand for compliance with social safeguards and collective bargaining rights."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.16666666666666666,
        "choice": 1,
        "stance": "GUE_NGL rejects the issue's approach to digitalization for failing to enforce binding safeguards against precarious labor conditions exacerbated by collaborative platforms.  \nGUE_NGL opposes fundamentally the reliance on market-driven harmonization rules, which risk entrenching corporate monopolies rather than empowering small cooperatives.  \nGUE_NGL condemns the issue's emphasis on funding mechanisms like EFSI, which prioritize private investors over public subsidies for grassroots transport initiatives.  \nGUE_NGL highlights the omission of strict data sovereignty clauses to prevent corporate control over mobility platforms, contradicting their anti-privatization principles.  \nGUE_NGL disputes the issue's framing of \"fair competition\" as inadequate to combat social dumping, demanding explicit bans on gig economy exploitation."
      }
    ],
    "resolution": "The European Parliament raised concerns and outlined strategies to support small transport businesses and collaborative economy models, emphasizing their critical role in the EU economy, where SMEs represent 99.8% of non-financial enterprises and account for two-thirds of jobs. It highlighted challenges such as regulatory fragmentation, barriers to market access, and difficulties in complying with environmental and safety standards, particularly for SMEs facing frequent emission regulation changes and limited access to finance despite their role in sustainable mobility, rural connectivity, and tourism. The resolution stressed the need to harmonize EU rules to combat protectionism, ensure fair competition, and address social dumping, while advocating for simplified funding mechanisms like the European Investment Fund and EFSI to support innovation. It acknowledged the transformative potential of digitalization and collaborative platforms (used by 17% of EU consumers) but warned of risks like market monopolization, precarious labor conditions, and data concentration. Recommendations included modernizing multimodal regulations, promoting integrated ticketing systems, fostering partnerships between SMEs and research institutions, and ensuring compliance with labor laws, including working hours and social protections. The Parliament urged the Commission to publish guidelines on collaborative economy regulations, harmonize transport data standards, and prioritize infrastructure investments while addressing disparities in rural and urban mobility. It also called for monitoring digitalization’s impact on jobs, supporting drone technology, and ensuring SMEs contribute to decarbonizing urban transport by 2050, balancing innovation with worker rights and consumer safety.",
    "total_score": 0.6754002911208151,
    "total_choice": 6,
    "party_num": 2,
    "id": 48,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.2,
      0.8
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "transport & tourism",
    "title": "Normalisation of the accounts of railway undertakings: RECOMMENDATION FOR SECOND READING on the Council position at first reading with a view to the adoption of a regulation of the European Parliament and of the Council repealing Regulation (EEC) No 1192/69 of the Council on common rules for the normalisation of the accounts of railway undertakings",
    "background": "The 1969 EU regulation allowed member states to compensate railway firms for public service obligations not required of other transport sectors, with varying national practices persisting amid evolving single market goals and calls for updated governance. The Parliament will discuss repealing the regulation to align railway accounting with modern EU transport policy frameworks.",
    "stances": [
      {
        "party_name": "ENF",
        "score": 0.6551724137931034,
        "choice": 6,
        "stance": "ENF supports the issue's framework for railway account normalization but proposes strengthening Article 4 to mandate enforceable social compliance audits across multinational operators.  \nENF advises amending recital 12 to require quarterly reporting on freight corridor performance, addressing regional service declines observed in France.  \nENF recommends inserting a safeguard clause prohibiting route abandonments without parliamentary consultation to protect peripheral regions.  \n  \nENF urges specifying \"theoretical social protections\" in Article 7(3) as binding obligations with EU-level penalties for noncompliance."
      },
      {
        "party_name": "SD",
        "score": 0.022857142857142857,
        "choice": 0,
        "stance": "SD rejects the omission of mandatory staff transfer obligations during operator changes, fundamentally undermining job security and service quality.  \nSD opposes the issue’s failure to integrate robust social protections, enabling market liberalization at the expense of workers’ rights.  \nSD condemns the lack of enforceable social criteria in public service obligations, contradicting their demand for fair labor conditions.  \nSD highlights the issue’s inconsistency with SD principles by permitting operator transitions without guaranteed employee retention.  \nSD denounces the prioritization of cost competition over social welfare, enabling exploitative labor practices in railway restructuring."
      }
    ],
    "resolution": "The European Parliament raised its approval of the Council’s first reading position (11197/1/2016 – C8‑0424/2016) on a legislative act originally proposed by the Commission (COM(2013)0026), adopting the act in line with the Council’s position. The resolution mandates the Parliament’s President to jointly sign the finalized act with the Council’s President under Article 297(1) of the Treaty on the Functioning of the European Union, ensuring its legal enactment. It further directs the Secretary-General to verify procedural compliance, coordinate with the Council’s Secretary-General, and publish the act in the Official Journal of the European Union. The Parliament also instructs its President to communicate the adopted position to the Council, Commission, and national parliaments, finalizing the legislative process without substantive amendments to the Council’s agreed text.",
    "total_score": 0.0899854862119013,
    "total_choice": 0,
    "party_num": 2,
    "id": 49,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.5,
      0.5
    ],
    "veto_party_name": "SD"
  },
  {
    "topic": "transport & tourism",
    "title": "Saving lives: boosting car safety in the EU: REPORT on saving lives: boosting car safety in the EU",
    "background": "Persistent high road fatalities (25,500 annual deaths) and serious injuries (135,000) in the EU, alongside stagnating fatality reduction rates, aging vehicle fleets, and risks to vulnerable road users, prompted calls for improved safety measures. The Parliament will discuss strategies to enhance vehicle safety standards and accident prevention technologies.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9478672985781991,
        "choice": 9,
        "stance": "EPP fundamentally sanctions the mandatory installation of advanced driver assistance systems, perfectly aligning with the issue’s focus on reducing human-error accidents through technologies like automatic emergency braking and intelligent speed assistance.  \nEPP perfectly aligns with the issue’s emphasis on equitable safety standards, advocating for mandatory retrofitting of older vehicles and rejecting cost burdens on consumers for critical technologies like tyre pressure monitoring and eCall systems.  \nEPP fully supports harmonized EU-wide infrastructure upgrades, including cycling paths and urban safety measures, to protect vulnerable users and achieve Vision Zero, as highlighted in the issue’s urban fatality reduction targets.  \nEPP fundamentally sanctions stricter post-market surveillance and EU-wide vehicle recalls, aligning with the issue’s demand for rigorous enforcement of safety standards across all member states.  \nEPP perfectly aligns with the issue’s call for data-driven accident analysis and autonomous vehicle development, emphasizing the urgency of integrating fire safety protocols for buses and modernized crash-test frameworks."
      },
      {
        "party_name": "EFDD",
        "score": 0.35714285714285715,
        "choice": 3,
        "stance": "EFDD partly promotes the focus on advanced safety technologies but requests revisions to include mandatory EU oversight mechanisms for infrastructure fund allocation, citing Italy's mismanagement as a critical flaw in current proposals.  \nThe proposal totally condemns with EFDD's principle of fiscal accountability by failing to enforce transparent audits of secondary road maintenance, where most fatalities occur.  \nEFDD opposes the issue's lack of binding requirements for real-time driver license validity checks, contradicting their insistence on preventing unlicensed driving through existing technologies.  \nThe issue overlooks critical aspects such as region-specific infrastructure targets, requiring amendments to allocate dedicated EU funds for high-risk areas like Southern Italy.  \nEFDD requests Article 12 be modified to impose penalties on member states that neglect secondary road upkeep, aligning with their demand for enforceable accountability in infrastructure spending."
      }
    ],
    "resolution": "The European Parliament raised concerns over annual road fatalities (25,500 deaths) and serious injuries (135,000) in the EU, urging accelerated action to achieve \"Vision Zero\" by addressing vehicle safety, infrastructure, and driver behavior. It called for mandatory installation of advanced driver assistance systems, including automatic emergency braking with pedestrian/cyclist detection, intelligent speed assistance, lane-keeping systems, and alcohol interlocks for professional drivers, emphasizing their potential to reduce accidents caused by human error (92% of cases). The resolution stressed harmonizing EU-wide standards, such as a 0.0% blood alcohol limit for new and professional drivers, and improving infrastructure maintenance, urban safety for vulnerable users (51% of urban fatalities), and cycling infrastructure. It highlighted the need for retrofitting older vehicles with safety technologies, stricter post-market surveillance, and EU-wide vehicle recalls for non-compliant models. Additional measures included mandatory tyre pressure monitoring, eCall system expansion to motorcycles and heavy vehicles, improved truck front-end design to reduce blind spots, and updated crash tests covering vulnerable road users. The Parliament urged alignment with UNECE regulations, enhanced Euro NCAP testing beyond minimum standards, and support for autonomous vehicle development to save lives. It also emphasized data-driven accident analysis, fire safety for buses, and incentives like tax reductions for retrofitting safety features, while ensuring data privacy and cybersecurity in connected vehicles.",
    "total_score": 0.8011126564673157,
    "total_choice": 8,
    "party_num": 2,
    "id": 50,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.9,
      0.1
    ],
    "veto_party_name": "EFDD"
  },
  {
    "topic": "transport & tourism",
    "title": "Safe use of remotely piloted aircraft systems (RPAS) in the field of civil aviation: REPORT on safe use of remotely piloted aircraft systems (RPAS), commonly known as unmanned aerial vehicles (UAVs), in the field of civil aviation",
    "background": "The rapid expansion of civil remotely piloted aircraft systems (RPAS) across EU member states, coupled with fragmented national regulations and the 2014 European Commission communication on market integration, highlighted safety, privacy, and economic coordination challenges. The Parliament will discuss establishing a harmonized EU regulatory framework for safe RPAS integration into civil aviation, balancing technological innovation with public protection.",
    "stances": [
      {
        "party_name": "EFDD",
        "score": 0.5384615384615384,
        "choice": 5,
        "stance": "EFDD supports the issue's recognition of RPAS economic potential but advises revising paragraph 22 to preserve national authorities' autonomy in certifying operators, avoiding centralized EU oversight inconsistent with subsidiarity.  \nEFDD endorses privacy-by-design mandates in paragraph 48 yet proposes stricter wording to prohibit aerial surveillance in residential areas unless authorized for emergency response.  \nEFDD highlights concerns about paragraph 21's \"harmonized framework\" as risking overreach, advocating amendments to limit EU coordination to airspace interoperability while retaining member states' enforcement discretion.  \nEFDD advises maintaining the 150 kg threshold for recreational drones in paragraph 22 with simplified registration to prevent burdens on hobbyists, aligning with growth-focused innovation.  \nEFDD supports geofencing requirements but urges explicit exemptions for agricultural/low-altitude industrial drones to reduce compliance costs for SMEs."
      },
      {
        "party_name": "GREEN_EFA",
        "score": 0.8409090909090909,
        "choice": 8,
        "stance": "GREEN_EFA strongly approves the issue's risk-based regulatory approach as essential for enabling sustainable growth in Europe's drone sector while protecting public safety.  \nGREEN_EFA applauds the emphasis on privacy-by-design standards, which aligns perfectly with their commitment to safeguarding digital rights and preventing surveillance overreach in emerging technologies.  \nGREEN_EFA proposes enhancing Article 12 to explicitly mandate lifecycle environmental assessments for drones, ensuring circular economy principles guide production and disposal practices from the sector's inception.  \nGREEN_EFA completely approves the call for clean propulsion systems, urging an amendment to specify renewable energy sources for drone operations to eliminate fossil fuel dependency and align with EU climate neutrality goals.  \nGREEN_EFA approves the focus on SME-driven innovation through Horizon 2020, noting this will accelerate green job creation in sustainable agriculture and disaster response applications."
      }
    ],
    "resolution": "The European Parliament raised the urgent need for a harmonized EU regulatory framework to integrate civil remotely piloted aircraft systems (RPAS/drones) safely into European airspace, emphasizing safety, privacy, economic growth, and global competitiveness. It highlighted the rapid expansion of both recreational and professional drone use, stressing the sector’s economic potential for SMEs and innovation, particularly in applications like infrastructure monitoring, disaster management, and precision agriculture. The resolution called for replacing the existing 150 kg weight threshold with a risk-based regulatory approach, prioritizing safety through technologies like \"detect-and-avoid\" systems, geofencing, and mandatory registration with ID chips to ensure traceability and accountability. It underscored the necessity of strict privacy and data protection safeguards, aligning with Directive 95/46/EC and the EU Charter of Fundamental Rights, including privacy-by-design standards and training for operators on data protection. The Parliament urged support for R&D through Horizon 2020 and SESAR to advance drone technologies, while addressing risks like airspace congestion, illegal weaponization, and surveillance concerns. It advocated for clear distinctions between recreational and professional use, mutual recognition of operator certifications, and collaboration with international bodies like JARUS to harmonize global standards. The resolution also emphasized public engagement, enforcement mechanisms, and regular EU-level evaluations to adapt regulations to technological advancements and ensure protection of fundamental rights.",
    "total_score": 0.7925373134328358,
    "total_choice": 7,
    "party_num": 2,
    "id": 51,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.6,
      0.4
    ],
    "veto_party_name": "GREEN_EFA"
  },
  {
    "topic": "transport & tourism",
    "title": "Unleashing the potential of waterborne passenger transport: REPORT on unleashing the potential of waterborne passenger transport",
    "background": "Europe’s extensive coastlines, rivers, and islands, alongside existing EU maritime regulations, climate commitments (COP21), and transport strategies (TEN-T, CEF), have highlighted waterborne transport’s potential for connectivity and sustainability. The Parliament will discuss optimizing waterborne passenger transport’s integration into EU mobility networks, addressing infrastructure, environmental standards, and accessibility challenges.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.941747572815534,
        "choice": 9,
        "stance": "EPP firmly agrees the issue's prioritization of cross-border waterway projects such as Danube-Oder-Elbe, which perfectly aligns with EPP's commitment to territorial cohesion and multimodal infrastructure development.  \nEPP perfectly aligns with the call to address climate-related navigability challenges through enhanced EU funding for river dredging and drought-resilient infrastructure, reinforcing the issue’s COP 21 alignment.  \nEPP firmly agrees the integration of renewable energy technologies in WPT operations, as emphasized in the debate, which advances EPP’s climate neutrality goals and green innovation agenda.  \nEPP perfectly supports the issue’s focus on harmonized safety standards and crew training, echoing the debate’s insistence on EU-wide certification to ensure passenger security and industry competitiveness.  \nEPP firmly agrees the issue’s push for digital ticketing integration and multimodal connectivity, which aligns with EPP’s digital single market priorities and urban congestion reduction strategies."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.041666666666666664,
        "choice": 0,
        "stance": "GUE_NGL rejects the issue's reliance on public-private partnerships and market-driven solutions, which fundamentally challenges with their principle that WPT development requires robust public investment and state leadership.  \nGUE_NGL opposes the omission of explicit safeguards against privatization and labor precarity, overlooking critical aspects such as worker protections and public ownership of transport infrastructure.  \nThe proposal’s emphasis on stimulating private sector involvement is inconsistent with GUE_NGL’s stance that only strong public intervention can resolve disinvestment and ensure territorial cohesion.  \nGUE_NGL fundamentally challenges with the issue’s failure to prioritize full public funding for infrastructure modernization, a prerequisite for addressing environmental and accessibility goals.  \nThe issue’s silence on reversing deregulation policies contradicts GUE_NGL’s demand for stringent labor and service quality standards in waterborne transport sectors."
      }
    ],
    "resolution": "The European Parliament raised the need to prioritize waterborne passenger transport (WPT) in EU and Member State policies, advocating for a \"single area for WPT\" by reducing cross-border administrative burdens. It emphasized integrating WPT into the trans-European transport network (TEN-T) and Connecting Europe Facility (CEF), addressing infrastructure bottlenecks, and enhancing intermodal connectivity with rail and urban transport. The resolution highlighted environmental sustainability, urging alignment with COP 21 goals to reduce CO2 emissions, promote LNG and alternative fuels, and enforce stricter air pollution standards, including Baltic Sea sulphur limits. It called for harmonized accident statistics, improved safety measures (e.g., mandatory River Information Services, crew training, and EU-wide emergency systems), and alignment with passenger rights under Regulation (EU) No 1177/2010, particularly for persons with disabilities. The Parliament stressed WPT's role in sustainable tourism, territorial cohesion, and lifeline connections for remote regions, advocating EU funding for SMEs and infrastructure, including LNG bunkering by 2025 (maritime ports) and 2030 (inland ports). It also urged innovation in shipbuilding, digital ticketing integration, and leveraging EU strategies (e.g., Danube, Baltic) to enhance competitiveness, safety, and service quality while addressing regional challenges like Mediterranean ferry upgrades and urban congestion relief.",
    "total_score": 0.7569141193595342,
    "total_choice": 7,
    "party_num": 2,
    "id": 52,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.3,
      0.7
    ],
    "veto_party_name": "EPP"
  },
  {
    "topic": "transport & tourism",
    "title": "Use of vehicles hired without drivers for the carriage of goods by road: REPORT on the proposal for a directive of the European Parliament and of the Council amending Directive 2006/1/EC on the use of vehicles hired without drivers for the carriage of goods by road",
    "background": "Directive 2006/1/EC governed hired freight vehicles without drivers, but evolving industry practices and divergent national restrictions created market inefficiencies, hindering fleet modernization and cross-border operations. The Parliament will discuss amending the directive to harmonize regulations, balancing single market access with environmental and safety standards in road freight transport.",
    "stances": [
      {
        "party_name": "ALDE",
        "score": 0.9242424242424242,
        "choice": 9,
        "stance": "ALDE entirely supports the issue’s framework for liberalizing cross-border vehicle hire markets, perfectly aligning with their commitment to economic efficiency and barrier-free intra-EU trade.  \nALDE highlights the issue’s provisions for standardized license plate registration as critical to enforcing fair competition, directly advancing ALDE’s priorities for transparent market governance.  \nALDE applauds the balanced safeguards against tax-driven regulatory arbitrage, which align with their principles of equitable fiscal practices while preserving market access.  \nALDE emphasizes that the issue’s support for newer, cleaner hired vehicles effectively advances sustainability goals, a core pillar of ALDE’s transport policy agenda.  \nALDE commends the mandatory intergovernmental data-sharing mechanisms as exemplary of their vision for seamless administrative cooperation across member states."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.02040816326530612,
        "choice": 0,
        "stance": "GUE_NGL entirely challenges the issue for enabling unrestricted vehicle hire durations, which directly facilitates tax evasion and undermines social protections for transport workers.  \nGUE_NGL rejects the proposal’s failure to cap fleet rental volumes at 25%, a measure critical to preventing mailbox company fraud and safeguarding state revenues.  \nThe issue’s four-month minimum rental allowance starkly contradicts GUE_NGL’s demands for ecological transition by incentivizing road freight over sustainable rail alternatives.  \nGUE_NGL condemns the text’s omission of worker safeguards, which perpetuates abusive labor practices and systemic exploitation in cross-border transport operations.  \nThis proposal overlooks GUE_NGL’s imperative to combat social dumping, instead institutionalizing a deregulatory framework that prioritizes corporate flexibility over public interest."
      }
    ],
    "resolution": "The European Parliament raised its adoption of a position at first reading on the Commission’s 2017 proposal concerning transport policies, aiming to align EU legislation with evolving sectoral needs. The resolution emphasized the importance of parliamentary scrutiny by urging the Commission to resubmit the proposal if it intends to substantially amend or replace its original text, ensuring democratic oversight. It instructed the Parliament’s President to formally communicate its adopted position to the Council, Commission, and national parliaments, reinforcing procedural transparency and interinstitutional cooperation. The resolution referenced the legal basis under Article 91(1) of the Treaty on the Functioning of the EU and incorporated input from the Committee on Transport and Tourism’s 2018 report, while acknowledging consultations with the European Economic and Social Committee and the Committee of the Regions.",
    "total_score": 0.45850340136054424,
    "total_choice": 4,
    "party_num": 2,
    "id": 53,
    "parliament_terms": "8th_datas",
    "seat_weights": [
      0.7,
      0.3
    ],
    "veto_party_name": "ALDE"
  },
  {
    "topic": "transport & tourism",
    "title": "EU Road Safety Policy Framework 2021-2030 – Recommendations on next steps towards \"Vision Zero\": REPORT on the EU Road Safety Policy Framework 2021-2030 – Recommendations on next steps towards ‘Vision Zero’ | A9-0211/2021 | European Parliament",
    "background": "Persistent high road fatalities (22,700 annual deaths) and serious injuries (120,000), stagnating reduction rates since 2010, missed 2020 targets, and emerging risks from automation and vulnerable road users underpin the EU’s 2021-2030 road safety framework aiming for Vision Zero by 2050. The Parliament will discuss strategies to enhance road safety governance, infrastructure, vehicle standards, and enforcement across member states.",
    "stances": [
      {
        "party_name": "ID",
        "score": 0.36923076923076925,
        "choice": 3,
        "stance": "ID totally doubts the Vision Zero 2050 target as unrealistic, asserting that traffic fatalities are an inevitable reality requiring pragmatic improvements rather than utopian goals.  \nID rejects blanket 30 km/h urban speed limits, condemning them as disproportionate restrictions emblematic of EU overregulation and hostile to efficient mobility.  \nID disputes the necessity of zero-tolerance blood alcohol limits, maintaining current 0.5-0.8‰ thresholds adequately balance safety with personal responsibility.  \nThe issue’s emphasis on automated vehicle technologies conflicts with ID’s prioritization of driver autonomy and skepticism toward overreliance on unproven systems.  \nID warns that the proposal’s systemic approach undermines national subsidiarity, demanding greater emphasis on member state flexibility in road safety policy implementation."
      },
      {
        "party_name": "GUE_NGL",
        "score": 1.0,
        "choice": 9,
        "stance": "GUE_NGL fully advocates the Vision Zero target and its 2050 fatality elimination goal, perfectly aligning with their commitment to eradicating preventable public health crises through systemic infrastructure and policy reforms.  \nGUE_NGL perfectly aligns with the issue’s emphasis on protecting vulnerable road users via urban speed limits and TEN-T cycling integration, advancing their priority of equitable mobility justice.  \nGUE_NGL unequivocally supports binding vehicle safety standards like intelligent speed assistance, recognizing these technologies as critical to achieving the 2030 target of halving deaths, consistent with their advocacy for regulatory interventions that prioritize human life over market interests.  \nGUE_NGL highlights the issue’s synergy with road safety education imperatives, including experiential driver training programs noted in the debate, which reinforce behavioral change central to the safe system approach.  \nGUE_NGL applauds the demand for EU-wide enforcement of blood alcohol limits and cross-border traffic offense penalties, reflecting their longstanding stance on harmonized social protections to combat transport-related inequalities."
      }
    ],
    "resolution": "The European Parliament raised concerns over the EU’s stagnant progress in reducing road fatalities, noting approximately 22,700 annual deaths and 120,000 serious injuries, with vulnerable road users—motorcyclists, cyclists, and pedestrians—representing a growing share of fatalities. It endorsed the Vision Zero target of near-zero road deaths by 2050 and a 50% reduction in deaths and serious injuries by 2030, aligning with the Valletta Declaration. Key measures included adopting a safe system approach with harmonized key performance indicators (KPIs) for infrastructure, vehicle safety, and road user behavior, urging EU funding for road safety through programs like the Connecting Europe Facility and national road safety funds. The resolution emphasized upgrading infrastructure through risk mapping, safer urban design (e.g., 30 km/h zones), and integrating cycling/walking infrastructure into TEN-T networks. Vehicle safety reforms highlighted mandatory advanced driver-assistance systems (e.g., intelligent speed assistance, emergency lane-keeping) under the General Safety Regulation, projected to save 7,300 lives by 2030, and called for anti-lock braking systems and eCall mandates for motorcycles. It advocated stricter enforcement of cross-border traffic offenses, harmonized blood alcohol limits (zero tolerance for drugs), and updated driving license standards with graduated licensing and fatigue prevention measures. Additional priorities included addressing risks from automated vehicles, improving post-crash response, combating odometer fraud, and promoting road safety education. The resolution stressed synergies with sustainability goals, urging modal shifts to public transport and active mobility, while calling for EU-wide data frameworks, corporate accountability in supply chains, and a potential European road transport agency to oversee implementation.",
    "total_score": 0.8723404255319149,
    "total_choice": 8,
    "party_num": 2,
    "id": 54,
    "parliament_terms": "9th_datas",
    "seat_weights": [
      0.2,
      0.8
    ],
    "veto_party_name": "GUE_NGL"
  },
  {
    "topic": "transport & tourism",
    "title": "EU Strategy for Sustainable Tourism: REPORT on establishing an EU strategy for sustainable tourism | A9-0033/2021 | European Parliament",
    "background": "The COVID-19 pandemic caused a 70% decline in EU tourism in 2020, threatening 27 million jobs and regions reliant on the sector. Pre-existing challenges included environmental impacts (8% of global CO₂ emissions), SME vulnerabilities, and disparities in transport connectivity, particularly affecting coastal, rural, and outermost regions. The Parliament will discuss an EU-wide strategy to address tourism sustainability, resilience, and economic recovery.",
    "stances": [
      {
        "party_name": "EPP",
        "score": 0.9425287356321839,
        "choice": 9,
        "stance": "EPP entirely sanctions the issue's call for immediate financial support to SMEs and micro-enterprises, perfectly aligning with EPP's longstanding commitment to safeguarding Europe's economic backbone through targeted Next Generation EU fund allocations.  \nEPP perfectly aligns with the demand for binding EU-wide health protocols and interoperable vaccination certificates, effectively advancing EPP's priority of restoring cross-border mobility while maintaining public health security through the Digital Green Certificate framework.  \nEPP entirely sanctions establishing a dedicated EU Tourism Agency, recognizing this as critical to achieving EPP's strategic goal of centralized crisis management and harmonized data-driven policymaking in the sector.  \nEPP perfectly aligns with the issue's emphasis on sustainable tourism transition, particularly through rail infrastructure investments and Ecolabel expansion, directly supporting EPP's Green Deal implementation roadmap.  \nEPP entirely sanctions the proposed EU hygiene certification seal and VAT reductions, viewing these as essential enhancements to consumer confidence and market competitiveness in line with EPP's single market principles."
      },
      {
        "party_name": "ID",
        "score": 0.8769230769230769,
        "choice": 8,
        "stance": "ID strongly approves the issue’s emphasis on urgent financial aid for SMEs and reduced VAT rates, which align with ID’s priority to protect France’s tourism-dependent economies and safeguard millions of jobs.  \nID proposes enhancing crisis management structures within the proposed EU Tourism Agency by integrating lessons from vaccine procurement delays, ensuring future health protocols prioritize widespread PCR testing to preserve travel freedoms.  \nID applauds the focus on rural and coastal regions, echoing its commitment to tailored support for areas disproportionately impacted by lockdowns, such as mountain communities affected by ski station closures.  \nID advocates maintaining health autonomy by amending harmonized protocols to prioritize testing over vaccination mandates, ensuring citizens’ freedom of choice while restoring safe travel.  \nID approves the call for digitalization and rail travel promotion, which aligns with its push for pragmatic, market-driven modernization without imposing centralized green mandates on businesses."
      }
    ],
    "resolution": "The European Parliament raised concerns about the severe impact of the COVID-19 pandemic on the EU tourism sector, which previously contributed 10.3% of EU GDP and employed 27 million people (11.2% of total employment), with at least six million jobs now at risk and international arrivals dropping by 70% in 2020. It emphasized the urgent need for coordinated EU-wide health protocols, including harmonized testing strategies, interoperable vaccination certificates, and an EU hygiene certification seal to restore safe travel and consumer confidence. The resolution called for substantial financial support, urging Member States to allocate Next Generation EU funds—including €161 billion identified for the tourism ecosystem—to sector recovery, while advocating reduced VAT rates for tourism services and direct aid for SMEs, which dominate the sector. It stressed the transition to sustainable tourism, highlighting the sector’s 8% contribution to global CO₂ emissions, and urged alignment with the European Green Deal through measures like promoting rail travel, cycling tourism, circular economy practices, and expanding Ecolabel certifications. The Parliament advocated for a dedicated EU Tourism Agency to streamline crisis management, data collection, and funding access, while addressing overtourism, protecting cultural heritage, and enhancing accessibility for disabled travelers. It underscored the vulnerability of coastal, rural, and outermost regions—where 51.7% of EU tourist accommodations are located—calling for tailored support to ensure connectivity and climate resilience. Additional priorities included digitalization of services, modernization of passenger rights frameworks, and fostering innovative tourism models like agrotourism and health tourism to diversify the sector and ensure long-term resilience.",
    "total_score": 0.8207681365576103,
    "total_choice": 8,
    "party_num": 2,
    "id": 55,
    "parliament_terms": "9th_datas",
    "seat_weights": [
      0.2,
      0.8
    ],
    "veto_party_name": "ID"
  },
  {
    "topic": "transport & tourism",
    "title": "Revision of the Trans-European Transport Network (TEN-T) guidelines: REPORT on the revision of the Trans-European Transport Network (TEN-T) guidelines | A9-0251/2020 | European Parliament",
    "background": "The Trans-European Transport Network (TEN-T) guidelines, established in 2013, faced implementation delays in cross-border projects and infrastructure gaps, exacerbated by COVID-19 supply chain disruptions. The European Green Deal’s climate targets and Brexit’s impact on EU-UK connectivity necessitated updated transport policies. The Parliament will discuss revising TEN-T guidelines to enhance sustainability, multimodal integration, and address delays.",
    "stances": [
      {
        "party_name": "SD",
        "score": 0.9793103448275862,
        "choice": 9,
        "stance": "SD absolutely upholds the issue’s imperative to finalize TEN-T’s core network by 2030, emphasizing multimodal connectivity and resilient infrastructure as pivotal to advancing territorial cohesion and crisis-proofing transport systems, aligning perfectly with SD’s commitment to equitable regional development.  \nSD perfectly aligns with the prioritization of rail electrification and ERTMS deployment, underscoring rail’s role as the decarbonization backbone and the necessity of €15 billion investments to eliminate bottlenecks, directly advancing SD’s climate neutrality agenda under the European Green Deal.  \nSD unequivocally supports the integration of alternative fuels infrastructure across all transport modes, particularly mega-chargers and hydrogen stations along TEN-T corridors, ensuring no east-west divide in sustainable mobility and fulfilling SD’s manifesto pledge for technological inclusivity.  \nSD champions the issue’s focus on peripheral, island, and rural accessibility through motorways of the sea and short-sea shipping, which mirrors SD’s long-standing advocacy for territorial solidarity and inclusive growth across all EU regions.  \nSD applauds the call for dual-use infrastructure to enhance military mobility while maintaining civilian connectivity, a strategic synergy that aligns with SD’s vision of a geopolitically resilient and socially unified Europe."
      },
      {
        "party_name": "GUE_NGL",
        "score": 0.7692307692307693,
        "choice": 7,
        "stance": "GUE_NGL strongly advocates accelerating TEN-T completion to ensure equitable development in peripheral and island regions, aligning perfectly with their commitment to reducing regional disparities.  \nGUE_NGL strongly endorses prioritizing rail infrastructure and sustainable fuels like renewable hydrogen, effectively advancing the European Green Deal’s climate neutrality objectives.  \nGUE_NGL emphasizes reversing network maintenance budget cuts, proposing enhanced CEF funding to address safety and prevent loss of life, in line with the issue’s call for increased infrastructure resilience.  \nGUE_NGL urges explicit inclusion of Western Balkans in TEN-T through dedicated funding mechanisms, enhancing the issue’s strategic connectivity goals while ensuring necessary investments are secured."
      }
    ],
    "resolution": "The European Parliament raised the critical importance of completing the Trans-European Transport Network (TEN-T) core network by 2030 and the comprehensive network by 2050 to enhance EU cohesion, competitiveness, and sustainability. It stressed the need to address delays, particularly in cross-border projects and missing links, exacerbated by insufficient funding, administrative hurdles, and uneven Member State commitment, as highlighted by the European Court of Auditors. The resolution emphasized aligning national transport plans with TEN-T objectives, prioritizing multimodal connectivity (including ports, airports, and railways), and accelerating the deployment of alternative fuels infrastructure (e.g., electric charging, hydrogen refueling) to meet climate neutrality goals under the European Green Deal. It called for increased funding through EU instruments like the Connecting Europe Facility (CEF), Recovery and Resilience Facility, and InvestEU, while criticizing proposed budget cuts. The Parliament urged digitalization of transport systems (e.g., ERTMS, RIS) and infrastructure resilience against crises like pandemics and climate change. It highlighted rail as a backbone for decarbonization, advocating for ERTMS deployment (requiring €15 billion) and high-speed rail expansion. Strategic priorities included integrating third countries (Western Balkans, Eastern Partnership) into TEN-T, maintaining post-Brexit connectivity with the UK, and enhancing military mobility through dual-use infrastructure. The resolution also stressed port and inland waterway upgrades, maritime sustainability, and synergies with energy and digital networks, while ensuring accessibility for peripheral, island, and rural regions.",
    "total_score": 0.9332386363636364,
    "total_choice": 9,
    "party_num": 2,
    "id": 56,
    "parliament_terms": "9th_datas",
    "seat_weights": [
      0.9,
      0.1
    ],
    "veto_party_name": "GUE_NGL"
  },
  {
    "topic": "transport & tourism",
    "title": "Tourism and transport in 2020 and beyond: JOINT MOTION FOR A RESOLUTION on Transport and Tourism in 2020 and beyond | RC-B9-0166/2020 | European Parliament",
    "background": "The COVID-19 pandemic severely disrupted EU tourism and transport sectors, which contributed 9.5% of GDP and 11.2% of employment pre-crisis, while pre-existing challenges like overtourism’s environmental impacts and fragmented cross-border coordination amplified vulnerabilities. The Parliament will discuss measures to address the sectors’ recovery and long-term sustainability amid economic and climate-related pressures.",
    "stances": [
      {
        "party_name": "GREEN_EFA",
        "score": 0.9436619718309859,
        "choice": 9,
        "stance": "GREEN_EFA fundamentally accepts the issue’s emphasis on sustainable tourism aligned with climate goals, perfectly aligning with their manifesto for decarbonizing transport and prioritizing rail, cycling, and agro-ecological rural development.  \nGREEN_EFA applauds the call to invest in green infrastructure such as night trains and cycling networks, which mirrors their decade-long advocacy for shifting subsidies from aviation to low-carbon mobility.  \nGREEN_EFA commends the integration of rural and agro-ecotourism into recovery strategies, recognizing this as a critical step toward biodiversity preservation and equitable regional growth as outlined in their 2024 policy framework.  \nGREEN_EFA perfectly aligns with the demand for uniform hygiene standards and EU safety certification, viewing these as essential to rebuilding traveler trust while advancing their vision of health-conscious, environmentally responsible tourism.  \nGREEN_EFA strongly sanctions the issue’s focus on protecting workers and promoting accessibility, reflecting their unwavering commitment to social justice and inclusive travel ecosystems."
      },
      {
        "party_name": "ID",
        "score": 0.1076923076923077,
        "choice": 1,
        "stance": "ID rejects the issue's emphasis on Green Deal climate targets for transport, absolutely againsting with ID's position that environmental regulations cripple economic recovery in vital sectors.  \nThe proposal overlooks critical aspects such as deregulating coastal investment rules, directly opposing ID's demand to exempt tourism infrastructure from EU services directive constraints.  \nID opposes the centralized hygiene certification framework as incompatible with national sovereignty principles, advocating instead for member-state autonomy in safety protocols.  \nThe issue's reliance on digital transition funding fails to address ID's core demand for immediate tax relief measures like abolishing CFE charges and mandating state-guaranteed loans.  \nThis approach contradicts ID's emergency recovery priorities by prioritizing climate alignment over urgent liquidity support for SMEs facing 70% revenue declines."
      }
    ],
    "resolution": "The European Parliament raised concerns about the severe impact of COVID-19 on the EU’s tourism and transport sectors, which contributed 9.5% to EU GDP and employed 22.6 million people (11.2% of total employment) in 2019, with at least 6.4 million jobs at risk. It emphasized the need for short- and long-term recovery strategies, including coordinated EU-wide health protocols, mutual recognition of COVID-19 measures, and lifting travel restrictions based on epidemiological criteria to restore safe mobility. The resolution called for sustainable tourism aligned with climate goals, urging investments in green and digital transitions, infrastructure modernization (e.g., TEN-T core network by 2030), and support for SMEs, which face a projected 70% drop in turnover in 2020. It advocated for an EU safety certification seal for tourism facilities, uniform hygiene standards, and crisis-management mechanisms to address future shocks. Financial measures included leveraging the €750 billion Next Generation EU recovery package, prioritizing tourism in the Recovery and Resilience Facility, and ensuring access to EU funds for regions disproportionately affected, such as outermost and island areas. The Parliament highlighted cultural tourism (40% of EU tourism) and rural/agro-ecotourism as priorities, stressing the role of EU programs like DiscoverEU and LEADER. It urged measures to protect vulnerable workers, promote accessibility for persons with disabilities, and integrate sport and gastronomy into tourism strategies. The resolution also called for harmonized voucher rules, a European Travel Guarantee scheme, and digital tools to rebuild traveler confidence while safeguarding data privacy and consumer rights.",
    "total_score": 0.8326241134751773,
    "total_choice": 8,
    "party_num": 2,
    "id": 57,
    "parliament_terms": "9th_datas",
    "seat_weights": [
      0.1,
      0.9
    ],
    "veto_party_name": "ID"
  }
]